{"teams":[{"id":108,"slug":"koo-tigers","name":"ROX Tigers","guid":"be6e3e07-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/koo-tigers-5xgsd4td.png","acronym":"ROX","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:04.000Z","bios":{"en_US":"<p>The ROX Tigers are ferocious in their pursuit of victory. The team formerly known as the KOO Tigers formed in 2014 and quickly evolved into one of the LCK’s elite predators. While they maintained a spot among the best, SK Telecom T1 seemed to have their number. Their fortunes turned in Champions Summer 2016, when they finally claimed their first title and stepped out of the shadow of Faker and company.</p>\n\n<p>Their triumph was short lived. When ROX met SKT again in the semifinals at the 2016 World Championship, ROX lost a close series to their rivals. After a huge roster shakeup that saw many fan favorites depart, ROX heads into 2017 looking to forge a new path to the top of the food chain.</p>","fr_FR":"KOO Tigers (précédemment GE Tigers) s'est formée en 2014, récupérant des joueurs chez NaJin Sword, NaJin Shield et Incredible Miracle. KOO, malgré cette composition éclectique, a vite su trouver l'unité requise pour combattre. Koo a obtenu la 2e place lors du Segment de printemps des LCK 2015 et a grimpé jusqu'aux demi-finales du Championnat du monde IEM Saison IX dans l'année qui a suivi sa formation.","pl_PL":"KOO Tigers (wcześniej znane jako GE Tigers) zostało utworzone w 2014 roku, zbierając graczy z NaJin Sword, NaJin Shield i Incredible Miracle. KOO szybko stało się zgraną drużyną, mimo że dla obserwatorów z zewnątrz mogło wyglądać nieco jak stwór Frankensteina. KOO zajęło 2. miejsce podczas wiosennego split LCK 2015 i dotarło do półfinałów mistrzostw świata sezonu dziewiątego IEM w ciągu roku od utworzenia.","de_DE":"<p>Dir ROX Tigers (ehemals KOO Tigers) wurden 2014 mit Spielern von NaJin Sword, NaJin Shield und Incredible Miracle gegründet. ROX verschmolz schnell zu einer eingeschworenen Einheit, obwohl die Mannschaft für Außenstehende wie eine von Frankensteins Kreationen aussah. Obwohl ROX eine der stärksten Mannschaften in der LCK war, schnappte SK Telecom T1 ihnen jeden Erfolg vor der Nase weg. Doch 2016 wendete sich das Blatt zugunsten der Tigers, als sie ihren ersten Split in der LCK gewannen und endlich aus dem Schatten von Faker und dessen Kameraden treten konnten. ROX hat zwar gerade erst den ersten Titel in der LCK gewonnen, aber jetzt richten sie ihre Augen auf das ultimative Ziel: Die Trophäe der Weltmeisterschaft 2016.</p>","es_ES":"<p>ROX Tigers (anteriormente llamado KOO Tigers) es un equipo formado en 2014 a partir de los jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se convirtió enseguida en una unidad de batalla, aunque pareciese un equipo Frankenstein para quien lo viese desde fuera. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapársele de las manos, pues SK Telecom T1 se la arrebataba una y otra vez. La suerte de los Tigers cambió en 2016 cuando finalmente consiguieron ganar su primer split de la LCK, lo que les hizo salir de la sombra de Faker y compañía. Puede que ROX haya conseguido su primer título de la LCK, pero ahora tiene la mirada puesta en su objetivo definitivo: el trofeo del Campeonato Mundial 2016.</p>","pt_BR":"A ROX Tigers (antiga KOO Tigers) foi formada em 2014, trazendo jogadores da NaJin Sword, NaJin Shield e Incredible Miracle. Mas a ROX rapidamente se integrou formando uma única unidade de combate, mesmo com muitos dizendo que essa equipe seria um frankenstein.  Apesar de ser uma das equipes mais fortes da LCK, a vitória parecia evitá-los constantemente toda vez que se encontravam com a SK Telecom T1. Mas a sorte da Tiger mudou em 2016 quando finalmente conseguiram ganhar sua primeira Etapa da LCK, saindo assim das sombras de Faker e companhia. A ROX pode ter conseguido levar para a casa seu primeiro título da LCK, mas agora eles estão de olho em um prêmio muito maior: o troféu do Campeonato Mundial 2016.","ko_KR":"<p>ROX Tigers(전 KOO/GE Tigers)는 2014년에 NaJin Sword, NaJin Shield, Incredible Miracle 출신 선수들을 모아 창단한 팀입니다. 언뜻 보기에는 마구잡이로 선수들을 한 팀에 모아놓은 듯했지만 창단 후 얼마 되지 않아 가공할 만한 모습을 보이기 시작했죠. </p>\n<p>창단 후 채 1년도 지나지 않은 시점에서 2015 LCK 스프링에서 2위에 올랐고 IEM 시즌 IX 월드 챔피언십에서는 준결승까지 진출했을 정도니까요. 뒤이어 2015 월드 챔피언십에서는 당당히 2위에 오르며 세계 최강팀 중 하나로 자리매김했습니다. 2016 스프링 정규 시즌에서는 16승 2패로 1위를 했지만, 플레이오프 결승에서 SKT T1에 3대1로 패하면서 아쉽게 2016 스프링 시즌에 우승하지는 못하였습니다.</p>\n","es_AR":"<p>ROX Tigers (anteriormente conocidos como KOO Tigers) se formó en el 2014 con jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se armó como una unidad de lucha, aún cuando los ojos ajenos miraban al equipo como apenas un rejunte de miembros. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapárseles siempre, ya que SK Telecom T1 les bloqueaba el paso en todas las oportunidades. La suerte de los Tigers cambió en el 2016, cuando finalmente ganaron su primer torneo de la LCK, lo que les permitió salir de la sombra de Faker y compañía. ROX se adjudicó su primer título de LCK, pero ahora su foco está en el objetivo principal: el trofeo del Campeonato Mundial 2016.</p>\n\n<p><strong>Entrenador: Kim \"Ssong\" Sang-su</strong></p>"},"foreignIds":{"drupalId":"3641"},"players":[572,742,1044,1045,1231,1270,2049],"starters":[572,1044,1045,1231,2049],"subs":[742,1270]},{"id":241,"slug":"albus-nox-luna","name":"Albus NoX Luna","guid":"be71ab18-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-apxmut87.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-inrjjbeg.png","acronym":"ANX","homeLeague":"urn:rg:lolesports:global:league:league:1","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-3isj008z.png","createdAt":"2016-08-19T21:26:13.000Z","updatedAt":"2016-10-11T14:45:11.000Z","bios":{"en_US":"<p>\nAlbus NoX Luna, previously known as Hard Random, recently collected their fifth title as the CIS regional champions, and they are ready to shine at the 2016 World Championship. Sporting a new name, but backed by the same passion, these players are hungry for more. Their struggles at past international events will be laid to rest if they can deliver some wins at League's most prestigious event.\n</p>\n<p>\nCoach: Konstantin “Ansva” Chanchikov   \n</p>","pt_BR":"A Albus NoX Luna, antes conhecida como Hard Random ganhou recentemente seu quinto título de campeões regionais da CEI e estão prontos para brilhar no Campeonato Mundial 2016. Com um novo nome, mas com a mesma paixão de sempre, esses jogadores querem mais. Suas dificuldades enfrentadas nos últimos eventos internacionais poderão finalmente ser esquecidas se eles conseguirem algumas vitórias no evento mais prestigiado do League.","de_DE":"<p>Albus NoX Luna, ehemals bekannt als Hard Random, gewann vor Kurzem den dritten Titel bei der CIS und will jetzt bei der Weltmeisterschaft 2016 glänzen. Trotz des neuen Namens brennt in der Mannschaft noch die alte Leidenschaft und die Spieler haben Lust auf mehr. Mit ein paar Siegen beim wichtigsten internationalen Event von League könnten sie ihre Probleme aus der Vergangenheit hinter sich lassen.</p>\n<p>Coach: Konstantin „Ansva“ Chanchikov</p>","es_AR":"<p>Albus NoX Luna, anteriormente conocidos como Hard Random, recientemente acumularon su quinto título como los campeones regionales de la CIS y están listos para brillar en el Campeonato Mundial 2016. Portando un nuevo nombre, pero respaldados por la misma pasión, estos jugadores vienen con hambre de más. Su lucha en eventos internacionales pasados quedará sepultada si pueden conseguir algunas victorias en el más prestigioso evento de League.</p>\n\n<p><strong>Entrenador: Konstantin \"Ansva\" Chanchikov</strong></p>","es_ES":"<p>Albus NoX Luna, anteriormente conocidos como Hard Random, se hicieron hace poco con su quinto título como campeones de la región CIS y están listos para brillar en el Campeonato Mundial 2016. Aunque lleven un nombre nuevo, los mueve la pasión de siempre y estos jugadores están hambrientos de llegar más lejos. Pondrán fin a sus problemas en eventos internacionales pasados si consiguen algunas victorias en el evento más famoso de League of Legends.</p>","pl_PL":"<p>Albus NoX Luna, poprzednio znani pod nazwą Hard Random, niedawno zdobyli piąty tytuł regionalnych mistrzów CIS i są gotowi zabłysnąć na Mistrzostwach Świata 2016. Mają nową nazwę, ale napędza ich ta sama pasja — ci zawodnicy łakną więcej sukcesów. Zapomną o trudach zmagań minionych imprez międzynarodowych, jeśli zdołają zdobyć kilka zwycięstw na najbardziej prestiżowym wydarzeniu League of Legends.</p>\n<p>Trener: Konstantin „Ansva” Chanchikov   </p>\n"},"foreignIds":{},"players":[125,828,830,1218,1411,1413],"starters":[125,828,830,1218,1411],"subs":[1413]}],"players":[{"id":125,"slug":"likkrit","name":"Likkrit","firstName":"Kirill","lastName":"Malofeev","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/likkrit-fgb3ia69.png","hometown":"Moscow","region":"International Wildcard","birthdate":"1995-10-04","createdAt":"2014-08-06T16:19:17.000Z","updatedAt":"2017-07-05T18:20:48.000Z","bios":{"en_US":"<p>The Bard God is back. Last spring Likkrit found fame worldwide as one of the strongest support players in the Wildcard scene. His pool of champions played at the highest level is huge, and his Bard in particular is always a threat on the roam. Likkrit does have one weakness though -- he doesn't enjoy playing \"classic\" supports, such as Janna or Nami. Where's the fun in playing someone who can't roam for a stun and a kill?</p>","de_DE":"<p>Der Bard-Gott ist zurück. Im letzten Frühjahr wurde Likkrit als einer der besten Supporter der „Wildcard“-Szene weltweit berühmt. Er kann auch auf höchstem Niveau auf einen großen Champion-Pool zurückgreifen und wenn er Bard spielt, wird er zur umherwandernden Bedrohung. Likkrit hat jedoch eine Schwachstelle: Er spielt nicht gerne „klassische“ Supporter wie Janna oder Nami. Wo bleibt der Spaß, wenn man einen Champion spielt, mit dem man nicht herumwandern und Gegner töten kann?\t</p>","es_ES":"<p>El dios de Bardo ha vuelto. Likkrit alcanzó la fama mundial en la pasada primavera como uno de los jugadores de apoyo más potentes en el panorama wildcard. Su plantel de campeones al máximo nivel es enorme y, sobre todo, su Bardo es una amenaza siempre que se pone a deambular. No obstante, sufre de una debilidad: no le gusta jugar con apoyos \"clásicos\" como Janna o Nami. ¿Dónde está la diversión en jugar un campeón que no puede deambular y acertar un aturdimiento que acaba en un asesinato?</p>","pl_PL":"<p>Bóg Barda powrócił. Ubiegłej wiosny Likkrit zdobył międzynarodową sławę jako jeden z najsilniejszych wspierających na scenie dzikich kart. Pula bohaterów, którymi gra na najwyższym poziomie, jest bogata, ale szczególnymi względami darzy Barda. Likkrit ma jednak jedną słabość — nie lubi grać „klasycznymi” wspierającymi, jak Janna czy Nami. Co to za zabawa, grać kimś, kto nie nadaje się do wędrowania w poszukiwaniu ofiar, które można ogłuszyć i zabić?</p>"},"foreignIds":{"drupalId":"3140","TRLH1":"1001380077","TRLH2":"1001280047","ESPORTSTMNT04":"200001502"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":572,"slug":"sangyoon","name":"Sangyoon","firstName":"Sangyun","lastName":"Kwon","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sangyoon-7zedseul.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:53:57.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4334","ESPORTSTMNT06":"200000376"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":742,"slug":"shy","name":"Shy","firstName":"Sangmyeon","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shy-flf80pma.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-31T00:47:21.000Z","bios":{"en_US":"<p>CJ Entus top lane player Sang-myeon \"Shy\" Park is one of the longest tenured professional League of Legends players in Korea. The 24 year old has been competing at the highest level since 2012 when he joined MiG Frost. Shy was at the forefront of CJ Entus’ golden age as an organization, when both CJ Entus Frost and sister team CJ Entus Blaze made the OGN Champions Finals with regularity. \n</p>\n<p>\nWhile sometimes timid off the Rift, Shy is quick with a smile, and quicker with a carry. Shy will need to lend all of his veteran experience to his teammates if they are going to succeed on the new ROX Tigers roster. But don’t count him out yet. Sometimes it’s the old dogs that have the biggest bite.\n</p>","fr_FR":"<p>Sur la voie du haut, CJ Entus dispose de Sang-myeon « Shy », l'un des vétérans les plus aguerris de la scène professionnelle coréenne. À 24 ans, il joue au plus haut niveau depuis 2012, époque à laquelle il a rejoint MiG Frost. Shy était aux avant-postes pendant l'âge d'or de CJ Entus en tant qu'organisation, c'est-à-dire lorsque les équipes sœurs CJ Entus Frost et CJ Entus Blaze terminaient régulièrement en finale d'OGN Champions. \n</p>\n<p>\nQuoiqu'il soit parfois timide en dehors de la Faille, Shy se rattrape avec un carry. Shy devra apporter toute son expérience de vétéran à ses coéquipiers s'ils entendent reprendre le flambeau de CJ lorsque le groupe était à son sommet. Ne l'oubliez pas trop vite. Le vieux lion a toujours un mot à dire face aux jeunes loups.\n</p>","pl_PL":"<p>Górny gracz CJ Entus, Sang-myeon „Shy” Park jest jednym z najbardziej doświadczonych profesjonalnych graczy w LoLa w Korei. Ten 24-latek grał na najwyższym poziomie od 2012 roku, kiedy dołączył do MiG Frost. Shy był kluczowym elementem złotej ery CJ Entus, kiedy zarówno CJ Entus Frost i siostrzana drużyna, CJ Entus Blaze regularnie docierały do finałów OGN Champions. \n</p>\n<p>\nChociaż niektórzy są nieśmiali poza Rift, Shy jest zawsze skory do uśmiechu i grania prowadzącym. Jeśli jego drużyna chce doprowadzić do kolejnej złotej ery CJ, musi podzielić się z nią całym swoim doświadczeniem. Nie należy go jednak ignorować. Czasem nawet skamieliny potrafią być groźne.\n</p>"},"foreignIds":{"drupalId":"371","ESPORTSTMNT06":"200000373"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":828,"slug":"smurf","name":"Smurf","firstName":"Dmitrii","lastName":"Ivanov","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smurf-30g8uhic.png","hometown":"Kaliningrad (Rússia)","region":"International Wildcard","birthdate":"1994-06-22","createdAt":"2015-08-25T15:37:32.000Z","updatedAt":"2017-07-05T18:23:55.000Z","bios":{"pt_BR":"<p>Dmitrii \"Smurf\" Ivanov é o agressivo jogador do topo da Albus Nox Luna. Mas a agressividade de Smurf não é só para fazer pose. Ele é considerado um dos jogadores mais inteligentes da CEI. Se ele vai para cima, ele geralmente tem um propósito. Porém, talvez seja difícil ver se você está sendo pisoteado por Hecarim ou esmagado contra uma parede por Gnar.</p>\n\n<p>Quando a inteligência de Smurf não é suficiente para sobreviver, seu senso de humor assume a posição. Sua personalidade tem sido de grande utilidade no Rift, seja jogando de meio, suporte ou de topo agora na StarLadder. Talvez Smurf seja o escolhido para trazer Soraka para o topo. Sempre podemos ter esperanças.</p>","en_US":"<p>\nDmitrii \"Smurf\" Ivanov is the all-in, aggressive top laner for Albus Nox Luna, previously known as Hard Random. Smurf's aggression is more than just posturing though. He is widely regarded as one of the smartest players in the CIS -- if he's diving in, he usually has a purpose. Although it might be hard to see if you're being trampled by Hecarim, or smashed into a wall by Gnar.\n</p>\n<p>\nWhen Smurf's wits aren't enough to survive, his sense of humor steps up to the plate. His personality has served him well all across the Rift, playing mid, support, and now top competitively in StarLadder. Maybe Smurf is the chosen one to bring out Soraka top. We can always hope!\n</p>","fr_FR":"<p>\nDmitrii « Smurf » Ivanov est le top laner agressif et bagarreur de Hard Random. Son côté agressif ne se limite pas à sa posture, cela dit. Il est largement considéré comme l'un des joueurs les plus rusés de la CEI : s'il fonce pour attaquer, c'est qu'il a une bonne raison de le faire. Mais c'est peut-être difficile à voir lorsqu'on se fait piétiner par Hecarim ou écraser contre un mur par Gnar.\n</p>\n<p>\nQuand son intelligence ne lui suffit plus pour survivre, son sens de l'humour prend le relais. Sa personnalité lui a été d'un grand secours sur la Faille, où il a joué en tant que mid laner, support et où il occupe désormais le rôle de top laner sur StarLadder. Peut-être Smurf est-il l'élu qui permettra à Soraka de gagner sa place en voie du haut ! Quoi de mieux que les All-Stars de 2015 pour tenter cette nouvelle méta ? \n</p>","pl_PL":"<p>\nDmitrii \"Smurf\" Ivanov gra dla Hard Random i jest typem agresywnego gracza górnej alei, który lubi stawiać wszystko na jedną kartę. Jednakże Smurf nie jest agresywny tylko dla zasady. Powszechnie uważa się go za jednego z najbardziej inteligentnych graczy wywodzących się z WNP. Jeżeli decyduje się na atak w zasięgu wieży to zazwyczaj ma w tym jakiś cel. Chociaż czasem doszukanie się go może być trudne, jeśli akurat jesteście tratowani przez Hecarima albo rzucani po ścianach przez Gnara.\n</p>\n<p>\nA kiedy inteligencja Smurfa to za mało, aby przetrwać, do gry wchodzi jego poczucie humoru. Jego osobowość dobrze mu służyła dookoła całego Riftu. Grał w StarLadderze jako środkowy, wspierający, a ostatnio przebywa w górnej alei. Być może to właśnie Smurf jest wybrańcem, który zagra w górnej alei Soraką. Nie będzie do tego lepszej okazji, niż All-Star 2015. \n</p>","de_DE":"<p>Dmitrii „Smurf“ Ivanov ist der aggressive Top-Laner von Albus NoX Luna, ehemals bekannt als Hard Random, der alles auf eine Karte setzt. Smurfs Angriffsfreudigkeit ist jedoch mehr als bloße Drohgebärde. Er wird weithin als einer der cleversten Spieler im CIS angesehen – wenn er losprescht, führt er meistens etwas im Schilde. Obwohl die meisten das schon nicht mehr mitkriegen, da sie von Hecarim zertrampelt oder von Gnar in die nächste Wand gerammt werden.</p>\n\n<p>Wenn Smurfs Grips zum Überleben nicht mehr ausreicht, kommt sein Sinn für Humor ins Spiel. Seine Persönlichkeit hat ihm überall in der Kluft bereits gute Dienst erwiesen, egal ob auf der mittleren Lane, als Supporter oder jetzt in der StarLadder als konkurrenzfähiger Top-Laner. Vielleicht ist Smurf der Auserwählte, der mit Soraka die obere Lane aufräumt. Die Hoffnung stirbt zuletzt.</p>","es_ES":"<p>\nDmitrii \"Smurf\" Ivanov es el agresivo top de Hard Random. La agresión de Smurf, sin embargo, no es simple postureo. Muchos lo ven como uno de los jugadores más inteligentes de CIS. Siempre hace las cosas con un objetivo en mente. A veces es difícil de ver; por ejemplo, cuando uno es arrollado por Hecarim o empotrado contra una pared por Gnar.\n</p>\n<p>Cuando el buen juicio de Smurf no consigue evitar que lo maten, su sentido del humor toma el relevo. Su personalidad le ha servido de mucho en la Grieta, tanto al jugar mid como apoyo, y ahora top en StarLadder. Puede que Smurf sea el elegido para recuperar a Soraka top. Y no hay mejor ocasión que el evento All-Star 2015. \n</p>"},"foreignIds":{"TRLH1":"1001380073","TRLH2":"1001280043","ESPORTSTMNT04":"200001476"},"socialNetworks":{},"champions":[{"id":139,"playerId":828,"championId":120,"championKey":"Hecarim","championName":"Hecarim","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"},{"id":140,"playerId":828,"championId":105,"championKey":"Fizz","championName":"Fizz","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"},{"id":141,"playerId":828,"championId":68,"championKey":"Rumble","championName":"Rumble","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"}],"liveGameTeam":241},{"id":830,"slug":"kira","name":"Kira","firstName":"Mykhailo","lastName":"Harmash","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kira-6on16dx.png","hometown":"Mariupol (Ucrânia)","region":"International Wildcard","birthdate":"1993-03-07","createdAt":"2015-08-25T15:40:12.000Z","updatedAt":"2016-09-30T01:16:09.000Z","bios":{"pt_BR":"<p>Mykhailo \"Kira\" Harmash é o jogador da virada. Em desvantagem no 1v1? Hora de reagir e virar o jogo. O confronto vai mal? É só um inconveniente, ele ainda pode conseguir o abate. Mas de alguma forma, apesar de seu comportamento maluco na rota, Kira ganhou posições na CEI e se tornou um dos melhores jogadores do meio da Rússia. Ele também levou o primeiro lugar no torneio 1v1 do evento All-Star IWC 2015 na Austrália.</p>\n<p>A velha reputação de Kira como jogador que só sabe jogar com Anivia foi substituída por uma abundância de magos de utilidade e controle. Depois de exercer um papel essencial na trajetória da NoX até o Campeonato Mundial 2016, Kira enfrentará alguns dos melhores jogadores do meio do cenário profissional de League of Legends. Vamos ver que tipo de situações suas façanhas irão gerar na rota.</p>\n","en_US":"<p>\nMykhailo \"Kira\" Harmash will always go for the outplay. Behind in a 1v1? Time to bait them in and go for the turnaround! In a terrible matchup? A mere inconvenience, he can still get the kill. But somehow, despite his crazy laning behavior, Kira has climbed the ranks of the CIS and become one of the best mid laners in Russia. He also claimed 1st place in the 1v1 tournament at the 2015 IWC All-Star Event in Australia.\n</p>\n<p>\nKira's old reputation as a one-trick-bird with Anivia has been replaced by a plethora of control and utility mages. After playing a key role in NOX's road to the 2016 World Championship, Kira will be matched up against some of the best mid laners playing professional League of Legends. Let's see what kind of trouble his mid lane shenanigans create.\t\n</p>","fr_FR":"<p>\nMykhailo « Kira » Harmash cherche toujours à déjouer le destin et à retourner la situation. Désavantagé dans un 1c1 ? Il attire ses ennemis et change le cours du match. Handicapé par un matchup défavorable ? Ce n'est qu'un détail, il peut quand même tuer son opposant. Mais d'une certaine manière, malgré son attitude déjantée en phase de laning, Kira a su monter en grade dans sa région et devenir l'un des meilleurs mid laners de Russie. Il a également fini en première place lors du tournoi en 1c1 de l'événement All-Stars IWC 2015 en Australie. Autrefois connu pour être le joueur d'un seul champion (Anivia), il est désormais capable de jouer une kyrielle de mages de soutien ou possédant du contrôle de foule. Kira va devoir affronter certains des meilleurs mid laners au monde lors de l'événement All-Stars 2015. Attendons de voir quel genre de situation ses manigances vont créer en voie du milieu.\n</p>","pl_PL":"<p>\nMykhailo \"Kira\" Harmash zawsze stara się ograć swoich rywali. Przegrywa pojedynek 1 na 1? Najpewniej spróbuje podpuścić przeciwnika i odwrócić losy starcia. Gra w alei przeciwko trudnemu dla siebie bohaterowi? Przecież to tylko drobna niedogodność i wciąż jest w stanie zdobyć na nim zabójstwo. Kira, pomimo swej zwariowanej gry w alei, w jakiś sobie tylko znany sposób stał się jednym z najlepszych środkowych w WNP. Co więcej, zajął 1 miejsce w turnieju 1-na-1 podczas IWC All-Star 2015 w Australii. Dawniej znany był przede wszystkim z gry Anivią, lecz teraz potrafi grać całym multum kontrolujących i wspierających magów. Podczas All-Star 2015 będzie musiał stawić czoła najlepszym środkowym na świecie. Przekonajmy się, czy będzie w stanie im zagrozić.\n</p>","de_DE":"<p>Mykhailo „Kira“ Harmashs große Stärke ist das Ausspielen. Liegt er in einer 1-gegen-1-Situation hinten, lockt er seinen Gegenüber in die Falle und dreht den Spieß um. Steckt er in einer unvorteilhaften Paarung fest, ist das nicht mehr als eine Unannehmlichkeit. Er kann sich die Tötung trotzdem holen. Trotz seiner verrückten Art auf der Lane hat Kira es geschafft, die Ränge des CIS nach oben zu klettern und einer der besten Mid-Laner in Russland zu werden. Außerdem hat er sich beim IWC All-Stars-Event 2015 in Australien im 1-gegen-1-Turnier den 1. Platz geholt.\nFrüher hatte Kira den Ruf, nur mit Anivia Großes vollbringen zu können, doch mittlerweile spielt er eine ganze Mannschaft an (unterstützenden) Magiern mit Massenkontrolle wie ein Profi. Kira spielte eine Schlüsselrolle auf NoX’ Weg zur Weltmeisterschaft 2016 und wird dort auf die besten Mid-Laner in League of Legends treffen. Wir sind schon gespannt, was seine Tricksereien auf der mittleren Lane für Unfug stiften werden.</p>","es_ES":"<p>Mykhailo \"Kira\" Harmash siempre buscará la jugada destacada. ¿Que va detrás en el duelo? Dadle tiempo para que engañe a sus rivales y le dé la vuelta a la jugada. ¿Que el enfrentamiento es desfavorable? Minucias, sigue pudiendo conseguir el asesinato. Pero, de alguna manera, a pesar de su alocado comportamiento en la calle, Kira ha escalado la clasificación de la CIS y se ha convertido en uno de los mejores jugadores de la calle central de Rusia. También se hizo con el primer puesto en el torneo 1v1 del IWC All-Star Event 2015 en Australia.</p>\n\n<p>La reputación de Kira como ornitólogo con Anivia ha sido sustituida por una plétora de magos de control y utilidad. Después de jugar un papel clave en el camino de NOX hacia el Campeonato Mundial 2016, Kira se enfrentará contra algunos de los mejores jugadores de la calle central en el mundo profesional de League of Legends. Ya veremos qué tipo de problemas causan sus diabluras por la calle central.</p>"},"foreignIds":{"TRLH1":"1001380075","TRLH2":"1001280045"},"socialNetworks":{"twitch":"http://www.twitch.tv/kirrrrra"},"champions":[],"liveGameTeam":241},{"id":1044,"slug":"lindarang","name":"Lindarang","firstName":"Manheung","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lindarang-8tddakt4.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:16:03.000Z","updatedAt":"2017-05-31T00:51:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000374"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1045,"slug":"seonghwan","name":"SeongHwan","firstName":"Seonghwan","lastName":"Yun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seonghwan-g8jv42cj.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:14:35.000Z","updatedAt":"2017-05-31T00:52:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000440"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1218,"slug":"pvpstejos","name":"PvPStejos","firstName":"Oleksandr","lastName":"Glazkov","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pvpstejos-9j29ioil.png","hometown":"Zaporizhia","region":"International Wildcard","birthdate":"1996-12-24","createdAt":"2016-04-15T05:33:05.000Z","updatedAt":"2016-09-30T01:20:28.000Z","bios":{"en_US":"<p>Oleksandr “PvPStejos” Glazkov serves as one of the primary shotcallers on Albus NoX Luna. His work speaks for itself, leading NOX to first place in multiple LCL Finals and then all the way to the 2016 World Championship via the International Wildcard Qualifiers in Brazil. PvPStejos' success, and that of his team in general, have earned them a slew of fans in the CIS. Now he has to prove to his fans that NOX has what it takes to survive against the best League teams in the world.</p>","de_DE":"<p>Aleksander „PvPStejos“ Glazkov ist einer der Hauptansager von Albus NoX Luna. Seine Arbeit spricht für sich: Er führte NoX zu mehreren Titeln in der LCL und über das „International Wildcard“-Qualifikationsturnier in Brasilien zur Weltmeisterschaft 2016. Die Erfolge von PvPStejos und seiner Mannschaft haben ihm in der CIS viele Fans eingebracht. Jetzt muss er seinen Fans beweisen, dass NoX das Zeug dazu hat, gegen die weltbesten Mannschaften in League zu bestehen.</p>","es_AR":"<p>Aleksander \"PvPStejos\" Glazkov es uno de los principales líderes en Albus NoX Luna. Su trabajo habla por sí mismo, llevó a NOX al primer puesto en múltiples Finales de la LCL y luego al Campeonato Mundial 2016 a través de las Clasificatorias Internacionales Wildcard en Brasil. El éxito de PvPStejos y el de su equipo en general generó un grupo de simpatizantes en la CIS. Ahora deberá probarle a sus simpatizantes que NOX tiene lo que se necesita para sobrevivir en contra de los mejores equipos de League en el mundo.</p>","es_ES":"<p>Dmitri \"Smurf\" Ivanov es el agresivo jugador de la calle superior que va a por todas para Albus NoX Luna, anteriormente conocidos como Hard Random. La agresividad de Smurf es más que una pose. Es conocido como uno de los jugadores más inteligentes de la región CIS; cada vez que realiza un ataque es porque tiene un objetivo. Aunque quizá os cueste verlo si estáis siendo aplastados por Hecarim o espachurrados contra un muro por Gnar.</p>\n\n<p>Cuando los ardides de Smurf no son suficientes para sobrevivir, aparece en escena su sentido del humor. Su personalidad le ha venido bien por toda la Grieta, ya que ha jugado, de manera competitiva, en la calle central, como apoyo y ahora en la calle superior en la StarLadder. Quizá Smurf sea el elegido para sacar a pasear a Soraka en la calle superior. No perdamos la esperanza.</p>","pt_BR":"Aleksander “PvPStejos” Glazkov é um dos principais armadores da Albus NoX Luna. Seu trabalho fala por si só e já levou a NOX a vários primeiros lugares em várias finais da LCL e depois até o Campeonato Mundial 2016 por meio do Desafio Internacional no Brasil. O sucesso de PvPStejos e da equipe como um todo lhes rendeu inúmeros fãs na CEI. Agora ele tem que provar para os fãs que a NOX tem o que é preciso para sobreviver entre as melhores equipes de League do mundo."},"foreignIds":{"TRLH2":"1001280044","TRLH1":"1001380074"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":1231,"slug":"key","name":"Key","firstName":"Hangi","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/key-9cxe5iyu.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-04-28T19:01:05.000Z","updatedAt":"2017-05-31T00:53:08.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000959"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1270,"slug":"mightybear","name":"Mightybear","firstName":"Min-soo","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mightybear-dx94b7va.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:33:03.000Z","updatedAt":"2017-05-31T00:46:49.000Z","bios":{"en_US":"<p>\nMin-soo “Mightybear” Kim launched his professional career in late 2014 while playing for team Positive Energy in China. He then moved on to powerhouse Chinese esports organization Newbee (best known for their Dota 2 teams), where he stayed until early 2016. \n</p>\n<p>\nIn mid-2016 Mightybear decided to make the move to Europe in order to play with Team Vitality. After a brief stay, he made his way to Korea for 2017.\n</p>","de_DE":"<p>Min-Soo „Mightybear“ Kim ist praktisch der Neue in der Klasse. Er fing mit der Schule direkt im Ausland an, wo er sich allerdings nicht wohl fühlte, weil er nie zu Wort kam. Der Suchdrang nach einem neuen Zuhause wuchs schnell und Worten folgten die Taten. </p>\n\n<p>Im Klartext heißt dies, dass der koreanische Amateur, der vorher unter „Moon“ und „PandaBears“ bekannt war, sein professionelles Debüt in der Zweitliga Chinas, der LSPL, feierte. Bei Positive Energy konnte er kein Spiel für seine erste Mannschaft absolvieren, doch gab es für ihn einen Hauch an Hoffnung, als Newbee (heute in der LPL) den Club aufkaufte. Tatsächlich kam er im Demacia Cup 2015 Summer gegen Team WE Future und während der LPL 2016 Spring Promotion zum Einsatz. Allerdings konnte er mit den einhergehenden sechs Niederlagen (beide 0:3-Spielstände) bisher noch nichts unter Beweis stellen und hofft wieder einmal von seinen Fans und Kollegen respektiert geachtet zu werden. </p>\n\n<p>Mit Vitality könnte dies sein Durchbruch sein, eine Mannschaft aus alten Veteranen und hungrigen Amateuren. Die Mischung hat sich in League of Legends stets als Formel für Erfolg bestätigt und mit dem frisch entzündetem Feuer in Mightybear, könnte er vielleicht der neue Kang-Yun „Trick“ Kim der EU LCS sein.\n</p>","fr_FR":"<p>La vague de jeunes junglers talentueux venus de Corée du Sud ne s’arrête pas ! Après Cho « H0R0 » Jae-hwan chez Millenium, Kim « Reignover » Yeu-jin puis Lee « Spirit » Da-yoon chez Fnatic et Kim « Trick » Gang-yun chez G2 Esports, voici que Kim « Mightybear » Min-su débarque à son tour sur le Vieux Continent. Sa destination n’est autre que la structure française Team Vitality. </p>\n\n<p>Mightybear a fait ses premiers pas en Chine, notamment dans l’équipe Newbee, qui évoluait en LSPL, la deuxième division chinoise. En 2016, il n’a disputé aucun match compétitif car il était le remplaçant de Baek « Swift » Da-hoon. </p>\n\n<p>Son intégration au sein de sa nouvelle équipe a été facilitée par sa maîtrise déjà très bonne de l’anglais, ce qui a facilité le choix de Vitality. Sa vision de jeu et son agressivité devraient permettre à Vitality de trouver un second souffle. Sa mission reste périlleuse car il doit faire oublier Ilyas « Shook » Hartsema en se montrant plus régulier et en montrant plus d’initiative. </p>","pl_PL":"<p>Min-su „Mightybear” Kim, pomimo koreańskiego pochodzenia, karierę profesjonalnego gracza rozpoczął w Chinach. W grudniu 2014 roku dołączył do pierwszej esportowej organizacji w Krainie Smoków – do Positive Energy. W szeregach chińskiego zespołu udało mu się wziąć udział w wielu pomniejszych turniejach, a nawet zagrać przeciwko krajowym potęgom, takim jak LGD Gaming czy Team WE. Do swoich sukcesów z tego okresu może zaliczyć utrzymanie się w drugorzędnej lidze w Chinach. Jednak już w maju 2015 roku grał pod nową banderą, gdyż został wykupiony z całym zespołem przez inną organizację. Dołączył do drużyny Newbee, gdzie miał największe osiągnięcia podczas pobytu w Chinach. Wraz z zespołem miał okazję zawalczyć w kwalifikacjach do najbardziej prestiżowej ligi w Państwie Środka, czyli LPL. Jednak na jego drodze kolejny raz stanął zespół WE, przeciwko któremu nie pomogły nadzwyczajne umiejętności Min-su w grze Gragasem. </p>\n<p>W maju 2016 roku został zapytany przez swojego agenta czy chciałby profesjonalnie grać w Europie. Odpowiedź Min-su była zdecydowanie pozytywna. Już wtedy potrafił mówić po angielsku, więc nie widział żadnych przeszkód w dołączeniu do Team Vitality. „Mightybear” od początku zaskakiwał swoim pogodnym usposobieniem. W wywiadzie przed letnim splitem EU LCS 2016 stwierdził, że nie odczuwa presji i jest bardzo optymistycznie nastawiony do gry w Europie. Po przyjeździe na nowy kontynent był zachwycony wyglądem miast i stylem życia Europejczyków. Jak tylko stał się członkiem Team Vitality, to założył konta na portalach społecznościowych. Od razu rozpoczął bardzo aktywne życie na tych stronach, przepełnione elementami humorystycznymi związanymi z jego pseudonimem „Mightybear”.</p>\n<p>W piątym sezonie zauważalnie gustował w niezwykle twardych dżunglerach, chociaż za swoich ulubionych bohaterów uważa Nidalee i Gravesa. Najlepiej sobie radził Gragasem i Rek’sai, lecz zdarzało się również, że wybierał bohaterów innego typu, jak na przykład ukochaną Nidalee. Od maja 2016 roku, czyli przeprowadzki do Europy, coraz częściej można było zobaczyć go w akcji Gravesem i Kindred. Jego największym osobistym osiągnięciem było wejście do Kręgu Pretendenta w Korei, który to wyczyn udało mu się powtórzyć na serwerze EU West w czasie krótszym niż miesiąc. Imponującym osiągnięciem oczywiście pochwalił się na portalach społecznościowych.</p>\n\n"},"foreignIds":{"TRLH3":"1001310014","TRLH4":"1001270014","TRLH2":"1001250062","FRA1TMNT2":"45034","ESPORTSTMNT06":"200001028"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1411,"slug":"amiracle","name":"aMiracle","firstName":"Vladyslav","lastName":"Shcherbyna","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amiracle-gzemlug7.png","hometown":"Nikopol","region":"International Wildcard","birthdate":"1993-09-01","createdAt":"2016-08-22T13:47:28.000Z","updatedAt":"2016-10-11T14:44:57.000Z","bios":{"en_US":"<p>\nVladyslav “aMiracle” Scherbyna joined Albus NoX Luna (then Hard Random) in late 2015, just in time to to wreck the LCL. aMiracle and NOX claimed back-to-back 1st place finishes in the LCL, as well as taking 2nd at the 2016 IWCI. Building on his domestic success, aMiracle went into the 2016 IWCQ with something to prove -- and came away with a ticket to the 2016 World Championship.\n</p>\n<p>\nHis Jhin and Ashe play ripped through the competition in Brazil, with multiple perfect games (AKA a slew of kills and zero deaths). aMiracle is turning into one of the strongest AD carries in the wildcard regions. Now he has a chance to see how his chops match up against the best AD carries in the world.\n</p>","de_DE":"<p>Vladislav „aMiracle“ Scherbyna wechselte Ende 2015 zu Albus NoX Luna (damals noch Hard Random) und kam noch rechtzeitig, um in der LCL aufzuräumen. aMiracle und NoX gewannen zweimal hintereinander den Titel in der LCL und belegten beim IWCI 2016 den zweiten Platz. Durch seinen regionalen Erfolg hatte aMiracle beim IWCQ 2016 etwas zu beweisen – und konnte sich das Ticket zur Weltmeisterschaft 2016 sichern.</p>\n\n<p>aMiracle hat mit Jhin und Ashe die Konkurrenz in Brasilien vernichtet und wird aufgrund seiner perfekten Spiele (jede Menge Tötungen und keine Tode) zu einem der besten AD-Carrys in den „Wildcard“-Regionen. Jetzt hat er die Chance, herauszufinden, ob er es mit den besten AD-Carrys der Welt aufnehmen kann.</p>","es_AR":"<p>Vladislav \"aMiracle\" Scherbyna se unió a Albus NoX Luna (luego, Hard Random) a finales del 2015, justo a tiempo para destrozar la LCL. aMiracle y NOX reclamaron de vuelta el 1er puesto en las finales de la LCL, así como el 2do puesto en los IWCI 2016. Para construir su éxito nacional, aMiracle fue a los IWCQ 2016 para demostrar algo... y consiguió un boleto para el Campeonato Mundial 2016.</p>\n\n<p>Su juego con Jhin y Ashe destrozó a la competencia en Brasil, con múltiples juegos perfectos (con muchos asesinatos y cero muertes). aMiracle se está convirtiendo en uno de los acarreadores de AD más poderosos en las regiones de comodines. Ahora tiene la oportunidad de medirse contra los mejores acarreadores de AD del mundo.</p>","es_ES":"<p>Vladislav \"aMiracle\" Scherbyna se unió a Albus Nox Luna (por entonces Hard Random) a finales de 2015, justo a tiempo para arrasar la LCL. aMiracle y NOX se hicieron con el primer puesto en la LCL dos veces seguidas, además de un segundo puesto en el IWCI 2016. Con el apoyo del éxito en terreno doméstico, aMiracle llegó al IWCQ 2016 con algo que demostrar... y se marchó con un billete al Campeonato Mundial 2016.</p>\n\n<p>Su Jhin y su Ashe arrasaron a lo largo de la competición en Brasil con varias partidas perfectas (es decir, muchos asesinatos, pero ninguna muerte). aMiracle se está convirtiendo en uno de los AD carry más fuertes de las regiones wildcard. Ahora tiene la oportunidad de comprobar cómo se desenvuelve con su talento contra los mejores AD carry del mundo.</p>","pt_BR":"<p>Vladislav “aMiracle” Scherbyna entrou na Albus NoX Luna (na época da Hard Random) no final de 2015, a tempo de arrasar na LCL. aMiracle e a NOX ganharam todas as etapas da LCL, além do segundo lugar no IWCI 2016. Com todo esse sucesso regional, aMiracle foi para o IWCQ 2016 com algo para provar e saiu de lá com o passaporte carimbado para o Campeonato Mundial 2016.</p>\n\n<p>Jogando com Jhin e Ashe, ele destruiu os rivais no Brasil com vários jogos impecáveis (ou seja, montes de abates e nenhuma morte). aMiracle está se tornando um dos atiradores mais fortes das regiões desafiantes. Agora ele terá uma oportunidade de ver se seus disparos se comparam aos dos melhores atiradores do mundo.</p>","pl_PL":"<p>Vladislav „aMiracle” Scherbyna dołączył do Albus NoX Luna (wówczas Hard Random) pod koniec 2015 roku, w samą porę, by podbić LCL. aMiracle i NOX zdobywali raz po raz pierwsze miejsca w LCL, a ponadto zajęli 2 miejsce na IWCI 2016. Zachęcony sukcesem w macierzystym regionie, aMiracle wyruszył na IWCQ 2016, chcąc dowieść swojej wartości — i wrócił z biletem na Mistrzostwa Świata 2016.</p>\n\t\n<p>Jego gra Jhinem i Ashe zdominowała rywalizację w Brazylii, gdzie rozegrał kilka perfekcyjnych gier (wiele zabójstw i zero śmierci). aMiracle okazał się jednym z najsilniejszych prowadzących z regionów dzikich kart. Teraz ma szansę przekonać się, czy jego umiejętności dorównują najlepszym prowadzącym na świecie.</p>\n"},"foreignIds":{"TRLH1":"1001380076","TRLH2":"1001280046"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":1413,"slug":"unho1y","name":"Unho1y","firstName":"Oleksandr","lastName":"Sevostianov","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/unho1y-8fxf4nw6.png","hometown":"Odessa","region":"International Wildcard","birthdate":"1994-09-24","createdAt":"2016-08-22T13:51:24.000Z","updatedAt":"2017-07-05T18:10:50.000Z","bios":{"en_US":"","es_AR":"<p>Oleksandr \"Unho1y\" Sevostianov es el tirador suplente de Albus NoX Luna.</p>"},"foreignIds":{"TRLH1":"1001380079","TRLH2":"1001280049","ESPORTSTMNT04":"200001611"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":2049,"slug":"lava","name":"Lava","firstName":"Taehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:26:19.000Z","updatedAt":"2017-07-01T23:40:36.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001525"},"socialNetworks":{},"champions":[],"liveGameTeam":108}],"scheduleItems":[{"id":"AVcfjjkVoUG4HPFjOKCr","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:f1ab850f-1cce-4274-88f2-8a6e18e2a405","scheduledTime":"2016-09-30T00:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"1","subBlockLabel":"Sub Block 9","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:3eeecb03-0a62-4589-9281-481ded97424f"},"match":"f1ab850f-1cce-4274-88f2-8a6e18e2a405","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"3eeecb03-0a62-4589-9281-481ded97424f","league":"9"}],"gameIdMappings":[{"id":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","gameHash":"d03334235290f31a"}],"videos":[{"id":4476,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","source":"https://www.youtube.com/embed/_ReWEe4uMDU?wmode=transparent","createdAt":"2016-09-30T02:55:16.000Z","updatedAt":"2016-09-30T02:55:16.000Z","game":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b"},{"id":4486,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","source":"https://www.youtube.com/watch?v=rgaa-wCkj_k&wmode=transparent","createdAt":"2016-09-30T13:13:22.000Z","updatedAt":"2016-09-30T13:13:22.000Z","game":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b"},{"id":4496,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","source":"https://www.youtube.com/embed/IM5DLkSzBrk","createdAt":"2016-09-30T14:19:47.000Z","updatedAt":"2016-09-30T14:19:47.000Z","game":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b"},{"id":4498,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","source":"https://www.youtube.com/embed/GmxbS3l10sY","createdAt":"2016-09-30T22:06:54.000Z","updatedAt":"2016-09-30T22:06:54.000Z","game":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b"}],"htmlBlocks":[],"match":{"id":"f1ab850f-1cce-4274-88f2-8a6e18e2a405","name":"ROX-vs-ANX","position":0,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"},{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}],"games":{"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b":{"id":"797e43ae-6a72-4cfe-9b02-cbb2a04e2e1b","name":"G1","generatedName":"ANX|ROX|G1|f1ab850f1cce427488f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"},{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}],"standings":{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475273223603,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475245140099,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475243507086,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475241155861,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475204069849,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475198623453,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475198236924,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001890163","gameRealm":"TRLH1","platformId":"TRLH1:1001890163","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475273223604,"source":"bestOf","history":[{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475245140099,"source":"bestOf","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475243507087,"source":"bestOf","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475241155861,"source":"bestOf","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475204069850,"source":"bestOf","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475198623455,"source":"bestOf","closed":true},{"result":[[{"roster":"5e3d4b36-361c-40fa-8687-17f23bc053ac"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475198236925,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7a1e518f-38cc-41be-8a3b-dcea1a3beb79":0,"5e3d4b36-361c-40fa-8687-17f23bc053ac":1}}}