{"teams":[{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84}],"scheduleItems":[{"id":"AVRUIAL9oUG4HPFjOJ8i","content":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:match:f67d5296-cf95-4978-9f4c-e539923e0c7a","scheduledTime":"2016-05-07T09:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb","blockLabel":"4","subBlockLabel":"Live Broadcast","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:bracket:3d469dc6-3409-4b0c-a4d4-201b1aa99a7a"},"match":"f67d5296-cf95-4978-9f4c-e539923e0c7a","tournament":"69298c0c-16ae-490a-8e9c-cfe4620a6bfb","bracket":"3d469dc6-3409-4b0c-a4d4-201b1aa99a7a","league":"10"}],"gameIdMappings":[{"id":"c60a3f0b-459a-4478-8ef9-ef75b22d20d3","gameHash":"ded0b72947b56b70"}],"videos":[{"id":2714,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c60a3f0b-459a-4478-8ef9-ef75b22d20d3","source":"https://www.youtube.com/embed/MjzSVODWAAg","createdAt":"2016-05-07T12:51:57.000Z","updatedAt":"2016-05-07T12:51:57.000Z","game":"c60a3f0b-459a-4478-8ef9-ef75b22d20d3"},{"id":2720,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c60a3f0b-459a-4478-8ef9-ef75b22d20d3","source":"https://www.youtube.com/embed/kQkPHEGE5RE?wmode=transparent","createdAt":"2016-05-07T15:24:43.000Z","updatedAt":"2016-05-07T15:24:43.000Z","game":"c60a3f0b-459a-4478-8ef9-ef75b22d20d3"},{"id":2742,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c60a3f0b-459a-4478-8ef9-ef75b22d20d3","source":"https://www.youtube.com/watch?v=FS2GBenel4s","createdAt":"2016-05-09T21:27:54.000Z","updatedAt":"2016-05-09T21:27:54.000Z","game":"c60a3f0b-459a-4478-8ef9-ef75b22d20d3"}],"htmlBlocks":[],"match":{"id":"f67d5296-cf95-4978-9f4c-e539923e0c7a","name":"CLG-vs-RNG","position":13,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"},{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],"games":{"c60a3f0b-459a-4478-8ef9-ef75b22d20d3":{"id":"c60a3f0b-459a-4478-8ef9-ef75b22d20d3","name":"G1","generatedName":"CLG|RNG|G1|f67d5296cf9549789f4","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"},{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}]],"timestamp":1462620903231,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"60329","gameRealm":"TRLT3","platformId":"TRLT3:60329","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}]],"timestamp":1462620903231,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a81e5111-764c-40ea-8120-e690ba6289a5":0,"da4ffa8f-2beb-46e8-9a20-6c962685435c":1}}}