{"teams":[{"id":15,"slug":"fnatic","name":"Fnatic","guid":"be6c86ea-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bjbf9nf7.jpg","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-i09wrkpf.png","acronym":"FNC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bkk3xam5.png","createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-07-27T00:51:46.000Z","bios":{"en_US":"<p>As the original League of Legends World Champion, Fnatic was the team to beat in LoL’s infancy. These days, the squad is completely unrecognizable from its original form. With a new roster mixing veteran playmakers like sOAZ and Rekkles plus Caps, their lone rookie, Fnatic is remaking itself. Putting their underwhelming 2016 behind them, Fnatic believe they are building a roster that could make a serious run at the EU LCS trophy.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>\n","fr_FR":"<p>Première détentrice du titre mondial de League of Legends, Fnatic était l'équipe à battre dans la prime enfance de LoL. Mais l'équipe d'aujourd'hui n'a plus rien à voir avec sa forme d'origine. Sa nouvelle formation accueillant à présent des talents coréens, des joueurs européens prometteurs et Rekkles, la star carry AD, Fnatic est en pleine reconstruction. Avec une série de 18 victoires sans défaite durant le segment d'été des LCS EU 2015 et une qualification pour les demi-finales du mondial 2015, l'équipe a prouvé qu'elle pouvait encore obtenir des résultats.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>","pl_PL":"<p>Legendarni obrońcy honoru Europy. Fnatic to jedna z najstarszych drużyn konkurujących w League of Legends. 14 marca 2011 roku ta organizacja, dobrze znana z udziału w innych grach, zaistniała w świecie Runeterry. Świeżo po założeniu, od razu zabrała się za największy kaliber osiągnięć. Żółto-czarni byli jedną z 8 ekip, które zakwalifikowały się do Mistrzostw Riot Games pierwszego sezonu. Dokonali tego zaledwie trzy miesiące po założeniu drużyny, co jak na początkujących, stanowiło imponujący wyczyn. Przez cały turniej przegrali tylko dwa mecze na swojej drodze do zwycięstwa. Dzięki temu osiągnięciu Europa zawdzięcza im swój jedyny dotąd mistrzowski tytuł, a codzienni gracze mogą cieszyć się skinami europejskiego zespołu. Ten historyczny triumf to był dopiero początek wielkich sukcesów tej drużyny.</p>\n\n<p>Doskonałą kondycją Fnatic mógł się pochwalić również w trzecim, czwartym i piątym sezonie, podczas których reprezentował Europę na Mistrzostwach Świata. W 2014 roku nie udało im się wejść do fazy eliminacji, lecz w pozostałych latach pokazali prawdziwą klasę. Podczas MŚ w Stanach Zjednoczonych, w 2013 roku, wyszli ze swojej grupy na pierwszym miejscu, z zawrotnym wynikiem 7:1. W ćwierćfinałach podołali ówcześnie najmocniejszej drużynie Ameryki, Cloud9, na ich własnym terenie. Ulegli dopiero w półfinale z Royal Club, lecz nawet wtedy czarno-żółtym udało się zatriumfować w jednej grze przed ostateczną porażką. Podobnym powodzeniem Fnatic mógł się pochwalić podczas MŚ 2015. Kolejny raz zdominowali fazę grupową, jeszcze raz znajdując się na pierwszym miejscu, tym razem z wynikiem 4:2. W ćwierćfinale stoczyli walkę z pierwszorzędnym chińskim zespołem – Edward Gaming. Warto zauważyć, że był to jeden ze zdecydowanych faworytów tego wydarzenia. Zdominowali ich 3 do 0, nie pozostawiając cienia złudzeń co do tego, kto zasłużył na laur. Odpadli dopiero w półfinale w starciu z koreańską potęga. Patrząc na dorobek Fnatic z Mistrzostw Świata, śmiało można stwierdzić, że mało która organizacja na świecie może pochwalić się tak niezmiennie dobrymi wynikami.\n</p>\n<p>\nO osiągnięciach tej drużyny na pomniejszych turniejach można by napisać książkę. Jednak trzeba zwrócić uwagę na bezsprzecznie niepowtarzalne triumfy zespołu Fnatic. To przede wszystkim stała i niezachwiana dominacja w lidze EU LCS. Ekipa czarno-żółtych zawsze była na pierwszym lub drugim miejscu w rozgrywkach League Championship Series. Niezłomność i permanentna obecność Fnatic na szczycie zasługuje na najwyższe uznanie. Oprócz członkostwa graczy najwyższych lotów, ten sukces wynika także z zapewnionego im troskliwego patronatu przez samą organizację. Na początku piątego sezonu do kadry dołączył Luis „Deilor” Sevilla, który wcześniej był profesjonalnym trenerem pokera. Wiele osób uważa, że w dużej mierze to właśnie on stoi za sukcesem czarno-żółtych na MŚ 2015. Pod jego opiekuńczymi skrzydłami Fnatic rozkwitło. W wiosennym sezonie EU LCS 2015 skończyli z wynikiem 13:5, a w letnim pobili światowy rekord i pozostali niepokonani aż do końca.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Responsable d’équipe: Finlay \"Quaye\" Stewart</p>","de_DE":"<p>Als LoL noch in den Kinderschuhen steckte, war Fnatic, der erste Weltmeister in der Geschichte von League of Legends, die Mannschaft, die es zu schlagen galt. Die heutige Mannschaft hat mit der damaligen nichts mehr gemein. Mit einer Mischung aus erfahrenen Spielern wie sOAZ und Rekkles sowie dem Nachwuchsspieler Caps versucht Fnatic, sich neu zu erfinden. Fnatic hat die Rückschläge des vergangenen Jahrs hinter sich gelassen und glaubt, mit der neuen Aufstellung Chancen auf den Titel in der EU LCS zu haben. Die Spieler sind entschlossen und haben das Zeug dazu, als beste Mannschaft in die langjährige Geschichte Fnatics einzugehen.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Mannschaftsleiter: Finlay \"Quaye\" Stewart</p>\n","es_ES":"<p>Hablar sobre Fnatic es hacerlo sobre éxito, dedicación y superación. El conjunto europeo más laureado de la escena tendrá otro año más que empezar de cero y saber renovarse para intentar emular los resultados del año pasado. Algo que se plantea casi imposible por su inmaculada temporada se tendrá que realizar con nuevos jugadores que a pesar de no ser tan desconocidos como los que comenzaron el año pasado presentan mayores dudas.</p>\n\n<p>El palmarés de Fnatic es impresionante. Desde ganar el primer Campeonato Mundial de League of Legends hasta sólo perder una vez los playoffs de la LCS europea en verano de 2014 contra Alliance. La única mancha de la organización es la no presencia en el Campeonato Mundial 2012, así cómo podría considerarse un pequeño bache no pasar de la fase de grupos en el Campeonato Mundial de 2014. Pero, en el resto de ocasiones, la actuación ha sido espectacular.</p>\n\n<p>Hasta el año pasado, Fnatic mantuvo un núcleo que siempre otorgaba las mismas impresiones. Durante la fase regular, probaban cambios y los resultados les dejaron un poquito al margen, pero lo suficiente como para clasificarse y luego arrasar en los playoffs. Un equipo calculador que en todo momento ha sabido aprovechar sus recursos para poder superar las expectativas de los aficionados.</p>\n\n<p>El año pasado la renovación no sólo fue fructífera, sino inesperada. Los chicos de Luis ‘Deilor’ Sevilla fueron capaces de ganar en primavera después de una fase regular con sensaciones encontradas. La actuación en el Mid Season Invitational motivó a pensar que Fnatic podía plantar cara a los mejores equipos del mundo. Verano no dio lugar a dudas, puesto que ganaron todos los partidos disputados en la fase regular y estuvieron a punto de hacerlo también en los playoffs si no fuera porque Origen les plantó cara en la final y les pudo sacar dos partidos. Pero no fue suficiente, y Fnatic de nuevo se llevó el preciado trofeo.</p>\n\n<p>Muchos críticos tenían curiosidad por ver si este, probablemente el mejor equipo europeo desde Moscow 5, conseguiría plantar cara a equipos internacionales. Y a pesar de un mal inicio en la fase de grupos, remontaron con un gran nivel y se clasificaron a cuartos de final. Allí derrotaron a la potencia china con una facilidad pasmosa, pero los coreanos juegan en otra división y KOO Tigers acabó con sus esperanzas en las semifinales.</p>\n\n<p>Después de los mundiales tanto su top, Heo ‘Huni’ Seung-hoon, como su mid, Kim ‘Reignover’ Yeu-jin, anunciaron su intención de marcharse a américa en busca de un reto nuevo. Pero la esencia real se perdía con la marcha de Bora ‘YellOwStaR’ Kim, líder del grupo que también decidió irse con el mismo objetivo. El equipo quedó huérfano después de casi tres años enteros del francés con la organización.</p>\n\n<p>Hay que mirar hacia adelante. Al igual que el año pasado las exigencias sólo eran de clasificarse al mundial y al final el buen trabajo recompensó, esta temporada hay que ser lo suficientemente humildes para poder aspirar a gestas heroicas. El equipo ha demostrado que es capaz de sacar provecho de plantillas como la actual, pero todavía es muy pronto para saber cómo funcionarán internamente y sólo queda disfrutar del progreso del conjunto.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Jefe de equipo: Finlay \"Quaye\" Stewart</p>","pt_BR":"O primeiro campeão mundial da história de League era o time a ser batido nos primeiros anos do cenário competitivo. Hoje, porém, a escalação é totalmente diferente daquela formação original. A nova Fnatic combina talentos coreanos com promessas do cenário europeu e uma base sólida com o suporte YellOwStaR. Eles podem estar se reconstruindo ainda, mas os resultados já são inquestionáveis: recorde de 18V-0D na etapa de verão da LCS EU, e primeiro lugar nas eliminatórias.  ","en_GB":""},"foreignIds":{"drupalId":"68"},"players":[94,98,172,344,1107,1111,1264],"starters":[94,98,172,1107,1111],"subs":[344,1264]},{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]}],"players":[{"id":94,"slug":"soaz","name":"sOAZ","firstName":"Paul","lastName":"Boyer","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/soaz-a3dmvmfk.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:38.000Z","updatedAt":"2017-06-09T10:03:16.000Z","bios":{"en_US":"<p>Paul \"sOAZ\" Boyer is a true esports veteran, with a career going back to 2010. Before signing with Origen he had been a rock in the top lane for Fnatic for over two years, joining the squad in two World Championship runs. After the 2014 Season concluded, Fnatic entered a rebuilding process which saw nearly the entire roster head their separate ways. Following his departure from Fnatic, Origen founder and mid laner Enrique \"xPeke\" Cedeño Martínez courted sOAZ to be the final addition to his new Challenger Series venture. sOAZ jumped at the chance, where he was instrumental in Origen's runs through the Challenger circuit, multiple EU LCS Splits, and even a World Championship appearance.</p>\n\n<p>sOAZ decided to return to Fnatic in 2017 as their starting top laner, after another frustrating split for Origen led to many players searching for greener pastures. He brings tons of experience (and his trusty baguette) back to Fnatic where he’s aiming to add to his long list of professional accolades. sOAZ would tell you that he’s got plenty left in the tank for another shot at Worlds, but he’ll have to fight his way through the regular season first. You shouldn’t worry though, it seems like this is something he’s done before.</p>","fr_FR":"<p>Paul « SoaZ » Boyer est un véritable vétéran de l'e-sport, avec une carrière remontant à 2010. Avant de rejoindre Origen, il s'est démarqué comme top laner chez Fnatic pendant plus de deux ans, participant ainsi à deux Championnats du monde. Après la fin de la saison 2014, Fnatic est entrée dans un processus de reconstruction et presque toute la formation a été démantelée. Après son départ de chez Fnatic, le fondateur d'Origen et mid laner Enrique « xPeke » Cedeño Martínez a courtisé Soaz pour qu'il rejoigne sa nouvelle équipe dans les Challenger Series. Soaz a sauté sur l'occasion et a ainsi joué un rôle important dans le succès d'Origen sur le circuit Challenger, dans plusieurs segments des LCS EU et même lors d'une apparition dans le Championnat du monde.</p>\n\n<p>Soaz a été le seul point positif d'un segment d'été catastrophique pour Origen en 2016. Il a décroché des victoires pour Origen à lui seul et a maintenu la compétitivité de l'équipe quand tout espoir semblait perdu. Ses excellentes performances (et ses fans dévoués) lui ont valu un ticket pour Barcelone pour participer à l'événement All-Stars 2016. Ses années d'expérience compensent ses compétences mécaniques limitées. Si l'Europe espère éviter une élimination anticipée, elle devra compter sur le vétéran robuste (et sur sa baguette) pour la guider à travers l'une des compétitions les plus difficiles de la Faille.</p>","pl_PL":"<p>Paul „SoaZ” Boyer to prawdziwy weteran e-sportu, którego kariera sięga 2010 roku. Przed przejściem do Origen był nie do ruszenia na górnej alei Fnatic przez ponad dwa lata, dołączając do składu w dwóch podejściach do Mistrzostw Świata. Po zakończeniu sezonu 2014 Fnatic rozpoczęli proces przebudowy, w wyniku którego rozeszli się niemal wszyscy gracze z początkowego składu. Po odejściu z Fnatic założyciel i środkowy Origen, Enrique „xPeke” Cedeño Martínez, zabiegał o to, by Soaz stał się ostatnim uzupełnieniem jego nowej drużyny w Challenger Series. Soaz chętnie skorzystał z tej okazji i odegrał kluczową rolę w drodze po zwyciestwo Origen podczas Challenger Circuit, kilku splitach EU LCS, a nawet występie na Mistrzostwach Świata.</p>\n\nSoaz był zapewne jedynym jasnym punktem letniego splitu 2016, o którym Origen woleliby zapomnieć. Samodzielnie prowadził Origen do zwycięstw i utrzymywał ich w konkurencyjnej formie, nawet gdy wydawało się, że wszystko już stracone. Jego świetne występy (oraz oddani fani) zapewniły mu bilet do Barcelony i udział w wydarzeniu All-Star 2016. Niedoskonałości umiejętności mechanicznych nadrabia latami doświadczeń. Jeśli Europa chce uniknąć kolejnej pożałowania godnej porażki, będzie musiała polegać na tym niezłomnym weteranie (i jego bagietce), który poprowadzi drużynę do boju przeciwko kilku z najtwardszych rywali na Summoner’s Rift.\n","de_DE":"<p>Paul „sOAZ“ Boyer ist ein wahrer E-Sport-Veteran, dessen Karriere 2010 begann. Vor seinem Wechsel zu Origen war er über zwei Jahre Fnatics Fels auf der oberen Lane, mit denen er auch an zwei Weltmeisterschaften teilgenommen hat. Nach dem Ende der Saison 2014 wurde Fnatic umstrukturiert und die ehemaligen Mitglieder gingen getrennte Wege. sOAZ wurde von Mid-Laner Enrique „xPeke“ Cedeño Martínez, der nach seinem Abgang von Fnatic Origen gegründet hatte, als letztes Mitglied für sein Abenteuer in der Challenger Series angeworben. Er ergriff die Gelegenheit und wurde zu einem wichtigen Bestandteil von Origens Durchmarsch in der Challenger Series, mehreren Splits in der EU LCS und sogar einer Teilnahme an der Weltmeisterschaft.</p>\n\n<p>Nachdem ein weiterer frustrierender Split dazu geführt hatte, dass viele Spieler Origen verließen, kehrte sOAZ zu Fnatic zurück, um für sie auf der oberen Lane zu spielen. Er kommt mit einer Menge Erfahrung (und seinem treuen Baguette) zu Fnatic zurück und wird versuchen, seine Liste mit Auszeichnungen zu erweitern. sOAZ würde sicher sagen, er habe noch genug Reserven, um bei einer weiteren Weltmeisterschaft mitzuspielen, aber dazu muss er sich erst einmal durch den Frühjahrs-Split kämpfen. Aber keine Angst, das ist nichts, was er nicht schon einmal getan hätte.</p>","es_ES":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella de la calle superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomase caminos separados. Tras abandonar Fnatic, el fundador y mid de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito aspirante, en numerosos split de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un split de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","pt_BR":"<p>Paul \"sOAZ\" Boyer é um verdadeiro veterano dos eSports, com uma carreira que começou em 2010. Antes de entrar para a Origen, ele foi o jogador de topo da Fnatic por mais de dois anos, entrando no esquadrão com duas participações do Mundial nas costas. Após o fim da Temporada 2014, a Fnatic entrou em um processo de reconstrução onde viu quase todos os membros da equipe seguirem caminhos distintos. Após a saída da Fnatic, o fundador da Origen, o jogador Enrique “xPeke” Cedeño Martínez considerou sOAZ para ser a peça final em sua aventura pela Challenger Series. Ele entrou e foi essencial na campanha da Origen pelo torneio, nas várias Etapas da LCS EU e até mesmo em uma aparição no Mundial.</p>\n\n<p>sOAZ foi a única salvação de do que foi uma Etapa de Verão triste para a Origen em 2016. Ele conseguiu praticamente sozinho algumas vitórias para a Origen e os manteve no competitivo, mesmo quando tudo parecia estar perdido. Seu desempenho incrível (e seus fãs) lhe conquistou uma vaga no Evento All-Star 2016 em Barcelona. Quando ele não tem domínio mecânico, sua experiência ajuda. Se a Europa quiser evitar perder rapidamente como no Mundial, eles precisam confiar no veterano para guiá-los na competição implacável de Summoner’s Rift.</p>","cs_CZ":"<p>Paul „SoaZ“ Boyer je skutečným veteránem esportů, jeho kariéra se totiž datuje od roku 2010. Ještě než nastoupil do Origenu, byl přes dva roky v horní lajně oporou Fnaticu, se kterým se zúčastnil dvou mistrovství světa. Po skončení sezóny 2014 však Fnatic prošel restrukturalizací, při které se cesty téměř všech jeho bývalých hráčů rozdělily. Po odchodu z Fnaticu oslovil SoaZe zakladatel a středový lajnař Origenu Enrique „xPeke“ Cedeño Martínez, který jej chtěl jako svůj poslední trumf do týmu, který měl vzít šturmem Challenger Series. SoaZ po této šanci s chutí sáhl a velkou měrou přispěl k úspěchům Origenu v seriálu Challenger, několika splitech evropského LCS a dokonce i na mistrovství světa.</p>\n\n<p>SoaZ byl nejspíš tím jediným, co drželo Origen nad vodou během jinak úděsného letního splitu 2016. Sám se snažil dotáhnout tým k výhrám a udržoval jej při životě, i když už vše vypadalo naprosto beznadějně. Jeho špičkové výkony (a zástupy milujících fanoušků) mu zajistily lístek do Barcelony, kde se zúčastní turnaje All-Star 2016. To, co mu schází v čisté herní mechanice, dohání roky zkušeností. Pokud chce Evropa tentokrát držet krok s ostatními týmy, bude se muset při bojích s těmi nejdrsnějšími soupeři opřít o tohoto veterána (a jeho bagetu).</p>","el_GR":"<p>Ο Paul \"SoaZ\" Boyer είναι ένας πραγματικός βετεράνος των esports που ξεκίνησε την καριέρα του ήδη από το 2010. Πριν υπογράψει στους Origen ήταν η άγκυρα των Fnatic στην επάνω λωρίδα για πάνω από δύο χρόνια και μάλιστα είχε λάβει μέλος με την ομάδα σε δύο Παγκόσμια Πρωταθλήματα. Μετά τη λήξη της Σεζόν 2014, έγιναν μεγάλες ανακατατάξεις στους Fnatic, καθώς όλοι σχεδόν οι παλιοί παίκτες της ομάδας τράβηξαν το δικό τους δρόμο. Όταν αποχώρησε από τους Fnatic, ο ιδρυτής και παίκτης μεσαίας λωρίδας των Origen Enrique \"xPeke\" Cedeño Martínez προσέγγισε τον Soaz για να συμπληρώσει το ρόστερ της νέας του προσπάθειας στο Challenger Series. Ο Soaz δέχτηκε με μεγάλη προθυμία και η παρουσία του ήταν καταλυτική στην πορεία των Origen στο Challenger Circuit, αλλά και σε πολλά Split του LCS Ευρώπης, ακόμα και σε μια μοναδική εμφάνιση στο Παγκόσμιο Πρωτάθλημα.</p>\n\n<p>Ο Soaz ήταν ίσως η μοναδική θετική νότα στην καταστροφική πορεία των Origen στο Summer Split 2016. Οδήγησε μόνος του στην ομάδα σε μια σειρά από νίκες και τους κράτησε σε υψηλό επίπεδο, όταν όλα έδειχναν ότι είχαν χαθεί. Αυτές οι εμφανίσεις του κόντρα στο ρεύμα (αλλά και οι θαυμαστές του που τον λατρεύουν) σφράγισαν το εισιτήριό του για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Μπορεί να μην είναι ο κορυφαίος παίκτης του κόσμου στον χειρισμό, αλλά αναπληρώνει αυτό το κενό με την πολυετή του πείρα. Αν η Ευρώπη θέλει να αποφύγει άλλη μια αποκαρδιωτική εμφάνιση, θα πρέπει να βασιστεί στην αυτοπεποίθηση (αλλά και στις οργανωτικές ικανότητες) αυτού του αξιόπιστου βετεράνου για να βρει τον τρόπο να επιβληθεί στους ισχυρότερους παίκτες του κόσμου.</p>","hu_HU":"Paul „SoaZ” Boyer valódi esport-veterán, akinek karrierje 2010-ben kezdődött. Mielőtt az Origenhez szerződött, a Fnatic megbízható felső ösvényese volt két évig, és kétszer is velük tartott a világbajnokságra. A 2014-es szezon után a Fnatic elkezdte újjáépíteni magát, és szinte az összes játékos szétszéledt. A Fnatic elhagyása után az Origen alapítója és középső ösvényese, Enrique „xPeke” Cedeño Martínez próbálta meggyőzni Soazt, hogy csatlakozzon ötödikként a Kihívók Sorozatát megcélzó csapatával. Soaz azonnal ugrott a lehetőségre, és fontos szerepe volt abban, hogy az Origen jól teljesített a Kihívók Sorozatában, az EU LCS szakaszaiban, valamint hogy kijussanak a világbajnokságra.</p>\n\nSoaz volt az egyetlen, aki víz fölött tartotta az Origent a nagyon rosszul alakuló 2016-os nyári szakasz alatt. A legreménytelenebb helyzetekben szinte egymaga harcolt ki győzelmeket az Origennek. Ezek a teljesítmények és a rajongók odaadó szeretete váltotta meg neki a jegyet Barcelonába, a 2016-os All-Star gálára. A nyers képességek helyett a hosszú évek tapasztalata teszi igazán erőssé. Ha Európa nem szeretne ismét halványan szerepelni, akkor a megbízható veteránra (és az elmaradhatatlan bagettjére) fog támaszkodni, amikor a Szurdok legkeményebb arcaival kell szembenézni.\n","it_IT":"Paul \"Soaz\" Boyer è un vero veterano degli eSport la cui carriera è iniziata nel lontano 2010. Prima di unirsi agli Origen è stato una presenza fissa in corsia superiore con i Fnatic per oltre due anni, durante i quali ha partecipato anche a due Mondiali. Al termine della stagione 2014, i Fnatic hanno subito un processo di ristrutturazione che ha separato quasi tutti i loro membri. Dopo la sua partenza dai Fnatic, il fondatore e centrale degli Origen, Enrique \"xPeke\" Cedeño Martínez, lo ha invitato nella sua squadra come ultimo elemento per prendere d'assalto le Challenger Series. Soaz colse l'occasione al volo e divenne un elemento insostituibile degli Origen nel circuito Challenger, in vari split e persino in un Mondiale.</p>\n\nNel 2016, Soaz è stato probabilmente l'unica nota positiva degli Origen in un Summer Split da dimenticare. Ha guidato da solo gli Origen in ogni vittoria e li ha tenuti a galla anche quando tutto sembrava perduto. Le sue giocate eccellenti (e i suoi devoti fan) gli hanno fatto guadagnare il biglietto per Barcellona e la partecipazione all'All-Star. Le sue lacune nella meccanica sono più che compensate dalla sua grande esperienza. Se l'Europa vuole evitare un'altra brutta sconfitta, farà meglio ad affidarsi a questo robusto veterano (e alla sua baguette) per uscire vincitrice contro gli avversari più temibili della Landa.\n","ro_RO":"Paul ''SoaZ'' Boyer este un adevărat veteran eSports, a cărui carieră începe în 2010. Înainte să semneze cu Origen, a fost un jucător de neclintit pe culoarul de sus al celor de la Fnatic mai bine de doi ani, susținându-i în două parcursuri la Campionatul Mondial. După încheierea sezonului 2014, Fnatic a intrat într-un proces de reconstrucție, în urma căruia aproape întreaga echipă a luat-o pe drumuri separate. După plecarea sa de la Fnatic, fondatorul și jucătorul de pe culoarul din mijloc al Origen, Enrique ''xPeke'' Cedeño Martínez, l-a invitat pe Soaz să se alăture echipei sale în noua ei aventură din Seria Challenger. Soaz a profitat de ocazie și a fost un jucător-cheie în parcursul celor de la Origen în competiția Challenger, în multiplele etape din LCS și chiar într-o apariție la Campionatul Mondial.</p>\n\nSoaz a fost, probabil, sigura parte bună a etapei de vară din 2016, pe care Origen își dorește s-o uite. Prin forțele proprii, i-a condus pe cei din Origen către victorii și i-a menținut în competiție chiar și atunci când toate speranțele lor păreau să se fi năruit. Reușitele sale (și fanii loiali) i-au adus un bilet către Barcelona pentru a participa la evenimentul All-Star 2016. Lipsurile mecanice îi sunt compensate de ani și ani de experiență. Dacă Europa își dorește să evite o altă eliminare dezamăgitoare, va avea nevoie de îndrumarea acestui veteran puternic (și a baghetei sale) împotriva celei mai dificile concurențe din Rift.\n","es_AR":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","es_MX":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>"},"foreignIds":{"drupalId":"76","TRLH3":"200000055","TRLH4":"200000158"},"socialNetworks":{"azubu":"azubu.tv/soaz","facebook":"https://www.facebook.com/fnaticSOAZ?fref=ts","twitter":"https://twitter.com/sOAZIZGOOD"},"champions":[],"liveGameTeam":15},{"id":98,"slug":"rekkles","name":"Rekkles","firstName":"Martin","lastName":"Larsson","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rekkles-gflgilh4.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:40.000Z","updatedAt":"2017-06-09T10:10:40.000Z","bios":{"en_US":"<p>Martin “Rekkles” Larsson is one of the most feared AD carries in the world. Rekkles debuted for Fnatic in late 2012 and immediately garnered attention with his performances at several major tournaments. He also played a key role in unlocking the door to the halls of the immortals for Fnatic, ushering in an unprecedented 18W-0L record in the 2015 EU LCS Summer Split. But after key departures following the 2015 World Championship, Rekkles and Fnatic failed to defend their EU LCS crown in the 2016 Spring Split, falling to the eventual champions G2 Esports en route to a 3rd place finish.Even though the reunion of Rekkles and Yellowstar didn’t produce the results that Fnatic hoped for, Rekkles still performed admirably throughout the 2016 EU LCS Summer Split, accounting for more than a third of his team’s overall damage.</p>\n\n<p>After an exodus of players near the end of 2016, Rekkles stayed on board with Fnatic and helped assemble a new roster filled with crafty veterans and an eager rookie. Rekkles admitted to not performing up to his own standards last year, and the 2017 season is the perfect place to reassert himself as a dominant AD Carry. He’s truly at the helm of the new-look Fnatic and will look to not only guide them, but carry them as well.</p>","fr_FR":"<p>Martin « Rekkles » Larsson compte parmi les carrys AD les plus redoutés du monde. Rekkles a commencé sa carrière chez Fnatic fin 2012 et s'est immédiatement fait remarquer avec d'excellentes performances dans plusieurs tournois majeurs. Il a également aidé Fnatic à entrer dans la légende avec un record inédit de 18 victoires contre 0 défaite lors du segment d'été des LCS EU 2015. Mais après des départs de joueurs déterminants suite au Championnat du monde 2015, Rekkles et Fnatic n'ont pas su défendre leur titre des LCS EU lors du segment de printemps 2016, s'inclinant contre les futurs champions de G2 Esports et finissant ainsi en 3e place.</p>\n\n<p>Même si la réunion entre Rekkles et Yellowstar n'a pas eu l'effet escompté par Fnatic, Rekkles a tout de même joué de façon admirable pendant tout le segment d'été des LCS EU 2016, enregistrant plus d'un tiers des dégâts totaux de l'équipe. Ces chiffres impressionnants ont suffi à lui offrir une place à l'événement All-Stars 2016 de Barcelone, où il affrontera d'autres carrys AD légendaires pour tenter d'arracher l'Europe des ténèbres et de la ramener dans la lumière de l'opinion internationale.</p>","pl_PL":"<p>Jeden z najmłodszych i z tego powodu najbardziej oczekiwanych graczy na scenie esportowej League of Legends. Martin Larsson zaczął grać profesjonalnie w maju 2012 roku, lecz już parę miesięcy później dołączył do jednej z najsławniejszych organizacji – Fnatic. Niestety, ze względu na swój wiek, nie mógł wziąć udziału w EU LCS 2013. Do czasu możliwości pełnoprawnego uczestnictwa w tych rozgrywkach \"Rekkles\" realizował się w innych zespołach. 22 listopada 2013 roku oficjalnie powrócił do szeregów Fnatic i przejął swoje stanowisko AD Carry. Już od swoich wczesnych początków był uważany za jednego z najzdolniejszych mechanicznie graczy.</p>\n<p>Wraz z drużyną Fnatic udało mu się zabłysnąć. Pomijając efektowne występy na pomniejszych turniejach jak IEM, All-Stars czy Dreamhack, to jego największym sukcesem był sezon piąty. Bezpośrednio po jego kolejnym powrocie do czarno-żółtych, razem z nimi pobił światowy rekord – nie przegrał ani jednej gry w letnim sezonie EU LCS 2015. Następnie, podczas kwalifikacji do Mistrzostw Świata 2015 \"Rekkles\" zachwycił widzów swoim pentakillem Tristaną. Po części dzięki jego solidnej grze przeciwko Origenowi, Martin wygrał te rozgrywki. Na MŚ 2015 najbardziej rzucało się w oczy to, że był w stanie konkurować z chińskimi i amerykańskimi oponentami. </p>\n<p>Do osobistych osiągnięć Martina przede wszystkim trzeba zaliczyć wejście do Kręgu Pretendenta w trzech różnych regionach: Europie, Ameryce Północnej i Korei. Udało mu się dotrzeć tak wysoko na pozycji AD Carry, dzięki swoim ulubionym postaciom: Lucianowi, Ezrealowi i Vayne. Wiele osób zastanawiało się, jak uzdolniony sportowiec trafił do świata Runeterry. \"Rekkles\" był utalentowanym piłkarzem, lecz doznał kontuzji nogi. Wtedy po raz pierwszy spróbował gry w League of Legends, w której bardzo szybko świetnie się odnalazł. Podczas zmagań na turniejach inspiracją dla niego był jego ulubiony cytat – „Pudłujesz 100% swoich strzałów, których nigdy nie dokonałeś”. W 2015 roku, w społeczeństwie było bardzo głośno o jego przywiązaniu do innego sławnego AD Carry - Hyuk-kyu’a \"Deft\" Kima. Ich unikatowa znajomość to przykład, że rywalizacja nie zawsze przekreśla przyjaźń.</p>\n","de_DE":"<p>Martin „Rekkles“ Larsson ist einer der gefürchtetsten AD-Carrys der Welt. Rekkles gab sein Debüt für Fnatic Ende 2012 und sorgte mit seinen Leistungen bei mehreren großen Turnieren sofort für Aufsehen. Außerdem spielte er bei Fnatics Einzug in die Halle der Unsterblichen eine entscheidende Rolle, als die Mannschaft den Sommer-Split der EU LCS 2015 mit 18 Siegen ungeschlagen beendete. Als jedoch einige Schlüsselspieler nach der Weltmeisterschaft 2015 die Mannschaft verließen, scheiterten Rekkles und Fnatic im Frühjahrs-Split 2016 am zukünftigen Champion G2 Esports und schafften es nicht, ihre Krone zu verteidigen. Obwohl die Wiedervereinigung von Rekkles und Yellowstar nicht so verlief, wie Fnatic gehofft hatte, lieferte Rekkles im Sommer-Split der EU LCS 2016 eine ansprechende Leistung ab und war für mehr als ein Drittel des gesamten Schadens seiner Mannschaft verantwortlich.</p>\n\n<p>Trotz der Abgänge einiger Spieler Ende 2016 blieb Rekkles Fnatic treu und half mit, aus gewitzten Veteranen und einem eifrigen Nachwuchsspieler eine neue Mannschaft zu formen. Rekkles hat zugegeben, letztes Jahr nicht zu seiner Form gefunden zu haben. Der Frühjahrs-Split der EU LCS 2017 ist für ihn die perfekte Gelegenheit, sich wieder als dominanter AD-Carry zu etablieren. Er ist die Speerspitze des neuen Fnatics und wird nicht nur versuchen, seine Mannschaft zu leiten, sondern auch, sie von einem Sieg zum nächsten zu führen.</p>","es_ES":"<p>Martin \"Rekkles\" Larsson es uno de los AD carry más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el split de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el split de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del split de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros AD carry legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","pt_BR":"<p>Martin “Rekkles” Larsson é um dos atiradores mais temidos do mundo. Rekkles estreou na Fnatic no fim de 2012 e logo ganhou atenção com seu desempenho em vários grandes torneios. Ele também teve um papel fundamental para imortalizar a Fnatic, ajudando no recorde de 18 vitórias e nenhuma derrota na Etapa de Verão 2015 da LCS EU. Porém, após alguns desfalques depois do Campeonato Mundial 2015, Rekkles e a Fnatic falharam em defender a coroa da LCS EU na Etapa de Primavera 2016, perdendo para a campeã G2 Esports e terminando em terceiro lugar.</p>\n\n<p>Apesar da reunião de Rekkles e YellOwStaR não produzir os resultados que a Fnatic esperava, Rekkles ainda teve um desempenho admirável durante toda a Etapa de Verão 2016 da LCS EU, sendo o responsável por mais de um terço do dano de sua equipe. Os números impressionantes foram suficientes para levá-lo a ser o Atirador mais votado da Europa no Evento All-Star 2016, onde ele batalhará contra outros atiradores lendários e vai tentar tirar a Europa do escuro para colocá-la de volta no cenário internacional.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Martin “Rekkles” Larsson는 세계에서 가장 두려운 원거리 딜러 중 하나입니다. Fnatic 소속으로 2012년 후반에 데뷔하자마자 IPL5에서 준우승하는 등 여러 주요 대회에서 엄청난 활약을 하며 주목을 받았습니다. 하지만 e스포츠에서 성공하려면 단순한 개인 기량뿐 아니라 인간 관계가 중요하다는 것 또한 잘 알고 있는 것이 Rekkles 선수입니다. 모델처럼 매력적인 외모와 무서운 파밍 능력을 함께 갖춘 Rekkles는 그런 면에서 완벽한 선수라고 할 수 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Fnatic이 유례없는 18승 무패로 2015 유럽 LCS 서머 스플릿을 마치는 대기록을 세우는 데에도 Rekkles의 역할이 핵심적이었습니다. 어떻게 그게 가능했을까요? 항상 노력하는 Rekkles 선수와, YellOwStaR 선수의 적절한 서포팅, 어느 한쪽으로 치우치지 않는 킬과 어시스트, 그리고 나서 엄청난 CS 수급력이 합쳐졌기 때문이죠. 실제로 2015 유럽 LCS 서머 스플릿에서 KDA 순위 1, 2위를 Fnatic의 봇 라인 선수 두 명이 합계 27을 기록하며 독점해 버렸습니다. </p>\n<p style=”font-family:”나눔고딕”;\">물론 그렇게 킬을 올렸어도 Isaac \"PePiiNeRo\" Flores 선수의 분노를 피해갈 순 없었죠. 유감입니다. </p>\n","cs_CZ":"<p>Martin „Rekkles“ Larsson je jedním z nejobávanějších ADC na světě. Debutoval koncem roku 2012 v řadách Fnaticu a okamžitě vzbudil pozornost svými výkony na několika významných turnajích. Sehrál také klíčovou roli při uvedení Fnaticu do historie, když jeho tým během letního splitu evropského LCS 2015 dosáhl do té doby nevídané bilance výher 18:0. Ovšem poté, co po mistrovství světa 2015 z celku odešlo několik důležitých členů, Rekkles a Fnatic v jarním splitu EU LCS 2016 už titul neobhájili, podlehli budoucím šampionům z G2 Esports a skončili na 3. místě.</p>\n\n<p>Ačkoliv opětovné shledání Rekklese a Yellowstara nemělo takové výsledky, v jaké Fnatic doufali, podával Rekkles po celou dobu letního splitu EU LCS 2016 působivé výkony a připsal si na konto více než třetinu celkového poškození, jež jeho tým uštědřil. Tato ohromující čísla stačila, aby vyhrál hlasování k turnaji All-Star 2016 v Barceloně, kde se střetne s ostatními legendárními ADC a pokusí se vyvést Evropu z temnoty zpět na světlo mezinárodní slávy.</p>","el_GR":"<p>Ο Martin “Rekkles” Larsson είναι ένας από τους πιο επικίνδυνους AD Carry στον κόσμο. Ο Rekkles έκανε την πρώτη του εμφάνιση με τους Fnatic στα τέλη του 2012 και έστρεψε αμέσως επάνω του τα φώτα της δημοσιότητας με τις εκπληκτικές του εμφανίσεις σε πολλά σημαντικά τουρνουά. Επίσης, έπαιξε σημαντικό ρόλο σε ορισμένα από τα μεγαλύτερα ρεκόρ που έχουν πετύχει οι Fnatic, όπως το ανεπανάληπτο σερί 18 νικών και 0 ηττών Summer Split 2015 του LCS Ευρώπης. Όμως, μετά το Παγκόσμιο Πρωτάθλημα 2015 υπήρξαν ορισμένες πολύ σημαντικές αποχωρήσεις από την ομάδα, με αποτέλεσμα ο Rekkles και οι Fnatic να μην μπορέσουν να υπερασπιστούν τον τίτλο τους στο Spring Split 2016 του LCS Ευρώπης. Γνώρισαν την ήττα από τους G2 Esports, οι οποίοι θα έπαιρναν στη συνέχεια τον τίτλο, και περιορίστηκαν στην 3η θέση.</p>\n\n<p>Παρόλο που η επανένωση του Rekkles και του Yellowstar δεν είχε τα αποτελέσματα που έλπιζαν οι Fnatic, ο Rekkles είχε μια πολύ καλή παρουσία στο Summer Split 2016 του LCS Ευρώπης, καθώς έκανε μόνος του τουλάχιστον το ένα τρίτο της συνολικής ζημιάς της ομάδας. Χάρη στα εντυπωσιακά του στατιστικά, συγκέντρωσε αρκετές ψήφους για να βρεθεί κι αυτός στο Τουρνουά All-Star 2016 στη Βαρκελώνη, όπου θα αναμετρηθεί με άλλους θρυλικούς AD Carry στην προσπάθειά του να φέρει και πάλι την Ευρώπη στο διεθνές προσκήνιο.</p>","hu_HU":"<p>Martin „Rekkles” Larsson a világ egyik legrettegettebb lövésze. Rekkles a Fnaticben kezdte a karrierjét 2012 végén, és hamar felhívta magára a figyelmet a nagy versenyeken nyújtott teljesítményével. Fontos szerepe volt abban is, hogy a Fnatic bekerüljön a halhatatlanok csarnokába, akikkel addig példátlan 18 meccses, veretlen győzelmi sorozatot értek el az EU LCS 2015-ös nyári szakaszában. A csapat fontos embereket veszített el a 2015-ös világbajnokság után, ezért Rekkles és a Fnatic nem tudta megvédeni címét az EU LCS 2016-os tavaszi szakaszában, és végül 3. helyen végzett, valamint kikapott a szakaszt megnyerő G2 Esportstól.</p>\n\nRekkles és Yellowstar jelenléte nem hozta az eredményeket, amelyeket a Fnatic várt, de Rekkles remekül játszott az EU LCS 2016-os nyári szakasza során, a csapat összesített sebzésének több mint harmadát ő okozta. Már csak emiatt is ott a helye a 2016-os All-Star gálán Barcelonában, ahol legendás lövészekkel kell megküzdenie, hogy kiássa Európát a gödörből.\n","it_IT":"<p>Martin \"Rekkles\" Larsson è uno degli ADC più temuti al mondo. Ha debuttato nel tardo 2012 con i Fnatic e ha subito attirato l'attenzione con le sue eccellenti giocate in molti tornei internazionali. È stato anche fondamentale per far entrare i Fnatic nell'olimpo degli immortali con un record mai visto di 18 vittorie e nessuna sconfitta nel Summer Split 2015 della LCS EU. Tuttavia, dopo i grandi abbandoni a seguito dei Mondiali 2015, Rekkles e i Fnatic non sono riusciti a difendere la corona nello Spring Split 2016, inchinandosi davanti ai nuovi campioni, i G2 Esports, e concludendo la stagione al terzo posto.</p>\n\nNonostante la reunion di Rekkles e Yellowstar non abbia prodotto i risultati che i Fnatic speravano, Rekkles si è comunque comportato egregiamente durante il Summer Split 2016 della LCS EU, infliggendo più di un terzo dei danni totali della sua squadra. Queste cifre impressionanti sono state sufficienti a fargli guadagnare i voti necessari a partecipare all'All-Star 2016 di Barcellona, dove si scontrerà con altri ADC leggendari cercando di traghettare l'Europa fuori dalla sua striscia negativa e donarle un nuovo successo internazionale.\n","ro_RO":"<p>Martin ''Rekkles'' Larsson este unul dintre cei mai de temut AD carry din lume. Rekkles a debutat alături de Fnatic la finalul anului 2012 și a atras imediat atenția publicului cu reușitele sale în cadrul câtorva turnee importante. În plus, a jucat un rol important în echipă, ajutându-i pe cei de la Fnatic să intre în istoria LoL și obținând un record fără precedent de 18 victorii și 0 înfrângeri în etapa de vară a LCS EU 2015. Dar în urma plecării unor jucători cheie imediat după Campionatul Mondial 2015, Rekkles și Fnatic nu au reușit să-și apere titlul din LCS EU în etapa de primăvară din 2016, terminând pe locul al treilea ca urmare a unei înfrângeri în fața viitorilor campioni, G2 Esports.</p>\n\nChiar dacă reuniunea lui Rekkles cu Yellowstar nu a adus rezultatele pe care și le-au dorit cei de la Fnatic, Rekkles s-a descurcat admirabil pe parcursul etapei de vară a LCS EU 2016, însumând mai bine de o treime din daunele totale ale echipei sale. Statisticile impresionante i-au adus voturile fanilor și calificarea la evenimentul All-Star 2016 din Barcelona, unde se va înfrunta cu alți AD Carry legendari. Acolo va lupta pentru a pune capăt seriei de nereușite ale Europei la turneele internaționale.\n","en_PL":"<p>Martin „Rekkles” Larsson jest jednym z budzących największy lęk prowadzących na świecie. Rekkles zadebiutował we Fnatic pod koniec 2012 roku i natychmiast zwrócił na siebie uwagę występami na kilku większych turniejach. Odegrał także kluczową rolę w zdobyciu miejsca pośród nieśmiertelnych sław dla Fnatic, osiągając bezprecedensowy wynik 18 zwycięstw przy 0 przegranych podczas letniego splitu EU LCS 2015. Ale gdy po Mistrzostwach Świata 2015 odeszło kilku ważnych zawodników, Rekkles i Fnatic nie zdołali obronić tytułu EU LCS podczas wiosennego splitu 2016, ulegając późniejszym mistrzom, G2 Esports i kończąc na trzecim miejscu.</p>\n\nChociaż ponowne zejście się Rekklesa i Yellowstara nie zapewniło rezultatów, których oczekiwali Fnatic, Rekkles wciąż znakomicie prezentował się w toku letniego splitu EU LCS 2016, zaliczając na swoje konto ponad jedną trzecią ogółu obrażeń zadanych przez drużynę. Te imponujące statystyki wystarczyły, by został wybrany w głosowaniu do uczestnictwa w wydarzeniu All-Star 2016 w Barcelonie, dokąd pojedzie zmierzyć się z innymi legendarnymi prowadzącymi i będzie toczył pojedynki, których stawką jest wyciągnięcie Europy z mroku zapomnienia w światło międzynarodowego uznania.\n","es_AR":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","es_MX":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>"},"foreignIds":{"drupalId":"1140","TRLH3":"200000058","TRLH4":"200000161"},"socialNetworks":{"twitch":"www.twitch.tv/Rekkles","facebook":"www.facebook.com/Rekkles1?fref=ts","twitter":"https://twitter.com/RekklesLoL"},"champions":[],"liveGameTeam":15},{"id":172,"slug":"jesiz","name":"Jesiz","firstName":"Jesse","lastName":"Le","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jesiz-dsbaxff3.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-06-09T10:12:41.000Z","bios":{"en_US":"<p>Jessie “Jesiz” Le has been on the professional scene since 2013, playing for teams like Coast, Gamers2, and Dignitas. He took a break from professional play in order to become the assistant coach for Immortals in 2016. He ended up trying out for Fnatic at the end of the year and they invited him to become their starting support.</p>\n\n<p>Jesiz is a flexible player that is now playing the third different role of his professional career. After playing as both a mid laner and AD Carry, he made yet another role swap in order to fill Fnatic’s support vacancy. More than anything Fnatic is searching for some continuity at the support position after recent times have been filled with ups and downs. Jesiz certainly brings a wealth of experience with him, but will it turn into wins? Only time will tell.</p>","de_DE":"<p>Jessie „Jesiz“ Le ist bereits seit 2013 fixer Bestandteil der professionellen E-Sport-Szene und hat schon für Mannschaften wie Coast, Gamers2 oder Dignitas gespielt. 2016 nahm er sich jedoch eine Auszeit, um der Co-Trainer der Immortals zu werden. Am Ende des Jahres bewarb er sich dann bei Fnatic und wurde zum Supporter der Mannschaft.\n\nJesiz ist ein flexibler Spieler, der im Verlauf seiner Karriere bereits auf zwei anderen Positionen gespielt hat. Nachdem er bereits als Mid-Laner und AD-Carry gespielt hatte, wechselte er erneut die Rolle, um Fnatics Suche nach einem Supporter zu beenden. Nach den Höhen und Tiefen der letzten beiden Splits braucht Fnatic nichts dringender, als eine gewisse Kontinuität auf der Supporter-Position. Jesiz kann auf einiges an Erfahrung zurückgreifen, aber wird sich das auch in Siegen widerspiegeln? Wir werden es sehen …</p>"},"foreignIds":{"drupalId":"1126","TRLH3":"200000059","TRLH4":"200000162"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":344,"slug":"xyraz","name":"Xyraz","firstName":"Gustav","lastName":"Blomkvist","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xyraz-24ixeasw.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-05-31T21:08:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3684","TRLH3":"200000300","TRLH4":"200000400"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1264,"slug":"special","name":"Special","firstName":"Joran","lastName":"Scheffer","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/special-69mtzco4.png","hometown":"EU","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:15:34.000Z","updatedAt":"2016-07-30T04:57:42.000Z","bios":{},"foreignIds":{"TRLH3":"1001310008","TRLH4":"1001270008","TRLH2":"1001250047","FRA1TMNT2":"25217"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41}],"scheduleItems":[{"id":"AVcMQewCoUG4HPFjOKCk","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:f6d7d736-56c1-4eaa-b9d0-28a92f994503","scheduledTime":"2015-10-17T13:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"Quarterfinals","subBlockLabel":"3","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:7b37dd34-b90e-4d6a-bf7c-e8565a435b93"},"match":"f6d7d736-56c1-4eaa-b9d0-28a92f994503","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"7b37dd34-b90e-4d6a-bf7c-e8565a435b93","league":"9"}],"gameIdMappings":[{"id":"5a31cbe8-0427-48c6-8747-f597df151e8a","gameHash":"db9976555bd8061c"},{"id":"c16b420c-9ced-4864-90ec-e72f943b71f0","gameHash":"88ce77db01c51945"},{"id":"ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd","gameHash":"e42e82082e552e52"}],"videos":[{"id":207,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd","source":"https://www.youtube.com/embed/VJlEGtWlmHA?wmode=transparent","createdAt":"2015-10-17T14:20:43.000Z","updatedAt":"2015-10-17T14:20:43.000Z","game":"ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd"},{"id":208,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd","source":"https://www.youtube.com/embed/zv26mvmQCKo?wmode=transparent","createdAt":"2015-10-17T15:40:15.000Z","updatedAt":"2015-10-17T15:40:15.000Z","game":"ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd"},{"id":210,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:c16b420c-9ced-4864-90ec-e72f943b71f0","source":"https://www.youtube.com/embed/WiFb1mUoaCM?wmode=transparent","createdAt":"2015-10-17T17:31:27.000Z","updatedAt":"2015-10-17T17:31:27.000Z","game":"c16b420c-9ced-4864-90ec-e72f943b71f0"},{"id":211,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:5a31cbe8-0427-48c6-8747-f597df151e8a","source":"https://www.youtube.com/embed/jAh4G6iwfoc?wmode=transparent","createdAt":"2015-10-17T17:31:11.000Z","updatedAt":"2015-10-17T17:31:11.000Z","game":"5a31cbe8-0427-48c6-8747-f597df151e8a"},{"id":212,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:5a31cbe8-0427-48c6-8747-f597df151e8a","source":"https://www.youtube.com/embed/ZTqIGjy4eGY?wmode=transparent","createdAt":"2015-10-17T17:45:28.000Z","updatedAt":"2015-10-17T17:45:28.000Z","game":"5a31cbe8-0427-48c6-8747-f597df151e8a"},{"id":214,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:c16b420c-9ced-4864-90ec-e72f943b71f0","source":"https://www.youtube.com/embed/cFN5O5PYQeM?wmode=transparent","createdAt":"2015-10-17T19:15:11.000Z","updatedAt":"2015-10-17T19:15:11.000Z","game":"c16b420c-9ced-4864-90ec-e72f943b71f0"}],"htmlBlocks":[],"match":{"id":"f6d7d736-56c1-4eaa-b9d0-28a92f994503","name":"R1M3","position":2,"state":"resolved","groupName":"Round 1","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2},{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3}],"games":{"67d761a1-cc71-4c0f-be59-ec3047fb8901":{"id":"67d761a1-cc71-4c0f-be59-ec3047fb8901","name":"G5","generatedName":"EDG|FNC|G5|f6d7d73656c14eaab9d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2},{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"178cd979-fbbf-4718-bc9f-e9f54d94283c":{"id":"178cd979-fbbf-4718-bc9f-e9f54d94283c","name":"G4","generatedName":"EDG|FNC|G4|f6d7d73656c14eaab9d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3},{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"c16b420c-9ced-4864-90ec-e72f943b71f0":{"id":"c16b420c-9ced-4864-90ec-e72f943b71f0","name":"G3","generatedName":"EDG|FNC|G3|f6d7d73656c14eaab9d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2},{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3}],"standings":{"result":[[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb"}],[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}]],"timestamp":1445102450477,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001390128","gameRealm":"TRLH3","platformId":"TRLH3:1001390128","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"5a31cbe8-0427-48c6-8747-f597df151e8a":{"id":"5a31cbe8-0427-48c6-8747-f597df151e8a","name":"G2","generatedName":"EDG|FNC|G2r2|f6d7d73656c14eaab","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3},{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2}],"standings":{"result":[[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb"}],[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}]],"timestamp":1445099091560,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001400097","gameRealm":"TRLH3","platformId":"TRLH3:1001400097","revision":2,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd":{"id":"ef59fc1f-8c75-4c64-89c1-ff1ec215f0cd","name":"G1","generatedName":"EDG|FNC|G1|f6d7d73656c14eaab9d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2},{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3}],"standings":{"result":[[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb"}],[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}]],"timestamp":1445091095486,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001390117","gameRealm":"TRLH3","platformId":"TRLH3:1001390117","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb"}],[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}]],"timestamp":1445102450478,"source":"bestOf","closed":true},"remadeGames":[{"id":"3a199560-604c-4a91-b41a-2f37b493d494","name":"G2","generatedName":"G2|\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000","state":"remade","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":3},{"roster":"5d8ea84a-ba4d-4a9b-988d-bd2a5696dcdb","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":2}],"scores":{},"gameId":"1001390125","gameRealm":"TRLH3","platformId":"TRLH3:1001390125","revision":1}],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scores":{}}}