{"teams":[{"id":293,"slug":"paris-saint-germain-esports","name":"Paris Saint-Germain","guid":"efa9b240-15f2-4da9-8d11-3f8691424582","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/paris-saint-germain-esports-97yavzqq.png","acronym":"PSG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2017-01-30T20:16:34.000Z","updatedAt":"2017-07-27T08:08:35.000Z","bios":{"en_US":"Coach: Hadrien \"Hadrien\" Forestier"},"foreignIds":{},"players":[97,391,414,484,665,760,808,1043,1159,1457],"starters":[391,414,808,1043,1457],"subs":[97,484,665,760,1159]},{"id":294,"slug":"fnatic-academy","name":"Fnatic Academy","guid":"2dc9c14d-e48b-44be-a8da-fe26fe59523f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-academy-1yiaf3vk.png","acronym":"FNA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2017-01-30T20:17:58.000Z","updatedAt":"2017-03-09T02:38:16.000Z","bios":{"en_US":"Coach: Kublai \"Kubz\" Barlas"},"foreignIds":{},"players":[64,204,244,341,1159,1449,1632,1770],"starters":[64,204,341,1159,1449],"subs":[244,1632,1770]}],"players":[{"id":64,"slug":"amazing","name":"Amazing","firstName":"Maurice","lastName":"Stückenschneider","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazing-7k66ma5o.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:18.000Z","updatedAt":"2017-06-20T13:14:44.000Z","bios":{"en_US":"<p>Maurice \"Amazingx\" Stückenschneider's jungle prowess is known on both sides of the Atlantic. Amazing rose to fame when he played a key role in the Copenhagen Wolves' promotion to the EU LCS in late 2013. He then hopped across the pond and spent a brief stint in North America with Team SoloMid, helping lead the team to the 2014 World Championship Quarterfinals. At the end of the season he returned to Europe to join Origen's starting roster in the EU Challenger Series, where he easily earned a berth into the EU LCS. A lifelong basketball player, Amazing's competitive nature drives him to dominate the map and make plays for his team.</p>\n\n<p>After the struggles mounted for Origen in 2016, Amazing left the team at the end of the year and became part of the Fnatic organization shortly after. Amazing fell short of his lofty promises for Origen last year and will make sure that the same doesn’t happen this year. An explosive player on the Rift, Amazing still has the ability to take over games at a moment’s notice. A change of scenery may be just what was needed in order to rekindle Amazing’s in-game fire.</p>","de_DE":"<p>Maurice „Amazingx“ Stückenschneiders Fähigkeiten im Dschungel sind auf beiden Seiten des Atlantiks bekannt. Amazing wurde bekannt, als er beim Aufstieg der Copenhagen Wolves in die EU LCS Ende 2013 eine entscheidende Rolle spielte. Daraufhin überquerte er den großen Teich und half Team SoloMid dabei, das Viertelfinale der Weltmeisterschaft 2014 zu erreichen. Am Ende der Saison kehrte er nach Europa zurück, um Origen dabei zu helfen, die europäische Challenger Series zu gewinnen und wieder in die EU LCS aufzusteigen. Amazing spielt schon sein ganzes Leben lang Basketball und seine Wettkampfmentalität verleitet ihn dazu, die Karte zu dominieren und seine Mannschaft mit seinen Spielzügen zu unterstützen.</p>\n\n<p>Nachdem die Probleme für Origen 2016 immer größer geworden waren, verließ Amazing die Mannschaft Ende des Jahres und wechselte kurz darauf zu Fnatic. Amazing konnte seine stolzen Versprechungen letztes Jahr bei Origen nicht umsetzen und er wird alles dafür tun, dass ihm das in diesem Jahr nicht wieder passiert. Er ist in der Kluft brandgefährlich und kann Spiele von einem Augenblick zum anderen an sich reißen. Ein Tapetenwechsel könnte genau das Richtige gewesen sein, um Amazings Funken erneut zu entfachen.</p>","es_ES":"<p>Nadie pone en cuestión que Maurice ‘Amazingx’ Stückenschneider tiene un don para jugar a League of Legends al máximo nivel, pero el alemán es además un abanderado del trabajo duro, algo que aprendió de Kobe Bryant, su ídolo baloncestístico. Puede que esta mentalidad traicione a su apodo, para el cual se inspiró en la canción de Kanye West con la que comparte título, pero es lo que le ha llevado al éxito.</p>\n\n<p>Aunque en un primer momento Amazing desestimó el juego de Riot Games debido a su estética, la insistencia de su hermano acabó pasando factura y el germano se inició como tirador. No obstante, al igual que en otros títulos a los que había jugado antes, su deseo de tener un mayor impacto en las partidas le llevó a la jungla. Udyr, Shyvana y sobre todo Lee Sin fueron los personajes que utilizó para escalar posiciones en el ránking.</p>\n\n<p>Sus 2 800 puntos de ELO al término de la segunda temporada hicieron que Team Acer se hiciera con sus servicios para acceder a la primera edición de la LCS EU. Ante el fallido intento Amazing abandonó la organización y deambuló sin éxito por varios equipos durante el siguiente año, lo que estuvo a punto de provocar su retirada.</p>\n\n<p>Sin embargo, la salida de Ilyas ‘Shook’ Hartsema dejó una vacante en Copenhagen Wolves que el jungla alemán ocupó. La organización danesa se hizo con un puesto en el split de primavera de la LCS EU 2014 a través del Torneo de Promoción, en el que derrotó a Meet Your Makers sin complicaciones. Amazing, que necesitó casi dos años para ingresar en la máxima liga continental, aprovechó la ocasión para convertirse en una de las revelaciones.</p>\n\n<p>Su destreza con Lee Sin, Elise y Evelynn fue un problema que en ocasiones los rivales no pudieron resolver. El equipo tenía carencias evidentes, pero las buenas actuaciones de Amazing y Konstantinos ‘FORG1VENGRE’ Tzortziou permitieron una modesta participación en los Playoffs.</p>\n\n<p>Pero fue en verano cuando Amazing encontró su oportunidad de oro. Team SoloMid buscaba un recambio para Brian ‘TheOddOne’ Wyllie y el alto nivel mecánico del alemán le convirtió en el mejor candidato. Reemplazar a una leyenda de la organización norteamericana más popular no fue sencillo y al principio Amazing lo pasó mal debido a su escaso repertorio de campeones. Para anularle, los contrincantes bloqueaban varios personajes del jungla, que en una ocasión se vio obligado a seleccionar a Volibear para desgracia de sus aliados. Pese a todo, Amazing fue el jugador más valioso de la cuarta semana y Team SoloMid recuperó la corona que Cloud9 le había arrebatado.</p>\n\n<p>El Campeonato Mundial 2014, en el que se enfrentó a junglas de la talla de Choi ‘DanDy’ In-kyu, le ayudó a llevar su juego al siguiente nivel. Deseoso de regresar a Europa, Amazing aprovechó la oferta de Enrique ‘xPeke’ Cedeño y se unió a Origen, donde se ha asentado como uno de los mejores del continente en su posición con actuaciones sólidas, sobre todo con Gragas.</p>","fr_FR":"<p>Maurice « Amazingx » Stückenschneider est un jungler dont la carrière professionnelle débute en janvier 2014, lorsqu’il se qualifie aux League of Legends Championship Series avec l’équipe Copenhagen Wolves. Connu pour avoir un style de jeu agressif, l’Allemand s’illustre principalement avec Lee Sin pendant le segment de printemps, exposant des mécaniques de jeu solidement rodées. Malheureusement pour lui, cette première aventure en LCS s’avère infructueuse. Après avoir obtenu la 6e place sur 8 lors de la saison régulière, Amazing et son équipe finissent dernier des play-offs et sont contraints de passer par le tournoi de promotion pour conserver leur place en LCS. Après avoir réussi cette entreprise, Amazing reçoit une proposition d’outre-Atlantique : l’équipe Team SoloMid veut s’offrir ses services suite au départ du « Général OddOne ». Amazing accepte l’offre et devient l’un des premiers joueurs européens à s’expatrier aux États-Unis.</p>\n\n<p>Il y retrouve le mid laner danois Søren « Bjergsen » Bjerg, également passé par la case Copenhagen Wolves et trouve une certaine complicité avec ce dernier. Malgré de bons résultats, certains observateurs accusent Amazing d’être trop dépendant de Lee Sin et Elise, ses deux champions les plus joués et les seuls à avoir des ratios de victoires convainquant (respectivement 78% et 89%). Néanmoins, en plus d'être un joueur à la technique aiguisée, Amazing se révèle être un excellent tacticien, ce qui vaudra à son équipe la 3e position de la saison régulière. Auteur de très belles parties avec Nunu et Kha’Zix, le jungler mène son équipe à la première place de la saison estivale des LCS NA.</p>\n\n<p>Au Mondial 2014, TSM réussit à sortir du groupe B à la 2e place, puis s’incline en quart de finale face aux futurs champions du monde, réussissant tout de même à sauver l’honneur lors de la troisième partie. Amazing décide par la suite de quitter TSM pour retrouver son Europe natale. Début décembre, il rejoint les rangs d’Origen, une nouvelle structure dont la première ambition est d’accéder aux LCS via les Challenger series. Le pari est tenu et Amazing se qualifie pour la seconde fois. Contrairement à sa première expérience européenne, celle-ci s'avère fructueuse.</p>\n\n<p>Avec le temps et les patchs, la méta de la jungle a évolué. En 2015, les champions résistants font leur retour en force. Amazing s’en accommode très vite et brille particulièrement avec Rek’Sai et Gragas. Son niveau de vision de jeu est très vite remarqué tant sa présence sur la carte est percutante. En duo avec son support Alfonson « Mithy » Aguirre Rodriguez, Amazing réussi à contrer les initiatives adverses et à prendre le contrôle de la vision dans un nouveau style d’agressivité. Ces performances permettent à son équipe de se hisser à la 2e place de la saison estivale des LCS EU et d’obtenir la 2e place des play-offs. Au mondial 2015, Amazing rivalise avec les meilleurs, guidant son équipe jusqu’en demi-finale.</p>","pl_PL":"<p>Pochodzący z Bocholt w Niemczech, Maurice Stückenschneider to zawodnik, którego sława wciąż rośnie. Pierwszy raz zanurzył się w wirtualny świat gier w wieku pięciu lat, dając się porwać starym grom na konsole. Przez parę kolejnych lat nie ciągnęło go do klawiatury i myszki, zdecydowanie bardziej wolał zostać przy padzie. Dopiero w 2010 roku skusił się na grę na komputerze, z okazji wzięcia udziału w wydarzeniach związanych z ESL. Pierwotnie League of Legends odrzucało Maurice’a ze względu na grafikę podobną do kreskówek. Dopiero jego brat nakłonił go do tego, żeby spróbował w nią zagrać.</p>\n<p>\nSwój debiut w świecie Runeterry \"Amazing\" rozpoczął od fascynacji postaciami AD Carry. Po pierwszym sezonie zmienił swoje upodobania. Jego zainteresowanie skupiło się na Jungli, ponieważ chciał mieć większy wpływ na grę. Grając Udyrem, Shyvaną i Lee Sinem udało mu się osiągnąć zawrotny wynik 2,8 tysiąca Elo w drugim sezonie. Jego progres nie umknął uwadze sporej ilości drużyn, po wielu perypetiach skorzystał z oferty Copenhagen Wolves. Z tą drużyną miał okazję pierwszy raz pokazać się na EU LCS, lecz wiosenny sezon 2014 z tą drużyną skończył się na meczach relegacyjnych.  \"Amazing\" odszedł z CW, ale w międzyczasie jego sława zdążyła dotrzeć aż za ocean. Został doceniony przez powszechnie znaną drużynę Team SoloMid. Pomimo powszechnej krytyki jego małego zasobu bohaterów,  wykorzystał swoje umiejętności z tym zdecydowanie lepszym w tym czasie zespołem. Efektem tego było pierwsze miejsce w letnim sezonie 2014, gwarantujące drużynie miejsce na Mistrzostwach Świata 2014. 11 października tego samego roku Maurice odszedł z TSM, powołując się na sprawy rodzinne i wrócił do swojej ojczyzny.</p>\n<p>\n\"Amazing\" na początku swojej kariery w Jungli wzorował się na Danilu \"Diamondprox\" Reshetnikovie, bardzo sugerując się bohaterami, których Rosjanin wybierał. Jednak ostatecznie ulubionymi bohaterami Maurice’a są: Xin Zhao, Shyvana, Lee Sin i Nautilus. Duży wpływ na niego miały też gwiazdy z innych dziedzin. Ze względu na to, że w przeszłości grał zawodniczo w koszykówkę, jednym z jego idoli jest Kobe Bryant, a ulubioną drużyną Los Angeles Lakers. Stąd też wywodzi swoje motto: „Ciężka praca pokonuje talent”. Cieszy swoich fanów aktywnością na Twitterze, gdzie lubi narzekać na sprawy, które go irytują. Mocny charakter Maurice’a widać także w rozmowach z nim. W wywiadzie przed półfinałem Mistrzostw Świata 2015 powiedział „Nie boję się SKT T1”.\n</p>","pt_BR":"<p>\nA fama de Amazingx vem dos dois lados do Atlântico. Ele apareceu no cenário quando subiu com a Copenhagen Wolves para a LCS em 2013. Então ele cruzou o oceano e jogou por um tempo na TSM, ajudando a levar o time até as quartas de final. No final da temporada, ele voltou para a Europa e se juntou à Origen para disputar a Série Desafiante da LCS EU.</p>\n<p>\nEle jogou basquete por muitos anos, e sua natureza competitiva o motiva a dominar o mapa e fazer jogadas para o time. Ele teve lampejos de genialidade ao longo da carreira, mas seu desempenho se consolidou como nunca na Origen. Qual o próximo passo? Amazing só consegue pensar no Mundial. E você vai dizer que ele está errado?</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">정글러로서 Maurice \"Amazingx\" Stückenschneider 선수의 실력은 북미와 유럽 양쪽에서 유명합니다. Amazing 선수는 Copenhagen Wolves의 2013년 말 유럽 LCS 승급에 결정적인 역할을 하며 이름을 널리 알렸죠. 그리곤 대서양을 건너 북미에서 잠시 Team SoloMid에 합류해 2014년 월드 챔피언십 8강까지 진출하는 데 톡톡한 공을 세웠습니다. 그리고 시즌이 끝난 후 유럽으로 돌아와 Origen의 창단 멤버로 유럽 Challenger 시리즈에 출전했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">어릴 때부터 농구를 해온 덕에 지기 싫어하는 면모가 있어 경기를 할 때도 맵을 장악하고 플레이 메이커 역할을 하는 모습을 쉽게 볼 수 있습니다. 선수 생활을 시작할 때부터 뛰어난 실력을 계속 보였던 Amazing 선수이지만 훨씬 꾸준한 모습을 보여준 건 Origen에 합류하면서부터였습니다. Origen의 데뷔 시즌인 2015년, 월드 챔피언십에서 준결승까지 올라갔으니 올스타의 반열에 드는 게 당연해 보입니다. Amazing 선수가 앞으로 어떤 행보를 보일지 매우 기대됩니다. </p>\n","el_GR":"","es_AR":"","ro_RO":"","es_MX":"","tr_TR":"","en_PL":"","ru_RU":"","it_IT":"","en_GB":"","hu_HU":"","cs_CZ":""},"foreignIds":{"drupalId":"1102","TRLH3":"200000056","TRLH4":"200000159"},"socialNetworks":{"azubu":"azubu.tv/amazing","facebook":"https://www.facebook.com/amazinglolx?fref=ts","twitter":"https://twitter.com/Amazing_EU"},"champions":[],"liveGameTeam":294},{"id":97,"slug":"yellowstar","name":"Yellowstar","firstName":"Bora","lastName":"Kim","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/yellowstar-2m845lg.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:39.000Z","updatedAt":"2017-06-18T19:20:34.000Z","bios":{"en_US":"<p>\nA former AD carry turned support, Bora “YellOwStaR” Kim is a veteran of the League of Legends esports scene. While his peers have ridden off into the sunset of retirement, Yellowstar carries on, driven by an indefatigable desire to be the best in the world. Considering he's competed in every World Championship thus far, it seems his drive is serving him well.\n</p>\n<p>\nYellowstar departed for the NA LCS in late 2015, joining up with North American powerhouse, TSM. They looked destined to run rampant over the competition in the 2016 NA LCS Spring Split. But after falling to Counter Logic Gaming in the 2016 NA LCS Spring Split Finals, Yellowstar made his way back to the EU LCS and Fnatic. With his stint in North America behind him, Yellowstar has the chance to reestablish himself as a premier meta game maestro this Summer. The expectations are once again high for the renowned shot caller. And if one thing is for certain, it’s that Yellowstar has the potential to turn this Split into yet another page in Fnatic’s storied history book.\n</p>","fr_FR":"<p>Bora « YellOwStaR » Kim est plus qu'un vétéran de la scène e-sport européenne. Il est devenu une réelle icône de la scène League of Legends, tant par ses ambitions que son palmarès tout au long de sa carrière. Ancien carry AD reconverti en support, il a participé à tous les championnats du monde et guidé Fnatic en tant que capitaine et shotcaller à travers de nombreuses victoires.</p>\n\n<p>Lorsque certains joueurs souhaitent rejoindre les rives ensoleillées de la retraite, YellOwStaR lui, est en quête de challenge et s'engage à relever les défis. Ainsi, fin 2015, il annonce son départ de Fnatic pour s'envoler de l'autre côté de l'Atlantique et rejoindre une autre structure star des LCS, la Team SoloMid. Aux côtés de Yi-lang « Doublelift » Peng, il entame une nouvelle aventure mais peine à trouver ses marques. Malgré un résultat satisfaisant lors des IEM Katowice, l'équipe reste inconstante en compétition LCS, et c'est à force de travail dans un encadrement stable que les TSM parviennent enfin à décoller. Durant les play-offs de printemps, ils piétinent Cloud9 et les invincibles Immortals pour finalement perdre la finale face à des Counter Logic Gaming survoltés.</p>\n\n<p>Avec cet échec, la star française revient à ses premiers amours et annonce son retour en tant que support pour Fnatic. Si les fans l'attendent avec impatience, la pression est énorme pour YellOwStaR qui devra se montrer à la hauteur et redorer le blason de Fnatic durant le segment d'été. Pourra-t-il soulever à nouveau le trophée à la fin des play-offs et se lancer dans une nouvelle conquête des championnats du monde ?</p>","pl_PL":"<p>YellOwStaR to prawdziwy fenomen. Francuski zawodnik znajduje się na scenie od września 2010 rok, kiedy zaczął współpracę z organizacją against All authority, w której występował w roli strzelca. Wraz z tym zespołem dostał się na Mistrzostwa Świata sezonu 1, na które aAa jechało jako jeden z faworytów do triumfu. Ostatecznie skończyło się przegranej w finale przeciwko Fnatic i drugim miejscu, ale dla Francuza to i tak był ogromny sukces. Po około roku gry we francuskiej ekipy, YellOwStaR zdecydował się odejść i dołączyć do innej dużej, rodzimej organizacji – Millenium. W nowym zespole Bora zmienił pozycję i pełnił rolę… top-lanera. Nie trwało to jednak długo i Bora postanowił wrócić zarówno do swojego byłego zespołu, aAa, jak i do roli strzelca. Przez pewien czas nie mógł jednak znaleźć dla siebie odpowiedniego miejsca – w against All authorities spędził tylko pół roku, potem kolejne pół ponownie w Millenium, a następnie powędrował do SK Gaming. Z tą ostatnią formacją udało mu się dostać na Mistrzostwa Świata sezonu 2, ale zespół zakończył zmagania na fazie grupowej.</p>\n<p>\nWkrótce YellOwStaR po raz kolejny zmienił drużynę, dołączając do jednej z największych organizacji w Europie – Fnatic. Początkowo pełnił w niej rolę strzelca i przyczynił się do wygrania przez tę drużynę pierwszego w historii splitu EU LCS. Po pół roku okazało się jednak, że zespół szuka miejsca dla niesamowicie utalentowanego Martina „Rekklesa” Larssona, który w niedługim czasie miał być dopuszczony do gry w LCS. Wobec tego Bora postanowił ponownie zmienić pozycję i zostać supportem. Przez pierwsze pół roku miał grać na dolnej alei z estońskim strzelcem Johannesem „puszu” Uibosem. Początki Francuza w nowej roli nie były łatwe.</p>\n<p>\n„YellOwStaR był wtedy bardzo niedoświadczonym suportem. Robił dużo błędów w pozycjonowaniu i dawał się łapać podczas wardowania - powiedział o pierwszym splicie YellOwStaRa jako supporta jego rywal, Erik „Tabzz” van Helvert.</p>\n<p>\nPomimo to YellOwStaR i jego Fnatic dostali się na Mistrzostwa Świata, po raz kolejny deklasując konkurencję i wygrywając letnią edycję zmagań na Starym Kontynencie, a tam dostali się do półfinału. \nOd początku sezonu 4 YellOwStaR grał już z nowym partnerem na dolnej alei - Rekklesem Francuz szybko zrobił znaczne postępy w grze na nowej pozycji i stał się jednym z najlepszych suportów w stawce. Miał spory udział w kolejnych sukcesach Fnatic – wygranym wiosennym splicie i drugim miejscu w letniej edycji rozgrywek, a także uzyskaniu kwalifikacji na kolejne, dla YellOwStaRa już czwarte, Mistrzostwa Świata, tym razem sezonu 4.</p>\n<p>\nPo nieudanym występie zespół się rozpadł, a jedynym graczem, który pozostał w Fnatic był właśnie YellOwStaR, który zdecydował się odbudować potęgę Fnatic w oparciu o młodych, obiecujących zawodników. Francuz poradził sobie w nowej roli, kapitana i mentora, doskonale, a dowodzony przez niego zespół wygrał wiosenny split. To był właśnie ten moment, w którym Francuz został w pełni doceniony, a jego umiejętność zapanowania nad drużyną i fenomenalny shot-calling zaprowadziły Fnatic po raz kolejny na sam szczyt.</p>\n<p>\n„YellOwStaR to najlepszy support w LCS” – powiedział krótko trener Fnatic, Luis „Deilor” Sevilla Petit, zapytany o swojego byłego już podopiecznego. </p>\n<p>\nYellOwStaR i spółka nie zwalniali tempa, a francuski wspierający miał ogromny udział w ustanowieniu przez drużynę niezwykłego rekordu, którym był split idealny – 18-0. Fnatic pojechało na Mistrzostwa Świata sezonu 5, a tam Francuz wyrównał swoje osiągnięcie z sezonu 3, znów docierając do półfinału najważniejszych zawodów LoL-a na świecie. </p>\n<p>\nPo zakończeniu sezonu 2015 YellOwStaR zastanawiał się nad zakończeniem kariery, ale ostatecznie jedynie opuścił Fnatic, z którym związany był przez niemal trzy lata. Znakomity support dołączył do budującego niesamowicie silny skład Teamu SoloMid.\nFrancuz jest obecnie, obok hiszpańskiego mid-lanera, xPeke najbardziej utytułowanym zachodnim graczem. Ma na swoim koncie 5 triumfów w EU LCS, jedno drugie miejsce w tych rozgrywkach, drugą pozycję na Mistrzostwach Świata sezonu 1 oraz dwa półfinały tych zawodów osiągnięte w latach 2013 i 2015. Co ciekawe, to właśnie francuski wspierający przedstawił profesjonalnej scenie swojego rodaka Paula „sOAZ’a” Boyera. YellOwStaR jest także mistrzem Francji w Warcrafta 3 z 2009 roku, a jego ulubionym filmem jest „Ip Man”. Francuski wspierający należy również do składającego się tylko z dwóch graczy grona uczestników wszystkich kolejnych Mistrzostw Świata League of Legends.\n</p>","de_DE":"<p>Bora „YellOwStaR“ Kim ist einer der erfahrensten Spieler der gesamten Liga. Er ist nicht nur einer der gefragtesten Spieler in League of Legends, sondern hat in der Vergangenheit auch im kompetitiven Bereich in Warcraft 3 und Starcraft 2 gespielt – hier hat er mehrere Turniere für sich entscheiden können. Zur Beta von League of Legends entschied er sich dann, sich voll und ganz dem Spiel zu widmen. Er ist einer der Wenigen, der an allen Weltmeisterschaften teilgenommen hat – dreimal unter einem anderen Banner. Zuletzt spielte er erfolgreich bei Fnatic, davor war er bei SK Gaming und Against All Authority tätig. </p>\n\n<p>Mit dem Wechsel zu TSM geht der junge Franzose jetzt neue Wege und erhofft sich an der Seite seiner Teamkameraden wieder in die Weltmeisterschaft einziehen zu können. Ob das gelingt, werden die Spiele in der LCS zeigen müssen. YellOwStaR hat aber in der Vergangenheit immer beweisen können, wie stark er im kompetitiven Bereich ist. </p>\n\n\n<p><i>„Wie ich zu TSM gekommen bin? Ich finde das diesjährige Roster von Team SoloMid enorm stark und ich bin überzeugt, dass wir das beste Team der Region werden können.“  -  Bora „YellOwStaR“ Kim</i></p>\n\n\n<p>< h2>Der Weg des Spielers</ h2></p>\n\n\n<p>Angefangen im Team Against All Authority hat er das erste Mal die Weltmeisterschaft erreichen können. Später wechselte er im Juli 2012 zu SK Gaming und durfte hier ebenfalls an der Weltmeisterschaft teilnehmen. Später – in Saison 5 – war er dann mit Fnatic im Turnier. Auch wenn er sehr oft qualifiziert wurde, hat er die Turniere bisher nicht für sich entscheiden können. Gerade mit Fnatic standen die Chancen sehr gut, nachdem Fnatic nach der LCS-Phase als ungeschlagen galt – verlor hier aber dann gegen KOO Tigers. </p>\n\n\n<p><i>„Der Wechsel wird viele Zuschauer verwundert haben – schon allein wegen der Rivalität zwischen EU und NA. Ich möchte allerdings auf einem sehr hohen Niveau spielen, weswegen ich TSM als gute Chance sehe.“  - Bora „YellOwStaR“ Kim</i></p>\n\n\n<p>Bora Kim ist überzeugt, dass er in den Reihen von TSM zeigen kann, dass er der beste Spieler seiner Region werden kann. Als Supporter hat er oft bewiesen, wie stark er wirklich ist. Mit Team SoloMid will er zeigen, dass es noch besser geht.  Während seiner gesamten Karriere hat er vor allem mit Leona, Annie oder Alistar zeigen können, dass er die Rolle des Supporters gemeistert hat. Er zählt noch immer zu den besten Leona-Spielern der Welt. </p>\n\n\n\n\n<p><h2>Interessante Fakten </h2></p>\n\n<p>•\tBeliebte Champions: Leona, Annie, Alistar</p>\n<p>•\tEhemaliger WC3- und SC2-Spieler</p>\n<p>•\tBrachte Paul „sOAZ“ Boyer dazu, League of Legends zu spielen</p>\n","es_ES":"<p>Un tirador en sus comienzos reconvertido al puesto de support, Bora “YellOwStaR” Kim es un veterano del panorama europeo de esports. Mientras sus compañeros se han ido retirando YellOwStaR sigue al pie del cañón, motivado por un deseo infatigable de ser el mejor del mundo. Considerando que es el único jugador junto a Dyrus que ha participado en todos los Campeonatos Mundiales hasta la fecha, parece que está en el camino correcto. </p>\n<p>\nEntonces, ¿qué puede aportar a su equipo un curtido veterano? Si se trata de YellOwStaR, tantas cosas que es difícil precisarlas. Se le podría definir como el inteligente director de la sinfonía que interpreta Fnatic, un líder dentro y fuera de la Grieta, que es capaz de convertir a sus compañeros en una máquina bélica perfectamente engrasada. Asume con elegancia la responsabilidad de las derrotas al mismo tiempo que transmite a otros la gloria por las victorias. Se muestra optimista hasta en situaciones de abrumadora inferioridad y mantiene la moral alta incluso después de derrotas aplastantes. Y en 2015 lideró a sus compañeros en el histórico 18-0 obtenido durante la temporada regular de la LCS de EU, seguido por una semifinal en el Campeonato Mundial. \n</p>","pt_BR":"<p>Um ex-atirador que virou suporte, YellOwStaR é um veterano do cenário europeu. Enquanto seus colegas de turma desapareceram na aposentadoria, YellOwStaR continua na ativa, motivado pelo sonho de ser o melhor do mundo. Considerando que ele competiu em todos os Mundiais até agora, parece que ele está no caminho certo.</p>\n<p>\nMas o que um veterano sábio faz no seu time? Se ele for YellOwStaR, o impacto é tão grande que vai ser difícil medir. Ele é o maestro da orquestra chamada Fnatic. É o líder dentro e fora de jogo, moldando seus companheiros em um furacão de batalha implacável. Ele absorve as críticas humildemente nas derrotas, e transfere a glória sem problemas nas vitórias. Ele continua sendo otimista nos momentos difíceis, e mantém o time motivado mesmo diante da mais humilhante derrota. Sem contar, é claro, no recorde histórico de 18-0 que ele ajudou a cravar na temporada de verão 2015. </p>"},"foreignIds":{"drupalId":"78","TRLH3":"1001310001","TRLH4":"1001270001","TRLH1":"1001220149","TRLH2":"1001160199","FRA1TMNT2":"25119","ESPORTSTMNT02":"200002459"},"socialNetworks":{"twitter":"https://twitter.com/FnaticYellOwStR","facebook":"www.facebook.com/fnaticYellOwStaR","twitch":"http://www.twitch.tv/yellowstarr"},"champions":[],"liveGameTeam":293},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":294},{"id":244,"slug":"dan","name":"Dan","firstName":"Daniel","lastName":"Hockley","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/dan-ex6b836p.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-07-30T13:55:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2915","FRA1TMNT1":"375391","ESPORTSTMNT02":"200002394","TRLH3":"200000283","TRLH4":"200000481"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":341,"slug":"kikis","name":"Kikis","firstName":"Mateusz","lastName":"Szkudlarek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kikis-9px5rew4.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-06-20T13:17:06.000Z","bios":{"en_US":"<p>\nMateusz “Kikis” Szkudlarek launched his esports career in 2012 with MeetYourMakers. Kikis spent several years battling it out in the EU Challenger scene before breaking into the EU LCS in 2015 with the Unicorns of Love. He later moved to G2 Esports, helping them to qualify for the EU LCS while also moving out of the jungle and into the top lane.\n</p>\n<p>\nKikis acclimated quickly to the top lane as G2 consistently unraveled opponents leading to a 1st place finish in the 2016 EU LCS Spring Split. After parting ways with G2, Kikis found his way to another top European team: Fnatic. The burden of high expectations lies squarely on Kikis’ shoulders -- but that’s something that he (and his scarves) are used to.\n</p>","de_DE":"<p>Der erste Gedanke, der dabei vermutlich gerade durch den Kopf geht ist „Moment einmal, ist der nicht Jungler?“. </p>\n\n<p>Naja, er war es schließlich vor nicht allzu langer Zeit einmal. Heute ist Mateusz „Kikis“ Szkudlarek, wie ihr schon richtig gelesen habt, der Top-Laner bei G2 Esports. Doch wusstet ihr auch, dass Kikis Karriere eigentlich als Top-Laner begann? Wirklich bekannt wurde der Pole erst mit seinem Durchbruch in die EU LCS mit Unicorns of Love, als er mit seinen Teamkameraden sich durch die EU Challenger Series für die europäische Erstliga qualifizierte. Sein Weg begann jedoch schon weit in der Vergangenheit, nämlich zum Zeitpunkt, als League of Legends gerade in die erste Saison der kompetitiven Szene startete. 2011 schafften Kikis und seine Mannschaft exGameburg Team sich einen Platz in seinem ersten internationalen Turnier, die 2011 World Cyber Games, zu ergattern. Gastgeber war das prestigeträchtige Najin e-mFire, welches durch die Hand des europäischen Teams fiel. Kikis Team schlug ebenso die nordamerikanische Mannschaft Counter Logic Gaming und schaffte es bis ins Finale gegen Chicks Dig ELO, ein Team bestehend aus einer Mischung aus späteren Team SoloMid- und Counter Logic Gaming-Spielern.</p>\n\n<p>Nach der Silbermedaille schlug sich der stilhafte Schal-Connaisseur für drei Jahre durch verschiedene Mannschaften, darunter auch namhafte Organisationen wie MeetYourMakers, mousesports und Team ROCCAT. Als Teil von EloHell spielte er in der regionalen KO-Phase Europas der zweiten Saison, schied allerdings bereits im Vierteilfinale aus. Ende 2013 wechselte Kikis in die Jungle-Rolle und begann für einige Mannschaften der EU CS zu spielen, in der Hoffnung eines Tages den Schritt nach ganz oben zu schaffen. </p>\n\n<p>Mit UOL kam der Durchbruch und auch der massive Strom an Fans, vor allem durch die verrückten Champions, die Kikis in den wichtigsten Spielen seiner Mannschaft auspackte. Mal war es Udyr und ein anderes Mal Gnar, beides Champions, welche wohl kein anderer Jungler der Welt sich trauen würde anzufassen. Besonders nicht im Halbfinale der EU LCS Spring 2015. Da fragt man sich, wie viel Vertrauen seiner Mannschaft sich Kikis verdient haben muss und wie viel Mut man braucht, um eine solche Aktion durchzuziehen. </p>\n\n<p>Im Laufe der folgenden Sommersaison entschied sich der Pole wegen seiner mangelhaften Leistung die Mannschaft zu verlassen und es mit einem Neuanfang bei Gamers2 zu versuchen. Der Wechsel auf die Top-Lane fand schließlich nach einer erfolgreichen Qualifikation für die Rückkehr in die LCS statt, als er seine neuen Jungler Kang-yoon „Trick“ Kim willkommen hieß. </p>\n","fr_FR":"<p>S’il existait un concours du joueur à avoir parcouru le plus d’équipes dans sa carrière, Mateusz « Kikis » Szkudlarek en serait sûrement le grand favori. Le Polonais a déjà porté les couleurs de plus de 20 équipes en 5 années, tantôt en toplane, tantôt en jungle et parfois même en midlane. Alors qu’il n’a que 15 ans, Kikis commence la compétition et participe à des dizaines de tournois. Les résultats sont parfois au rendez-vous, comme quand il envoie au tapis une équipe coréenne en 2011 et obtient la 2e place du tournoi international World Cyber Game ou quand il remporte la Gamers Assembly 2012 face à des équipes européennes comme Counter Logic Gaming Europe.</p>\n\n<p>En 2014, Kikis participe à la première édition des Challenger Series de printemps, mais son équipe Pulse Esports est rapidement éliminée. La seconde édition est davantage un succès. Avec Denial eSports, le Polonais parvient à accrocher la 3e place des play-offs et décroche ainsi son ticket pour le tournoi de promotion. Malheureusement, le joueur et son équipe s’inclinent face à l’équipe sortante, Copenhagen Wolves et échouent à la porte des League of Legends Championship Series. </p>\n\n<p>La saison estivale des Challengers Series de Kikis suit le même schéma : élimination précoce lors de la première édition, accès au tournoi de promotion avec SK Gaming Prime — une équipe différente — lors de la seconde puis échec face à l’équipe issue des LCS, cette fois-ci Gambit Gaming. Finalement, Kikis rejoint une équipe qui, elle, est parvenue à se qualifier aux LCS : Unicorns of Love.</p>\n\n<p>C’est dans cette structure que Kikis connaît ses plus grands succès. Aussitôt arrivé dans le club très fermé des licornes capables de tenir une souris, aussitôt il dispute une compétition internationale : les Intel Extreme Masters San Jose. Le Polonais, dans tout son art, innove comme personne. Face à Team SoloMid, il invoque Twisted Fate jungle et se saisi de l’enchantement Dévoreur, avec lequel il connaît un grand succès et marque les esprits. UoL parvient finalement à se hisser en finale, où l’équipe s’incline face à Cloud9. En LCS, Kikis se montre au niveau et tient tête aux meilleurs. Son équipe se hisse à la très correcte 5e place de la saison régulière. Aux play-offs, il étonne à nouveau en jouant un Shaco très convainquant face à Gambit Gaming. En demi-finale face à SK Gaming, le premier de la saison régulière, il sélectionne Gnar jungle et participe à la victoire de son équipe. La belle aventure se termine sur une finale très serrée dont Fnatic est le seul vainqueur. </p>\n\n<p>Avant la fin de la saison régulière d’été, Kikis quitte Unicorns of Love et rejoint Gamers2. Il aide l’équipe à se hisser à la 3e place des Challengers Series puis contribue à la qualifier aux LCS en s’imposant face à SK Gaming. Depuis, le joueur a cédé sa place de jungler et est retourné à ses premiers amours : la voie du haut.</p>\n","es_ES":"<p>Mateusz “Kikis” Szkudlarek comenzó su carrera de esports el año 2012 junto a MeetYourMakers. Kikis pasó varios años junto a los jugadores europeos de nivel Aspirante hasta que por fin se abrió paso a la LCS en 2015 con los Unicorns of Love. Sus actuaciones con Nidalee y Nunu son dominantes, y el marcador de juego con sus junglas preferidos en el split de primavera ha sido de 6V-2D. Como homenaje al estilo poco ortodoxo de UOL, incluso se atrevió con Shaco una vez a pesar de que muchos consideran que el campeón no es jugable actualmente.</p>\n<p>Kikis pasó de UOL a G2 Esports en 2015, y su debut para el equipo ayudó a G2 a clasificarse para la LCS EU. Este 2016, Kikis ha pasado de la jungla a la calle superior de G2. Solo hay una explicación: ha llegado el momento de desatar el poder de Shaco en la calle superior (o eso esperamos).</p>","pl_PL":"<p>Mateusz bezsprzecznie należy do grona najpopularniejszych polskich zawodników. Równolegle wybija się zdolnościami wśród innych graczy na arenie międzynarodowej. Mało kto może się pochwalić taką wprawą jak „Kikis” na profesjonalnej scenie, gdyż jest jej częścią od początku pierwszego sezonu. Do tego przyczyniło się członkostwo w ponad 20 różnych, bardziej lub mniej znanych, drużynach. Takie doświadczenie, zyskane podczas wspólnej gry z graczami z całej Europy, jest unikatowe na skalę światową. </p>\n<p>Podczas swojej długiej kariery w League of Legends „Kikis” zgromadził mnóstwo imponujących trofeów. Pierwszym znaczącym sukcesem było drugie miejsce na Samsung Euro Championship 2011. Wyjątkowość tego wydarzenia polegała na pokonaniu zespołów reprezentujących Kanadę i Koreę – Counter Logic Gaming i Najin e-mFire. Dla polskiej reprezentacji i Mateusza to był debiut w rozgrywkach na najwyższym poziomie. Po doskonałym starcie do sezonu czwartego „Kikis” brał udział w gigantycznej ilości wydarzeń różnej rangi – od regionalnych turniejów po światowe imprezy jak IEM w San Jose. W międzyczasie cały czas próbował swoich sił w Challenger Series grając w rozmaitych zespołach, jak na przykład: Denial eSports i Lublin Shore. Niestety przeważnie kończył na czwartym miejscu, bez możliwości walki o wejście do kolejnego etapu. Kwalifikacja do turnieju promocyjnego udała mu się dopiero w szeregach SK Gaming Prime, lecz na jego drodze do EU LCS stanął legendarny już zespół Gambit Gaming. „Kikis” poniósł porażkę w starciu z potęgą czerwonej gwiazdy, lecz ostatecznie i tak zagrał w wiosennym sezonie EU LCS 2015. Szansę na pokazanie się zawdzięcza ofercie of Unicorns Of Love, która przyjęła go do głównego składu z szeroko rozłożonymi ramionami. Ten okres przyniósł wiele sukcesów Mateuszowi. W grudniu 2014 roku zajął drugie miejsce na wielkim wydarzeniu – IEM w San Jose, ulegając tylko Cloud9. Natomiast w wiosennym sezonie zespół UOL zajął piąte miejsce, lecz podczas rozgrywek barażowych pokazał pazur. „Kikis” i jego ekipa pokonali Gambit Gaming i zajmujący pierwsze miejsce SK Gaming. Zostali pokonani dopiero w finale w bardzo wyrównanej batalii przeciwko Fnatic z wynikiem 3:2.</p>\n<p>„Kikis” gra profesjonalnie zarówno w jungli jak i na top-lanie, w zależności od potrzeb swojego zespołu. Uwielbia grać Lee Sinem, Shenem i Elise, lecz potrafi pozytywnie zaskoczyć widzów każdym bohaterem. Najgłośniejszym zagraniem Mateusza był doskonały gank Udyrem na drugim poziomie w meczu przeciwko Gambit Gaming podczas wiosennych rozgrywek barażowych. Większość analityków jest zgodna, że „Kikis” to gracz absolutnie nieszablonowy, co jest jego największą zaletą. Tymczasem fani kochają go za prostolinijność, ponieważ nigdy nie wstydził się mówić, tego co naprawdę czuje. Dlatego posiada szczerze oddane grono wielbicieli, którzy podążają za nim, kiedy przenosi się do kolejnych zespołów.</p>\n","es_AR":"<p>Mateusz 'Kikis' Szkudlarek comenzó su carrera en los Esports en 2012 con MeetYourMakers. Kikis pasó varios años peleando en la escena del Challenger de la UE antes de iniciarse en la LCS de la UE en 2015 con los Unicorns of Love. Es mejor conocido por sus actuaciones dominantes usando a Nidalee y Nunu, sus jungleros favoritos, y por mantener un récord de 6 ganados contra 2 perdidos durante el curso del Torneo de Primavera de 2015 de la LCS de la UE. Y en una ocasión, con un estilo poco convencional para UOL, llegó a usar a Shaco; un campeón que muchos consideran injugable en competencias profesionales.</p>\n\n<p>Kikis pasó de UOL a G2 eSports en 2015 y, su debut en el equipo, les permitió calificar para la LCS de la UE. Kikis realizó otro movimiento en 2016, al salir de la jungla para entrar al carril superior de G2. Solo puede haber una explicación para esto: es la hora del terror Iluminati del carril superior conocido como Shaco el Muñeco Sorpresa (eso esperamos).</p>"},"foreignIds":{"drupalId":"1469","TRLH3":"200000263","TRLH4":"200000315","TRLT3":"35063","TRLH2":"1001250015","FRA1TMNT2":"25428"},"socialNetworks":{"twitch":"www.twitch.tv/kikis1205","facebook":"www.facebook.com/MSkikis","twitter":"https://twitter.com/kikis1205"},"champions":[],"liveGameTeam":294},{"id":391,"slug":"noxiak","name":"Noxiak","firstName":"Lewis","lastName":"Felix","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/noxiak-frezw2pt.png","hometown":"Germany","region":"Turkey Championship League","birthdate":null,"createdAt":"2015-03-04T00:45:00.000Z","updatedAt":"2017-08-17T17:21:09.000Z","bios":{"en_US":"<p>Lewis \"Noxiak\" Felix has dabbled in the EU LCS for some time, but when he signed with Fnatic headed into the 2016 EU LCS Spring Split he made a commitment to greatness. After a stay with Fnatic, Noxiak moved to ROCCAT in the middle of the 2016 EU LCS Spring Split. </p>\n\n<p>Noxiak's new team will need him to do more than just secure kills for his AD carry partner. He will need to control the map, control the speed of the game, and control the emotions of his teammates. It won't be easy, but achieving greatness rarely is.</p>","de_DE":"<p>Felix „NoXiAK“ Lewis gehört zu einen der wenigen deutschen Profis der Szene. Mit stattlichen 196 Zentimeter ist er mit seiner Größe auf Augenhöhe mit Kontrahenten Jesper „Niels“ Svenningsen und ragt so über die meisten anderen Spieler.<p>\n\n<p><h2> Das schwere Los der Challenger Series</p></h2>\n\n<p>Seit 2014 ist der gutmütige Riese von Team zu Team gesprungen, meist in der EU Challenger Series oder hat kurz die Luft der EU LCS geschnuppert, als er für kurze Zeit für Meet Your Makers einsprang. Zuvor versuchte er sein Glück noch mit dem Challengerteam von seinem heutigen Team Fnatic, jedoch sollte es noch nicht wirklich klappen. In der Einzelrangliste hält sich NoXiAK stets in den Rängen ganz oben, wo die Besten der Besten um den ersten Platz ringen. Er ist immer beim Rennen um die Krone mit dabei und ist daher für viele Mannschaften ein gefragter Supportspieler. <p>\n\n<p>Zu seinen Lieblingschampions zählen Janna, Morgana, Nami und Braum, also allesamt Champions, welche sich damit auszeichnen ihr Team zu beschützen. Jedoch hat er diese zu dem Grad gemeistert, dass er ihre Fähigkeiten auch dazu benutzen kann, einen aggressiveren Spielstil an den Tag zu legen und dadurch seinem Schützen an seiner Seite mehr Spielraum zu verschaffen. <p>\n<p><h2>In den Fußstapfen von YellOwStaR</p></h2>\n\n<p>Mit Fnatic schloss der Geschichtsstudent Ende 2015 einen Vertrag in der Hoffnung, endlich eine permanente Bleibe zu finden. Das Zimmer, welches sein Vorgänger hinterließ, ist jedoch nichts anderes als die Steuerzentrale der Mannschaft. Bora „YellOwStar“ Kim verließ seinen Posten als Kapitän nach der erfolgreichen Weltmeisterschaft 2015 und machte Platz für Neues. Als Frischfleisch muss NoXiAK nun zusehen, dass er das Loch füllen kann, aber er macht dies nicht alleine. Mit Fabian „Febiven“ Diepstraten und Martin „Rekkles“ Larsson, sowie auch Da-yoon „Spirit“ Lee hat er erfahrene Veteranen, welche ihm unter die Arme greifen und einen Trittstufe seiner kommenden Karriere bilden. Außerdem gilt er als einer der neuen Supporthoffnungen Europas, weshalb kaum Zweifel besteht, dass er seiner Aufgabe und seines Rufes innerhalb kurzer Zeit auf der Bühne der EU LCS gerecht wird und die restlichen Kritiker wie im Nu verstummen lässt.</p>","pl_PL":"<p>Wyjątkowo wysoki, mierzący aż 196cm, Niemiec to stosunkowo nowy dodatek do sceny esportowej. Do swojej pierwszej profesjonalnej drużyny, Planetkey Dynamics, dołączył w sierpniu 2014 roku. Szybko, bo tylko po miesiącu, zdecydował się na odejście i zasilenie szeregów ESC Gaming. W niemieckiej organizacji też nie pozostał na długo – opuścił ją już w grudniu 2014 roku. \"NoXiAK\" w społeczeństwie League of Legends zasłynął substytucją supportów na turniejach i w rozgrywkach LCS. Największym osiągnięciem, było zastępstwo zawodnika Dumbledoge z drużyny Aces High Esports Club na czwartej edycji 9 sezonu IEM w Kolonii. Wraz z tym tureckim zespołem wygrał jeden mecz z Team Dignitas, zaskakując całą publikę. Po części było to zasługą świetnej gry Lewisa jego ulubioną bohaterką – Janną, dzięki której stał się zauważalny wśród profesjonalnych zawodników. Poza nią ubóstwia Morganę, Nami i Brauma, czyli jest supportem z zamiłowania. \"NoXiAK\" dzięki umiejętnemu wspieraniu swoich AD Carrych dotarł aż do Kręgu Pretendenta w Europie.</p>\n<p>Miał okazję być surogatem w powszechnie znanych zespołach, jak np. SK Gaming, MeetYourMakers i Giants Gaming, więc zdobył doświadczenie w grze na najwyższym poziomie. \"NoXiAK\"  wyznał, że kiedy nie brał udziału w żadnych rozgrywkach LCS to tęsknił za uczuciami związanymi z występami, ale zawsze go to motywowało do pracy nad umiejętnościami. Lewis kocha tłum podczas pojedynków w studia, lecz podczas meczu wycisza się i skupia tylko i wyłącznie na grze. Zaznaczył, że czuje się wtedy jakby grał we własnym domu. Zawsze pragnął mieć stałe miejsce w profesjonalnej drużynie. Wiosną sezonu 6  marzenie Lewisa się spełniło, gdyż dostał miejsce supporta w pierwszym składzie w szeregach znanej europejskiej drużyny – Fnatic.</p>\n","fr_FR":"<p>Lewis « Noxiak » Felix traîne du côté des LCS EU depuis un petit moment déjà, mais ce n'est qu'en signant chez Fnatic pour le segment printanier des LCS EU 2016 qu'il est entré de plein pied dans la cour des grands. Après tout, Fnatic est l'une des organisations d'e-sport les plus réputées et sa formation actuelle comprend certains des meilleurs joueurs du moment. </p>\n<p>La pression sera certainement colossale sur les épaules de Noxiak. Non seulement il a rejoint une organisation de premier plan, mais c'est à lui de combler le trou laissé par l'un des meilleurs supports occidentaux : Bora « YellOwStaR » Kim. Pour prouver sa valeur, Noxiak ne devra pas se contenter d'aider Rekkles à abattre ses cibles et poser des balises. Il faudra qu'il contrôle la carte, qu'il contrôle le rythme de la partie et qu'il contrôle les émotions de ses équipiers. Ça ne sera pas simple, mais on n'atteint pas les sommets sans efforts.</p>","es_ES":"<p>Si hay un jugador en el nuevo equipo de Fnatic que despierta todas las dudas de los aficionados, ese es Lewis ‘Noxiak’ Felix. Un gran amante de la historia, tendrá que escribir la suya tras un breve historial competitivo que sólo se remonta hasta Agosto de 2014, a pesar de sus 21 años. Un jugador que, en palabras del actual entrenador Luis ‘Deilor’ Sevilla, tiene potencial para ser el shotcaller dentro del equipo.</p>\n\n<p>Noxiak no es un jugador totalmente desconocido para Fnatic como organización. A principios de 2015 después de aparecer con Aces High Esports Club y pasar por varios equipos, fichó por Fnatic Academy en el segundo intento de su formación. El primero fue curiosamente con Martin ‘Rekkles’ Larsson, su actual compañero en la línea inferior. El intento no duraría más de 3 meses.</p>\n\n<p>El jugador, sin embargo, ya había mostrado su actuación al público y Meet Your Makers contactó con él en la época de declive para intentar salvar la situación y no descender a la Challenger Series. Aunque no consiguieron su objetivo, sus actuaciones con Leona y Braum permitieron que Ex Nihilo contactara con él. Un equipo con aspiraciones muy altas pero que nunca acabó de arrancar y se mantuvo toda la temporada en baja tabla.</p>\n\n<p>De nuevo fue llamado por un equipo para evitar su debacle, SK Gaming. Sin embargo, la historia se repite y a pesar de su buena actuación con Alistar no fue capaz de salvar al equipo del descenso contra Gamers2. Su actuación fue de las mejores del conjunto, pero a excepción de Ex Nihilo todavía no se sabe su posible rendimiento en un proyecto de principio a fin.</p>\n\n<p>Aunque su participación en la reciente IEM de Colonia ha presentado altibajos, desde el conjunto inglés esperan que su nivel esté tan alto como su altura. Muchas facetas de su juego como su toma de decisiones a la hora de entrar en una batalla grupal y su visión tendrán que mejorar, puesto que no es fácil reemplazar a Bora ‘YellOwStaR’ Kim.</p>"},"foreignIds":{"drupalId":"3905","TRLH3":"1001220013","TRLH4":"1001190063","FRA1TMNT1":"455025","TRNA1":"1000435036","TREU":"1000565101","ESPORTSTMNT03":"200001284","ESPORTSTMNT02":"200002458"},"socialNetworks":{"twitter":"https://twitter.com/noxiaklol"},"champions":[],"liveGameTeam":293},{"id":414,"slug":"nardeus","name":"Nardeus","firstName":"Tomáš","lastName":"Maršálek","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nardeus-cdcxp0w2.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-06-18T19:18:31.000Z","bios":{"en_US":"<p><span>Tomáš \"Nardeus\" Maršálek has been playing League of Legends professionally since 2012 when he joined eSuba, a popular Czech Republic esports organization. After improving his skills in the EU Challenger Series for several years, Nardeus was picked up by Turkish team Aces High Esports Club. Aces were soon acquired by Beşiktaş e-Sports Club, known as the Black Eagles. Nardeus was instrumental in Beşiktaş’ dominant performance at the 2015 TLC Winter Playoffs and the 2015 International Wild Card Invitational, leading his squad to 1st place finishes in both events.</span></p>"},"foreignIds":{"drupalId":"1493","TRLH1":"1001100040","TRLH2":"1001080040","FRA1TMNT1":"375328","TRNA1":"1000435369","ESPORTSTMNT02":"200002457"},"socialNetworks":{},"champions":[],"liveGameTeam":293},{"id":484,"slug":"promisq","name":"sprattel","firstName":"Hampus","lastName":"Abrahamsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/promisq-2wryxfa8.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-05-15T18:29:25.000Z","updatedAt":"2017-06-09T11:01:09.000Z","bios":{"en_US":"<p>\nHampus “sprattel” Abrahamsson (formerly PromisQ) is a relatively new player in the EU esports scene. He joined Elements in 2015 as their starting support, taking the place of Nyph. However, Sprattel's launch into the spotlight of professional esports didn't come without its missteps. He struggled in the 2015 EU LCS Summer Split and was swapped with substitute support Nyph after the fourth week of competition.\n</p>\n<p>\nThe 2016 EU LCS Spring Split didn’t go much better as he struggled to find rhythm with his bot lane partner, MrRallez. In May, Elements’ seed was acquired by FC Schalke 04, and sprattel was kept on as the team’s starting support. Sprattel will try to right the ship on Ninjas in Pyjamas' new roster this summer.\n</p>","fr_FR":"<p>Hampus « PromisQ » Abrahamsson est relativement nouveau sur la scène e-sport européenne. Il a rejoint Elements en 2015 pour y assumer le rôle de support titulaire à la place de Nyph. Les premiers pas de PromisQ sur la scène professionnelle ne se sont cependant pas très bien passés. Il a rencontré des difficultés lors du segment d'été des LCS EU 2015 et a dû se faire remplacer par Nyph dès la quatrième semaine de la compétition.</p>\n<p>PromisQ a de nouveau retrouvé son poste de support titulaire pour le segment printanier des LCS EU 2016, mais il lui reste encore à prouver qu'il a le talent nécessaire pour être un vrai titulaire aux LCS.</p>","es_ES":"<p>Hampus 'PromisQ' Abrahamsson es un jugador relativamente conocido en la escena europea de League of Legends. Se unió a Elements en 2015 como su apoyo titular, tomando el relevo de Nyph en lo que era su debut como profesional. Pero la cosa no resultó como esperaba y fue sustituido después de cuatro semanas de competición por el mismo Nyph, debido a su pobre rendimiento.</p>\n<p>Sin embargo PromisQ ha vuelto para ser el apoyo titular de Elements en el Spring de Primavera de la LCS EU 2016, ya no es un novato, pero tiene que demostrar que tiene lo que hay que tener para ser un jugador a tener en cuenta en la máxima competición europea.</p>","de_DE":"<p>Zuvor war Hampus \"sprattel\" Abrahamsson unter den Namen promisQ bekannt. Er entdeckte League of Legends erst in der dritten Saison für sich und erfuhr von dort an rasante Verbesserungen. Jeher als Support-Spieler kletterte er in die Top 100 und wurde nach einem kurzen Aufenthalt in einem Amateurteam von Elements unter Vertrag genommen. </p>\n<h2><p>Eine schwere Aufgabe</p></h2>\n<p>Als sprattel im Sommer 2015 in das Kader von Elements aufgenommen wurde, war die Überraschung groß. Genauso groß waren damals die Fußstapfen, in die der LCS-Neuling stapfen musste. Sowohl Patrick \"Nyph\" Funke, als auch Mitch \"Krepo\" Voorspoels sind nicht nur in der Community beliebt, sondern haben vielerorts ihr Können unter Beweis gestellt. Wo Krepo resignierte, sollte das neue Gesicht einen Aufschwung bringen, der kaum noch zu schaffen war. Nach gerade einmal acht Spielen war das Erlebnis LCS schon wieder beendet. In den wenigen Spielen war es vor allem Alistar, mit dem er spielerisch überzeugte und dem Team zu seinen zwei einzigen Siegen während seines Aufenthalts verhalf. </p>\n<p>Die negative Statistik soll aber in keinem Fall damit gleichzusetzen sein, dass der Schwede es nicht verdient hätte, in der LCS zu spielen. Die Organisation glaubt fest an den noch unerfahrenen Spieler. Warum denn auch nicht, viele Teams haben in der Vergangenheit bereits unter Beweis gestellt, was aus anfangs so unbekannten Namen werden kann. Mit Nyph, einem der erfahrensten Supportern Europas, als Coach an seiner Seite kann sich der noch ungeschliffene Diamant nun mit neuem Kader unter Beweis stellen. Dieses Mal nicht inmitten eines Splits, sondern vorbereitet und mit hoch motivierten Kollegen.</p>\n","pl_PL":"<p>Hampus jest wielkim odkryciem Elements. Przed dołączeniem do tej organizacji był członkiem tylko jednej drużyny, inFerno eSports, od marca do maja 2015 roku. Wtedy zmienił barwy na tęczowe i został głównym supportem „żywiołów”. O dołączenie do tego zespołu został poproszony przez głównego trenera - Patricka \"Nyph\" Funke’a. W wywiadzie dla Aftonbladet Esport przypomniał sobie, że kiedy dostał od niego zaproszenie do znajomych w grze, aż poczuł motyle w brzuchu. Powiedział, że uznał to za swoją życiową szansę i zgodził się na tą propozycję. </p>\n<p>Niestety projekt okazał się zdecydowanie mniejszym sukcesem niż się spodziewano. W efekcie czego największe zespołowe osiągnięcia \"Sprattel’a\" nie robią wrażenia. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 uplasował się dopiero na 7 miejscu z wynikiem 7:11. Biorąc pod uwagę ekskluzywność tych rozgrywek, trzeba to uznać za niemały wyczyn. Jednak bardziej imponujący jest efekt jego gry w solo que. W League of Legends gra od 2013 roku, ciągle supportem. Zajmując tą rolę w 3 sezonie udało mu się zdobyć diamentową rangę, a w kolejnych był już w Kręgu Pretendenta, gdzie zdobył aż 800 punktów LP.</p>\n<p>Z całej drużyny, po niezbyt udanym sezonie piątym, pozostał tylko \"Sprattel\". Podczas wywiadów cechowała go rozmowność, pewnie dlatego, że chciał przekazać swoim fanom jak najwięcej o sobie. Tuż przed pokazaniem się w rozgrywkach EU LCS wyraził swoją radość, z tego że będzie mógł się zmierzyć z najlepszymi graczami w Europie. Wielokrotnie wspominał, że konkurowanie z innymi jest dla niego najważniejsze w League of Legends. To właśnie chęć starcia się ze sławami doprowadziła Hampusa tak wysoko. O dziwo jako support jest dużo bardziej skoncentrowany na wspieraniu swojego AD Carry’ego - dlatego chętnie gra Janną, Nami i Morganą.</p>\n"},"foreignIds":{"drupalId":"4329","TRLH3":"200000259","TRLH4":"200000311","TRLH2":"1001250005","FRA1TMNT2":"25420","ESPORTSTMNT02":"200001029"},"socialNetworks":{"twitter":"https://twitter.com/SPRATTEL_lol"},"champions":[],"liveGameTeam":293},{"id":665,"slug":"satorius","name":"Satorius","firstName":"Max","lastName":"Günther","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/satorius-5k4ftsgq.png","hometown":null,"region":"EU LCS","birthdate":"1994-04-12","createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-19T16:32:22.000Z","bios":{"en_US":"<p>\nMax \"Satorius\" Günther is a long-time veteran of the European Challenger scene. He has spent years in the Challenger circuit, and when xPeke needed to rebuild Origen from the ground up Satorius was a natural choice for the Spanish star. Satorius has shown mastery on everything from Maokai to Gangplank. After being in the Challenger scene for so long, it will be an interesting first foray into the LCS as a part of a completely overhauled Origen. Building a new team from scratch is a daunting task, almost as daunting as the first steps Satorius will take onto the stage as a LCS pro.</p>","fr_FR":"<p>Satorius est un joueur allemand, nouvelle recrue du Melty e-Sport Club habitué au haut niveau. Il a en effet participé plusieurs fois aux qualifications des Challenger Series avec l'équipe Inspire où il a pu emmagasiner un maximum d'expérience. Il entend bien remporter le titre de champion de France avec Melty et ainsi pouvoir atteindre à nouveau le niveau européen.</p>","es_AR":"","de_DE":"<p>Max „Satorius“ Günther ist ein langjähriger Veteran der europäischen Challenger-Szene. Er hat viele Jahre in der Challenger Series verbracht und als xPeke mit Origen komplett neu beginnen musste, stand er ganz oben auf der Wunschliste des Spaniers. Satorius hat gezeigt, dass er alle Champions von Maokai bis Gangplank beherrscht. Nachdem er so lange in der Herausforderer-Szene war, wird es für ihn als Teil von Origen mit einer komplett überarbeiteten Mannschaft bestimmt ein interessanter Ausflug in die LCS. Eine neue Mannschaft von Grund auf aufzubauen, ist eine beängstigende Aufgabe, fast so beängstigend wie die ersten Schritte auf die Bühne der LCS für Satorius.</p>"},"foreignIds":{"drupalId":"4546","TRLH4":"200000190","TRLH3":"200000087"},"socialNetworks":{"twitter":"http://twitter.com/satoriuslol"},"champions":[],"liveGameTeam":293},{"id":760,"slug":"pilot","name":"Pilot","firstName":"Woo-hyung","lastName":"Nah","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pilot-6k4dxfwy.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-03-26T09:37:43.000Z","bios":{"en_US":"<p>\nWoo-hyung “Pilot” Nah is one of the most defensive minded AD carries in the LCK. His playstyle is a perfect fit for Jin Air Green Wings who frequently rely on superior positioning to poke down their opponents instead of engaging in all-out team fights. However, just because Pilot plays safe doesn’t mean he isn’t involved. He scored a respectable 5.1 KDA on Sivir and 4.6 KDA on Corki, his two most played champions in the 2015 LCK Summer Split.\n</p>","fr_FR":"<p>\nWoo-hyung “Pilot” Nah est probablement l'un des AD Carrys les plus défensifs des LCK. Son style de jeu convient parfaitement aux stratégies de Jin Air Green Wings qui reposent souvent sur un bon positionnement et un poke destructeur plutôt que des combats d'équipes plus directs et brutaux. Toutefois, Pilot a beau jouer prudemment il n'en est pas pour autant passif. Il a enregistré un KDA tout à fait respectable de 5,1 sur Sivir et de 4,6 sur Corki, ses deux champions de prédilection au cours du Segment d'été 2015 des LCK. \n</p>","pl_PL":"<p>\nWoo-hyung “Pilot” Nah to jeden z najbardziej zachowawczych prowadzących w LCK. Jego styl gry świetnie sprawdza się w Jin Air Green Wings, drużynie, która ceni sobie nękanie przeciwników z dogodnej pozycji nad otwarte starcia. Jednak to, że Pilot gra ostrożnie nie znaczy, że się nie angażuje. Udało mu się zdobyć godny szacunku wynik KDA: 5,1 na Sivir i 4,6  ma Corkim, jego dwóch najczęściej granych bohaterach w letnim splicie LCK 2015. \n</p>"},"foreignIds":{"drupalId":"2805","TRKR1":"225138","ESPORTSTMNT02":"200001028","TRLH3":"200000258","TRLH4":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":293},{"id":808,"slug":"kirei","name":"Kirei","firstName":"Thomas","lastName":"Yuen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kirei-7v4jqd6y.png","hometown":"Hertogenbosch","region":"EU Challenger Series","birthdate":"1997-02-18","createdAt":"2015-06-30T17:27:13.000Z","updatedAt":"2017-03-26T09:36:33.000Z","bios":{"en_US":"","fr_FR":"<p>Thomas « Kirei » Yuen sera le jungler de Dignitas pour les LCS NA pendant la saison 6. Tout comme son coéquipier en voie du haut Lennart « Smittyj » Warkus, Kirei arrive tout droit des Challenger series européennes.</p>\n\n<p>Jeune joueur néerlandais, il aura 19 ans fin février, mais il est loin d’être un novice sur la scène compétitive de League of Legends. Avec les LowLandLions.White, il a participé avec succès au segment de printemps des Challenger series EU, lors desquels son équipe, dont pas grand monde n'attendait quoi que ce soit, a su décrocher la deuxième place de la saison régulière. Qualifiée dans la foulée pour la finale des play-offs, elle s’est finalement inclinée sans honte face à des Origen enfin concentrés et donc intouchables. Malheureusement pour Kirei et ses camarades de jeu, Roccat, leur adversaire lors du tournoi de relégation, s'est montré intraitable pour garder sa place en LCS et renvoyer ses adversaires à leurs études.</p>\n\n<p>Cette lourde défaite a marqué la fin de l'équipe, mais heureusement pas la fin de carrière de son jungler. Le Néerlandais a rejoint Denial Esports EU en cours de segment d'été et s'est montré plutôt convaincant au sein de sa nouvelle équipe, affichant notamment un score de 1/0/8 avec Gragas en cinquième semaine face à Mousesports. Mais une fois de plus, son talent n'a pas été suffisant pour empêcher à son équipe de finir à la 4e place des play-offs, laissant ainsi passer sa chance de se qualifier aux LCS EU. À noter que cette dernière défaite était face aux Gamers 2 de SmittyJ, son nouveau comparse.</p>\n\n<p>Malgré des résultats médiocres, Kirei a néanmoins montré qu’il savait jouer très correctement des champions capables de soutenir son équipe et qu’il possédait sans aucun doute le potentiel pour faire briller ses nouveaux comparses, SmittyJ et Apollo « Apollo » Price, à condition de tenir la cadence face aux meilleurs junglers nord-américains.</p>\n","pl_PL":"<p>\"Kirei\" doskonale orientuje się na scenie esportowej, pomimo tego, że zainteresował się nią dopiero pod koniec czwartego sezonu. Od tego momentu do listopada 2015 roku był częścią paru różnych drużyn, biorących udział w Challenger Series, jednak nie odniósł większych sukcesów. Na szczęście jego talent został dostrzeżony podczas tych rozgrywek przez przeciwników z esports Festival 2015. Po nie zakwalifikowaniu się do EU LCS wspólnie z Denial eSports EU, w listopadzie 2015 roku dostał zaproszenie do Team Dignitas. Thomas udzielił szczegółowego wywiadu tej organizacji na temat tego co czuje w związku z dołączeniem do drużyny o tak długiej historii. Głównym powodem decyzji o przeprowadzce do U.S.A. były jego perspektywy na obu kontynentach. W Europie dalej grałby w Challenger Series, a w Ameryce Północnej zagra w renomowany rozgrywkach NA LCS, więc podsumował to określeniem „wybór był prosty”. \"Kirei\" za swój cel obrał zwycięstwo w NA LCS, a następnie zdominowanie kolejnych Mistrzostw Świata. </p>\n<p>\nThomas najlepiej czuje się grając Elise w jungli. Jednak nie został wybrany przez Team Dignitas ze względu na perfekcyjne opanowanie Królowej Pająków, a doskonałą grę innym junglerami. \"Kirei\" potrafi się odnaleźć w każdej mecie, gdyż gra zarówno twardymi bohaterami jak i asasynami. W wywiadzie zaznaczył, że to nie umiejętności są problemem nowego gracza, ale wspólne doświadczenie i komunikacja z resztą drużyny. Sam uważa siebie za równego innym graczom z Ameryki, ze względu na podobny poziom tych regionów.</p>\n<p>\nPochodzący z Den Bosch, w Holandii, Thomas lubi odpowiadać na pytania swoich fanów na portalach społecznościowych. Chociaż jego rodzina pochodzi z Kantonu, w Chinach, stał się szczególnie popularny wśród Holendrów, z którymi konwersuje w ich rodzimym języku. Natomiast jeśli chodzi o obowiązki to na co dzień studiuje informatykę, w przerwach od nauki i gry w League of Legends uwielbia jeść sushi. \"Kirei\"  jest sportowcem nie tylko przed komputerem – dobrze czuje się także na boisku. \n</p>"},"foreignIds":{"drupalId":"3894","TRLH1":"1001220075","TRLH2":"1001160125","FRA1TMNT1":"455024","TRNA1":"1000525375","TREU":"1000565099","TRLH4":"200000308","ESPORTSTMNT02":"200001026","TRLH3":"200000256"},"socialNetworks":{},"champions":[],"liveGameTeam":293},{"id":1043,"slug":"blanc","name":"Blanc","firstName":"Sung-min","lastName":"Jin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blanc-4s21ia8a.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-01-06T22:13:17.000Z","updatedAt":"2017-03-26T09:35:24.000Z","bios":{},"foreignIds":{"TRKR1":"225137","ESPORTSTMNT02":"200001027","TRLH3":"200000257","TRLH4":"200000309"},"socialNetworks":{},"champions":[],"liveGameTeam":293},{"id":1159,"slug":"klaj","name":"Klaj","firstName":"Johan","lastName":"Olsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/klaj-fqwjvhur.png","hometown":"Sweden","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-02-09T19:35:21.000Z","updatedAt":"2017-03-26T09:30:10.000Z","bios":{},"foreignIds":{"TRLH3":"200000267","TRLH4":"200000319","FRA1TMNT2":"25411","ESPORTSTMNT02":"200001036"},"socialNetworks":{},"champions":[],"liveGameTeam":293},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":294},{"id":1457,"slug":"fraid","name":"Fraid","firstName":"Frédéric","lastName":"Simonet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fraid-gwz9runb.png","hometown":null,"region":"EU Challenger Series","birthdate":"1995-01-05","createdAt":"2016-10-11T13:42:26.000Z","updatedAt":"2017-06-18T19:19:51.000Z","bios":{"en_US":"","fr_FR":"<p>Fraid est le capitaine et joueur emblématique de Grosbill eSport. Fort de ses 4 années d'expérience au sein du circuit compétitif français, il a su développer son jeu pour être aujourd’hui reconnu comme l’un des meilleurs toplaner de la scène nationale. Ancien joueur pour Inovacio, Remake et KatrinaFR, il a su accumuler beaucoup d'expérience en équipe auprès de joueurs talentueux. </p>\n\n<p>Aujourd’hui, cette expérience lui permet d’être un leader inspirant et un shotcaller hors-pair pour ses alliés chez Grosbill. Craint pour son Gnar et sa Irelia, Fraid adopte un style de jeu très agressif en lane. Il aborde la compétition avec le même état d’esprit et espère jouer les trouble-fêtes.</p>"},"foreignIds":{"FRA1TMNT2":"75137","esportstmnt05":"200000947","ESPORTSTMNT02":"200002449","TRLH3":"200000260","TRLH4":"200000312"},"socialNetworks":{"twitter":"https://twitter.com/GrosBillFraid?lang=fr"},"champions":[],"liveGameTeam":293},{"id":1632,"slug":"panda","name":"Pandar","firstName":"Yannick","lastName":"Greff","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/panda-7ss7yc37.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T19:56:43.000Z","updatedAt":"2017-03-01T18:59:25.000Z","bios":{},"foreignIds":{"TRLH3":"200000061","TRLH4":"200000164"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":1770,"slug":"wolle","name":"Wolle","firstName":"Wolfgang","lastName":"Landes","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolle-hkyqnqx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-08T23:22:18.000Z","updatedAt":"2017-03-26T09:31:19.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001037","TRLH4":"200000320","TRLH3":"200000268"},"socialNetworks":{},"champions":[],"liveGameTeam":294}],"scheduleItems":[{"id":"AVqv4tdTQMQFcjhwbQws","content":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:match:f864e829-c852-4b26-aca4-dcb964f77d86","scheduledTime":"2017-03-26T14:00:00.000+0000","tags":{"blockLabel":"Finals","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:bracket:e22ee6df-0550-421c-8717-124abd2a88d6","leagueLabel":"urn:rg:lolesports:global:league:league:5","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec","subBlockPrefix":"week"},"match":"f864e829-c852-4b26-aca4-dcb964f77d86","tournament":"a4bfff7c-7594-4076-8dc4-f787d0ebcdec","bracket":"e22ee6df-0550-421c-8717-124abd2a88d6","league":"5"}],"gameIdMappings":[{"id":"86056eb9-055e-48a6-9449-048062354903","gameHash":"a21cbadf012b9580"},{"id":"76eaad43-baf7-4ca2-b344-f22e058f8bf9","gameHash":"84f9016ba9fcfe0b"},{"id":"f093fa6f-fea2-4f75-b6d7-00ff990e1dd8","gameHash":"395baa41f3a94eaf"},{"id":"4f8bc1cc-1585-4b77-b96c-8b093ced7146","gameHash":"9265d9b43b0e748a"},{"id":"22807285-cc47-4ac6-bdf5-35cbcce57f3f","gameHash":"8e1b20cce846c21f"}],"videos":[{"id":6344,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:game:22807285-cc47-4ac6-bdf5-35cbcce57f3f","source":"https://www.youtube.com/embed/aW0WELqWR2A?wmode=transparent","createdAt":"2017-03-27T01:28:25.000Z","updatedAt":"2017-03-27T01:28:25.000Z","game":"22807285-cc47-4ac6-bdf5-35cbcce57f3f"},{"id":6345,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:game:76eaad43-baf7-4ca2-b344-f22e058f8bf9","source":"https://www.youtube.com/embed/2PlZT4HtBkw?wmode=transparent","createdAt":"2017-03-27T01:22:20.000Z","updatedAt":"2017-03-27T01:22:20.000Z","game":"76eaad43-baf7-4ca2-b344-f22e058f8bf9"},{"id":6346,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:game:4f8bc1cc-1585-4b77-b96c-8b093ced7146","source":"https://www.youtube.com/embed/y2MbuKHtnOA?wmode=transparent","createdAt":"2017-03-27T01:29:28.000Z","updatedAt":"2017-03-27T01:29:28.000Z","game":"4f8bc1cc-1585-4b77-b96c-8b093ced7146"},{"id":6347,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:game:86056eb9-055e-48a6-9449-048062354903","source":"https://www.youtube.com/embed/OIsZzSH4pD0?wmode=transparent","createdAt":"2017-03-27T01:29:50.000Z","updatedAt":"2017-03-27T01:29:50.000Z","game":"86056eb9-055e-48a6-9449-048062354903"},{"id":6348,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a4bfff7c-7594-4076-8dc4-f787d0ebcdec:game:f093fa6f-fea2-4f75-b6d7-00ff990e1dd8","source":"https://www.youtube.com/embed/Von81Kpgaoc?wmode=transparent","createdAt":"2017-03-27T01:30:13.000Z","updatedAt":"2017-03-27T01:30:13.000Z","game":"f093fa6f-fea2-4f75-b6d7-00ff990e1dd8"}],"htmlBlocks":[],"match":{"id":"f864e829-c852-4b26-aca4-dcb964f77d86","name":"match-b","position":1,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1},{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],"games":{"f093fa6f-fea2-4f75-b6d7-00ff990e1dd8":{"id":"f093fa6f-fea2-4f75-b6d7-00ff990e1dd8","name":"G5","generatedName":"FNA|PSG|G5|f864e829c8524b26aca","input":[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2},{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],"standings":{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490577975436,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490556172019,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000239","gameRealm":"TRLH3","platformId":"TRLH3:1002000239","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4f8bc1cc-1585-4b77-b96c-8b093ced7146":{"id":"4f8bc1cc-1585-4b77-b96c-8b093ced7146","name":"G3","generatedName":"FNA|PSG|G3|f864e829c8524b26aca","input":[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2},{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],"standings":{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490577951214,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490547774888,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000237","gameRealm":"TRLH3","platformId":"TRLH3:1002000237","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"86056eb9-055e-48a6-9449-048062354903":{"id":"86056eb9-055e-48a6-9449-048062354903","name":"G4","generatedName":"FNA|PSG|G4|f864e829c8524b26aca","input":[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1},{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],"standings":{"result":[[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}]],"timestamp":1490577938672,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}]],"timestamp":1490550267353,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000238","gameRealm":"TRLH3","platformId":"TRLH3:1002000238","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"22807285-cc47-4ac6-bdf5-35cbcce57f3f":{"id":"22807285-cc47-4ac6-bdf5-35cbcce57f3f","name":"G1","generatedName":"FNA|PSG|G1|f864e829c8524b26aca","input":[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2},{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],"standings":{"result":[[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}]],"timestamp":1490636786615,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}]],"timestamp":1490577853881,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}],[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}]],"timestamp":1490540946145,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000218","gameRealm":"TRLH3","platformId":"TRLH3:1002000218","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"76eaad43-baf7-4ca2-b344-f22e058f8bf9":{"id":"76eaad43-baf7-4ca2-b344-f22e058f8bf9","name":"G2","generatedName":"FNA|PSG|G2|f864e829c8524b26aca","input":[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2},{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],"standings":{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490577914614,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":1}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2","breakpoint":"f77908ec-6460-4d8e-8ad8-7d1984fa338d","standing":2}]],"timestamp":1490544777982,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000236","gameRealm":"TRLH3","platformId":"TRLH3:1002000236","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490636786615,"source":"bestOf","history":[{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490577975437,"source":"bestOf","closed":true},{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490577938672,"source":"bestOf","closed":true},{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490577951214,"source":"bestOf","closed":true},{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490577914614,"source":"bestOf","closed":true},{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490577853882,"source":"bestOf","closed":true},{"result":[[{"roster":"3ecdb1a6-f256-4bf7-b1a5-3b410d4addf7"}],[{"roster":"e6a74f2a-8895-4bf8-87e4-5fbe04c58ca2"}]],"timestamp":1490556172022,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}