{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11}],"scheduleItems":[{"id":"AVcfjjnEoUG4HPFjOKCw","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:fb582b38-2c46-452c-8118-ab906b22b052","scheduledTime":"2016-10-01T01:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"2","subBlockLabel":"Sub Block 2","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:4e593494-40f1-42de-8ffd-982c93cfe083"},"match":"fb582b38-2c46-452c-8118-ab906b22b052","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"4e593494-40f1-42de-8ffd-982c93cfe083","league":"9"}],"gameIdMappings":[{"id":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","gameHash":"ca9126366742e942"}],"videos":[{"id":4507,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","source":"https://www.youtube.com/embed/MFKZ_mVoKkg","createdAt":"2016-10-01T03:30:10.000Z","updatedAt":"2016-10-01T03:30:10.000Z","game":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a"},{"id":4508,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","source":"https://www.youtube.com/embed/bRkMhoM-UEM?wmode=transparent","createdAt":"2016-10-01T03:59:54.000Z","updatedAt":"2016-10-01T03:59:54.000Z","game":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a"},{"id":4517,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","source":"https://www.youtube.com/embed/RAAV1q9Vyxg","createdAt":"2016-10-01T10:11:14.000Z","updatedAt":"2016-10-01T10:11:14.000Z","game":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a"},{"id":4559,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","source":"https://www.youtube.com/watch?v=W225vkxtKeQ&wmode=transparent","createdAt":"2016-10-03T12:43:34.000Z","updatedAt":"2016-10-03T12:43:34.000Z","game":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a"}],"htmlBlocks":[],"match":{"id":"fb582b38-2c46-452c-8118-ab906b22b052","name":"TSM-vs-SSG","position":1,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"},{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],"games":{"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a":{"id":"acadf0c2-84da-4b1c-9eb4-d61d2bdbf58a","name":"G1","generatedName":"SSG|TSM|G1|fb582b382c46452c811","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"},{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],"standings":{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475498564854,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475316626508,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475294404737,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475292562560,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475288314085,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475288279868,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001890263","gameRealm":"TRLH1","platformId":"TRLH1:1001890263","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475498564854,"source":"bestOf","history":[{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475316626509,"source":"bestOf","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475294404737,"source":"bestOf","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475292562561,"source":"bestOf","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475288314085,"source":"bestOf","closed":true},{"result":[[{"roster":"e13c446d-c428-4934-8fc9-23515e7eb6a2"}],[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}]],"timestamp":1475288279869,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a5f0e4f9-6383-413a-a394-a289b78c9dc9":0,"e13c446d-c428-4934-8fc9-23515e7eb6a2":1}}}