{"teams":[{"id":2,"slug":"bangkok-titans","name":"Bangkok Titans","guid":"be6c63c3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/sites/default/files/BKT_GPL.TMPROFILE_0.png","logoUrl":"http://assets.lolesports.com/team/bangkok-titans-597g0x1v.png","acronym":"BKT","homeLeague":"urn:rg:lolesports:global:league:league:1","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-03-02T21:45:03.000Z","bios":{"en_US":"The Bangkok Titans are the undisputed champions of Thailand’s League of Legends esports scene. They achieved six consecutive 1st place finishes in the Thailand Pro League from 2014 to 2015. However, they aren’t content with just domestic domination. The Titans have built on their foundation of success at home, climbing to 1st place finishes in both the 2015 GPL Summer and 2015 International Wildcard Tournament Turkey.\n</p>","fr_FR":"Bangkok Titans sont les champions incontestés de la scène e-sportive thaïlandaise. Ils ont obtenu six 1re place en Thailand Pro League entre 2014 et 2015. Mais la concurrence nationale ne leur suffit pas. Les Titans ont terminé premier lors du Segment d'été de la GPL 2015 et de l'International Wildcard 2015 en Turquie.","pl_PL":"Bangkok Titans to niekwestionowany mistrz tajlandzkiej sceny E-sportowej League of Legends. Osiągnęło sześć 1. miejsc z rzędu w Thailand Pro League od roku 2014 do 2015. Jednakże dominacja w kraju to za mało. Titans wykorzystali sukces odniesiony w kraju, zajmując 1. miejsce w letnim GPL 2015 oraz 2015 International Wildcard Tournament Turkey.","de_DE":"Die Bangkok Titans sind die unangefochtenen Champions der thailändischen League of Legends eSports Szene. Sie erkämpften sich sechs Mal aufeinanderfolgend den ersten Platz in der Profi Liga zwischen 2014 und 2015. Doch trotzdem sind sie mit ihrem regionalen Erfolg nicht zufrieden. Sie knüpften an ihre Siegesreihe an und gewannen das Sommer Finale der GPL 2015 und das Wildcard Turnier in der Türkei.","es_ES":"Nadie puede negar que Bangkok Titans es el equipo de League of Legends más potente de Tailandia. Entre 2014 y 2015 ha obtenido seis títulos consecutivos de la Thailand Pro League. Sin embargo, no se contentan con dominar a sus anchas en su país. Los Titans han utilizado su éxito local como cimientos para crecer, como demuestra el primer puesto cosechado tanto en el torneo de verano de la GPL 2015 como en el torneo internacional por invitación celebrado en Turquía este mismo año.","pt_BR":"A Bangkok Titans é a campeã absoluta no League of Legends tailandês. De 2014 a 2015, eles conseguiram seis títulos na Thailand Pro League. Mas eles não estão satisfeitos com o domínio regional, e querem fazer bonito internacionalmente. O primeiro passo já foi dado: eles venceram tanto a GPL de verão 2015 quanto o International Wildcard 2015 na Turquia, conquistando a vaga para o Mundial. \n"},"foreignIds":{"drupalId":"1024"},"players":[7,10,11,843,844,846],"starters":[7,10,11,843,844],"subs":[846]},{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]}],"players":[{"id":7,"slug":"warl0ck","name":"WarL0cK","firstName":"Pawat","lastName":"Ampaporn","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/warl0ck-cm8ktgfb.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:13.000Z","updatedAt":"2015-09-29T18:06:01.000Z","bios":{"en_US":"<p>Joining the Bangkok Titans in 2013, Pawat “WarL0cK” Ampaporn is the veteran team captain of the squad. He has been through several role swaps, with short stints in the jungle and support roles before finally finding his home in the top lane in 2014. Warl0ck excels with top lane tanks, playing champions like Maokai and Mundo to perfection. He acts as a disruptive force to his opponents' carries, and if he’s fed, he will often outright kill them.\n</p>\n<p>\nAfter two years of hard work, WarL0ck established himself as the best top laner not only in Thailand, but in the whole of Southeast Asia. The next step is proving he has what it takes to scuffle with the best top laners in the world.</p>","fr_FR":"<p>Pawat « WarL0cK » Ampaporn a rejoint Bangkok Titans en 2013, ce qui fait de lui le capitaine vétéran de l'équipe. Il a occupé plusieurs positions, avec quelques essais dans la jungle et comme support avant de trouver son poste de prédilection en 2014, sur la voie du haut. Warl0ck est excellent avec les tanks sur la voie du haut et il joue à la perfection des champions comme Maokai et Mundo. Il sait contrer les carrys de l'adversaire et il est parfaitement capable de les écraser si les circonstances s'y prêtent.\n</p>\n<p>\nAprès deux ans de dur labeur, WarL0ck est devenu le meilleur top laner non seulement de Thaïlande, mais de toute l'Asie du Sud-est. Il lui reste à montrer ce qu'il peut faire sur la voie du haut contre les meilleurs joueurs du monde.\n</p>","pl_PL":"<p>Dołączywszy do Bangkok Titans w 2013 roku, Pawat „WarL0cK” Ampaporn jest doświadczonym kapitanem drużyny. Zaliczył kilka zmian roli, na krótko goszcząc w dżungli i jako wspierający, zanim wreszcie odnalazł się w górnej alei w 2014 roku. Warl0ck najlepiej sprawdza się jako obrońca, do perfekcji wcielając się w bohaterów takich jak Maokai i Mundo. Doskonale sprawdza się w przeszkadzaniu wrogim prowadzącym, a jeżeli udało mu się zyskać przewagę, bardzo często po prostu ich zabije.\n</p>\n<p>\nPo dwóch latach ciężkiej pracy WarL0ck został uznany za najlepszego górnego nie tylko w Tajlandii, ale w całej Azji Południowo-Wschodniej. Kolejnym jego krokiem będzie udowodnienie, że potrafi rywalizować z najlepszymi górnymi z całego świata.\n</p>","de_DE":"<p>Pawat “WarL0cK” Ampaporn ist der Veteran und Team Kapitän der Bangkok Titans seit er 2013 Teil von ihnen geworden ist. Er hat sich schon an vielen Rollen versucht, mit einem kurzen Abstecher in den Jungle oder auch als Support, bis er endlich 2014 auf der Top-Lane angekommen ist. Warl0cKs Ass im Ärmel sind die Top-Lane Tanks wie Maokai und Mundo, welche er perfektioniert hat. Er ist die zerstörerische Kraft der Titans und der Einzige, der die gegnerischen Carries im Schach halten kann. Liegt er einmal vorne, kann er sie oftmals gänzlich aus dem Spiel nehmen. </p>\n\n<p>Nach rund zwei Jahren harter Arbeit, machte Warl0cK sich einen Namen als bester Top-Laner und das nicht nur in Thailand, sondern in ganz Südostasien. Jetzt muss er nur noch zeigen, ob er es mit den besten Top-Lanern der Welt aufnehmen kann. </p>\n","es_ES":"<p>Se unió a Bangkok Titans en el 2013, Pawat “WarL0cK” Ampaporn es el veterano capitán del equipo. Ha pasado por distintos cambios de rol, con un breve paso tanto en jungla como support finalmente encontró su hogar en la calle superior en 2014. La especialidad de WarL0cK son los tanques en la calle superior, juega campeones como Maokai y Dr. Mundo a la perfección. Actúa como una fuerza disuasoria para los asesinos enemigos, y si es él el que ha conseguido ponerse por delante en la partida, que se preparen sus adversarios. </p>\n\n<p>Después de dos años de trabajo duro, WarL0cK se estableció como el mejor top no sólo en Tailandia, sino en todo el Sudeste Asiático. El siguiente paso es demostrar que tiene lo que hay que tener para medirse a los mejores jugadores del mundo. </p>\n","pt_BR":"<p>O capitão e veterano da Bangkok está no time desde 2013, e já passou por diversas rotas. Teve sua época de caçador e suporte até fixar moradia na rota superior em 2014. Warl0ck é especialista em emboscadas no topo, conduzindo Maokai e Mundo com perfeição. Ele costuma incomodar a vida dos carregadores inimigos, e vai direto para o abate se estiver forte na partida.</p> \n<p>\nDepois de dois anos de muita dedicação, ele se estabeleceu como o melhor jogador do topo não só na Tailândia, mas em todo o sudeste asiático. O próximo passo é provar que ele está à altura dos melhores do mundo.</p>"},"foreignIds":{"drupalId":"1025","TRLH3":"1001160057","TRLH4":"1001160057"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":10,"slug":"lloyd","name":"Lloyd","firstName":"Juckkirsts","lastName":"Kongubon","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lloyd-6bj83xgb.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:14.000Z","updatedAt":"2015-09-29T18:11:08.000Z","bios":{"en_US":"<p>After picking up League of Legends in 2013, Juckkirsts ”Lloyd” Kongubon almost immediately started looking to compete professionally. He joined Thailand's amateur squad known as Team FlashDive, and following solid performances in local tournaments, soon caught the attention of several elite teams. Near the end of 2013, he was signed by the Bangkok Titans. \n</p>\n<p>\nLloyd is known for his exceptional laning mechanics, playing aggressively into his opponent to force trades. Eventually he either zones his opponent out of lane or snags a kill. Lloyd is more than just an aggressive AD carry though -- he is also a pillar for his team. He acts as a motivator for his teammates when they are down, pushing them to fight until the Nexus explodes. Lloyd is determined to prove that BKT is a world-class team.\n</p>","fr_FR":"<p>Dès qu'il fixa son choix sur League of Legends en 2013, Juckkirsts « Lloyd » Kongubon chercha à entrer sur la scène professionnelle. Il rejoignit une équipe amateur thaïlandaise appelée Team FlashDive et ses excellentes performances dans les compétitions locales attirèrent l'attention de plusieurs équipes de haut rang. Vers la fin de 2013, il rejoignit Bangkok Titans. \n</p>\n<p>\nLloyd est connue pour ses mécaniques exceptionnelles sur les voies et pour son jeu agressif contraignant ses adversaires à concéder des échanges défavorables. Il finit souvent par repousser son opposant ou par le tuer. Mais Lloyd n'est pas qu'un carry AD agressif, c'est aussi un pilier pour son équipe. Il sait motiver ses coéquipiers quand ils n'ont plus le moral, les pousse à combattre jusqu'à l'explosion du Nexus. Lloyd veut vraiment prouver que BKT est une équipe de classe mondiale.\n</p>","pl_PL":"<p>Po rozpoczęciu gry w League of Legends w 2013 roku Juckkirsts „Lloyd” Kongubon praktycznie od razu zaczął rozglądać się za profesjonalnymi rozgrywkami. Dołączył do amatorskiej drużyny z Tajlandii znanej jako Team FlashDrive i dzięki osiągnięciu dobrych wyników w lokalnych turniejach wkrótce zwrócił na siebie uwagę kilku profesjonalnych drużyn. Pod koniec 2013 roku dołączył do Bangkok Titans. \n</p>\n<p>\nLloyd słynie z niezwykle wyjątkowej zdolności do walki w alejach, agresywnie prowokując swoich przeciwników w celu wymuszenia walki. Ostatecznie albo zmusza przeciwnika do odwrotu, albo go zabija. Jednakże Lloyd nie jest wyłącznie agresywnym prowadzącym – jest także filarem dla swojej drużyny. Motywuje swoich kolegów, gdy podupadają na duchu, i popycha ich do walki, dopóki nexus nie eksploduje. Lloyd pragnie udowodnić, że BKT jest drużyną światowej klasy.\n</p>","de_DE":"<p>Nachdem er gerade Mal im Jahr 2013 anfing League of Legends zu spielen, suchte Juckkirsts „Lloyd“ Kongubon fast zeitgleich nach professionellen Karrierewegen. Er wurde Teil des thailändischen Amateurteams „Team FlashDive“ und lieferte dort solide Leistungen ab. Dies brachte ihm viel Aufmerksamkeit, unter anderem von den Bangkok Titans, sodass er Ende 2013 bei ihnen unterschrieb. Lloyd ist bekannt für seine starke Präsenz in der Laning-Phase, da er aggressiv spielt und seine Gegner zu einem stetigen Schadensaustausch zwingt. Am Ende drängt er seinen Gegner entweder von der Lane oder staubt eine Tötung ab. Aber Lloyd ist mehr als nur ein aggressiver Schütze – er ist auch die Säule des Teams. Er motiviert seine Mitspieler, wenn sie am Boden sind und treibt sie an, bis der gegnerische Nexus fällt. Lloyd ist fest entschlossen zu zeigen, dass sein Team Weltklasse besitzt. </p>","es_ES":"<p>Desde que comenzara a jugar a League of Legends en 2013 la idea de Juckkirsts ”Lloyd” Kongubon fue convertirse en jugador profesional. Se unió a un equipo amateur tailandés llamado Team FlashDive y, gracias a sus buenas actuaciones en torneos locales, llamó la atención de algunos de los mejores equipos. A finales de 2013 firmó por Bangkok Titans. </p>\n\n<p>Lloyd es conocido por sus mecánicas en fase de calles, jugando de forma agresiva para forzar enfrentamientos. Eventualmente lo que acaba ocurriendo es que, o bien saca a su oponente de la calle o bien lo asesina. Aunque Lloyd es algo más que un tirador agresivo -- también es uno de los pilares de su equipo. Motiva a sus compañeros cuando están en horas bajas, animandoles a no rendirse hasta que el Nexo explote. Lloyd está determinado a demostrar que BKT es un equipo de clase mundial. </p>\n","pt_BR":"<p>Lloyd começou a jogar League em 2013, e logo já estava competindo profissionalmente. Ele fez parte do time amador Team FlashDive, e depois de boas atuações em torneios locais chamou a atenção dos times grandes. No final de 2013, foi contratado pela Bangkok Titans. </p>\n<p>\nEle é conhecido por suas habilidades mecânicas incríveis na rota, jogando de forma agressiva para ganhar trocas contra o adversário. O resultado costuma ser um dos dois: rival morto, ou rival afastado para longe da rota. Mas ele é mais que um atirador agressivo -- também é o pilar do time. É quem traz a motivação quando os companheiros estão abatidos, botando todo mundo para cima até derrubar o Nexus.\n</p>"},"foreignIds":{"drupalId":"1728","TRLH3":"1001160060","TRLH4":"1001160060"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":11,"slug":"007x","name":"007x","firstName":"Chayut","lastName":"Suebka","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/007x-53wft7u.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:14.000Z","updatedAt":"2015-09-29T18:05:32.000Z","bios":{"en_US":"<p>Chayut “007x” Suebka earned the brilliant nickname 00Jayce due to his debonair mechanics in the top lane. However, in the middle of 2014, 007x moved to the jungle to boost BKT’s team synergy. The move paid off. BKT took 1st place in the 2015 Thailand Pro League Summer, 2015 GPL Summer, and 2015 International Wildcard Tournament Turkey. \n</p>\n<p>\n007x channels his inner James Bond every time he hits the Rift. He frequently works in tandem with his mid laner Nuttapong \"G4” Menkasikan to set up ambushes against the enemy jungler or to lure the opposing mid laner into a gankable position. With a diverse champion pool and a love for initiating for his team, 007x will be playing aggressive no matter who he faces.\n</p>","fr_FR":"<p>Chayut « 007x » Suebka a gagné le surnom 00Jayce en raison de ses mécaniques de jeu « séduisantes » sur la voie du haut. Pourtant, au cours de l'année 2014, 007x entra dans la jungle pour doper la synergie d'équipe de BKT. Ce fut un excellent choix. BKT prit la première place de la Thailand Pro League au cours de l'été 2015, de la GPL de l'été 2015 et de l'International Wildcard Tournament 2015 en Turquie. \n</p>\n<p>\n007x fait ressortir le James Bond qui est en lui à chaque fois qu'il va dans la Faille. Il travaille souvent en tandem avec son mid laner Nuttapong « G4 » Menkasikan pour planifier des embuscades contre le jungler ennemi ou pour attirer le mid laner adverse jusqu'à une position où il est possible de le ganker. Disposant d'une grande variété de champions jouables et aimant initier les combats pour son équipe, 007x est une terreur pour tous ses adversaires.\n</p>","pl_PL":"<p>Chayut „007x” Suebka zdobył wspaniały pseudonim 00Jayce dzięki swojej wytwornej grze w górnej alei. Jednakże w 2014 roku 007x przeniósł się do dżungli, aby wzmocnić synergię w BKT. Opłaciło się. BKT zajęło 1. miejsce w turniejach 2015 Thailand Pro League Summer, 2015 GPL Summer oraz 2015 International Wildcard Tournament Turkey. \n</p>\n<p>\n007x zachowuje się niczym James Bond za każdym razem, gdy pojawia się na Rift. Często współpracuje ze środkowym Nuttapongiem „G4” Menkasikanem, aby przygotować zasadzki na wrogiego dżunglera lub wywabić wrogiego środkowego na pozycję, która umożliwi gankowanie. Dzięki dużej puli bohaterów oraz uwielbieniu rozpoczynania walk dla swojej drużyny 007x jest postrachem dla wszystkich przeciwników.\n</p>","de_DE":"<p>Chayut „007x“ Suebka erhielt den großartigen Spitznamen 00Jayce wegen seinen charmanten Fähigkeiten auf der Top-Lane. Doch in der Mitte von 2014 wechselte 007x in den Jungle, um die Teamkonstellation zu verbessern – und es klappte! BKT wurde Erster in der Thailand Pro League im Sommer 2015, beim 2015 GPL Summer und dem internationalen Wildcard Turnier diesen Jahres in der Türkei. </p>\n\n<p>007x lässt seinen inneren James Bond zum Vorschein kommen, wenn er auf der Kluft der Beschwörer spielt. Er arbeitet eng mit seinem Mid-Laner Nuttapog „G4“ Menkasikan zusammen, um den gegnerischen Jungler in einen Hinterhalt zu locken oder den Mid-Laner in eine Position zu drängen, die ihn angreifbar von allen Seiten macht. Mit einem breiten Spektrum an Champions und einer Vorliebe für Kampferöffnungen, ist 007x der Schrecken von jedem ihm gegenüberstehenden Gegner. </p>\n","es_ES":"<p>Chayut “007x” Suebka se ganó el genial apodo de 00Jayce debido a sus actuaciones en la calle superior. No obstante, a mediados de 2014, 007x cambió de posición a la jungla para darle un empujón a la sinergia como equipo de BKT. Y mereció la pena. BKT consiguió la primera plaza en la Thailand Pro League Summer 2015, GPL Summer 2015 y el Wildcard Tournament Turkey. </p>\n\n<p>0007x canaliza a su James Bond interior cada vez que aparece por la Grieta. Normalmente trabaja en equipo con su compañero en la calle central Nuttapong “G4” Menkasikan para montar emboscadas contra el jungla enemigo, o llevar al jugador de la calle central rival a una posición desfavorable. Con un amplio abanico de campeones y su preferencia por composiciones que puedan iniciar peleas de equipo, 007x causará terror en cada enemigo al que se enfrente. </p>\n","pt_BR":"<p>Chayut ganhou o apelido de 00Jayce devido a suas atuações dignas de um cavalheiro na rota do topo. No meio da temporada de 2014, porém, 007x mudou-se para a selva com a missão de melhorar a sinergia do time. E a troca deu resultado. Os Titans ficaram em primeiro lugar na etapa de verão da liga tailandesa, na GPL de verão e no International Wildcard 2015 na Turquia.</p> \n<p>\nQuando entra em jogo, ele encarna seu James Bond interior. Trabalha sempre em conjunto com o jogador do meio G4 para fazer emboscadas contra o caçador adversário ou simplesmente tirar da toca o rival da rota do meio para facilitar emboscadas. Ele tem um leque de Campeões muito grande, e gosta muito de iniciar as lutas para o time, atuando sempre de forma agressiva.</p>"},"foreignIds":{"drupalId":"2684","TRLH3":"1001160058","TRLH4":"1001160058"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":843,"slug":"g4","name":"G4","firstName":"Nuttapong","lastName":"Menkasikan","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/g4-861t8d6b.png","hometown":"Thailand","region":"GPL","birthdate":"","createdAt":"2015-09-03T03:13:50.000Z","updatedAt":"2015-09-29T18:10:11.000Z","bios":{"en_US":"<p>Nuttapong “G4” Menkasikan is the shining star of Thai League of Legends. He has consistently achieved success in his League of Legends career, especially with the Bangkok Titans. G4 started playing professionally in 2013 and has won nine out of eleven major Finals he has participated in, seven of which were during his tenure on BKT.\n</p>\n<p>\nG4 isn’t just tagging along for the ride to victory though. He is famous for his impeccable play on assassin champions like Zed and Kassadin, and his thirst for kills is legendary. G4 led the charts at the 2015 International Wildcard Tournament Turkey with the most kills overall, snagging an average of seven kills per game. In short, G4 is the focal point for BKT. His success is their key to victory.\n</p>","fr_FR":"<p>Nuttapong « G4 » est l'étoile au firmament thaïlandais de League of Legends. Il n'a connu que le succès dans sa carrière au sein de League of Legends, notamment avec les Bangkok Titans. G4 a commencé à jouer en professionnel en 2013 et il a remporté neuf des onze principales finales auxquelles il a participé, dont sept sous le blason de BKT.\n</p>\n<p>\nG4 ne se contente pas de rechercher la victoire, cependant. Il est célèbre pour sa maîtrise d'assassins comme Zed et Kassadin et sa soif d'éliminations est légendaire. G4 a mené le classement 2015 de l'International Wildcard Tournament en Turquie avec le plus grand nombre d'éliminations pour une moyenne de sept champions exécutés par partie. En bref, G4 est l'épine dorsale de BKT. Son succès est leur clé pour la victoire.\n</p>","pl_PL":"<p>Nuttapong „G4” Menkasikan jest prawdziwą gwiazdą tajskiego League of Legends. Jego kariera w League of Legends jest pełna sukcesów, szczególnie gdy gra z Bangkok Titans. G4 zaczął grać profesjonalnie w 2013 roku i zwyciężył w 9 z 11 wielkich finałów, w których brał udział, a 7 z nich było w szeregach BKT.\n</p>\n<p>\nJednakże G4 nie załapuje się tylko na darmową przejażdżkę do zwycięstwa. Słynie z doskonałej gry zabójcami, takimi jak Zed czy Kassadin, a o jego żądzy zabijania krążą legendy. Prowadził w rankingu liczby zabójstw turnieju 2015 International Wildcard Tournament Turkey, w którym zdobywał średnio 7 zabójstw w każdym meczu. W skrócie, G4 jest ważnym elementem BKT. Jego sukces jest ich kluczem do zwycięstwa.\n</p>","de_DE":"<p>Nuttapong „G4“ Menkasikan ist der Star der thailändischen League of Legends Szene. Er hat kontinuierliche große Erfolge eingeräumt, ins besonders mit den Bangkok Titans. Im Jahr 2013 startete er seine professionelle Karriere und gewann neun von elf großen Finals, sieben während seiner Laufbahn bei den Titans. </p>\n\n<p>G4 ist jedoch mehr als nur ein Mitläufer des Teams. Er ist berühmt für seine tadellose Leistung mit Assassinen wie Zed oder Kassadin und sein Verlangen nach Eliminierungen ist legendär. G4 lag an der Spitze der Liste des Wildcard Turniers in der Türkei für die meisten Tötungen im ganzen Wettkampf mit einem Durchschnitt von sieben Tötungen pro Spiel. Man kann sagen, G4 ist die Stütze von BKT – sein Erfolg ist der Schlüssel zu ihrem Sieg. </p>\n","es_ES":"<p>Nuttapong ”G4” Menkasikan es la estrella del League of Legends Tailandés. Desde que comenzó, el mid no ha parado de cosechar éxitos en su carrera como jugador de League of Legends, especialmente con Bangkok Titans. La carrera profesional de G4 comenzó en 2013 y, desde entonces, ha ganado nueve de once grandes finales en las que ha participado, siete de ellas durante su estancia en BKT. </p>\n\n<p>Aunque G4 no es sólo un sinónimo de camino hacia la victoria. Es famoso por sus jugadas impecables en asesinos como Zed y Kassadin, y su sed de sangre es legendaria. G4 lideró en el International Wildcard Tournament 2015 con el mayor número total de asesinatos, consiguiendo una media de siete por partido. En resumen, G4 es la pieza clave de BKT. Su éxito es la llave hacia la victoria. </p>\n","pt_BR":"<p>A estrela do League of Legends na Tailândia tem uma carreira de sucesso, principalmente jogando pela Bangkok Titans. Ele começou jogando profissionalmente em 2013, e venceu 9 de 11 campeonatos que disputou, sendo 7 pelo time atual. </p>\n<p>\nG4 é impecável com assassinos como Zed e Kassadin, sempre em busca de abates. No International Wildcard da Turquia em 2015 (segundo semestre), ele conseguiu o maior número de abates em geral, com média de 7 por jogo. Ele é o ponto focal da BKT, e o caminho do time para as vitórias.</p>"},"foreignIds":{"TRLH3":"1001160059","TRLH4":"1001160059","drupalId":"2685"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":844,"slug":"moss","name":"Moss","firstName":"Sorawat","lastName":"Boonphrom","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/moss-5wmzr5kz.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2015-09-03T04:53:03.000Z","updatedAt":"2015-09-29T18:11:46.000Z","bios":{"en_US":"<p>Sorawat ”Moss” Boonphrom is the newest addition to the Bangkok Titans roster. Before joining the squad, he was the team captain of Bangkok Titan’s biggest rival, Team Infinite. Any doubts of Moss’ loyalty to BKT were assuaged during his debut at the 2015 International Wildcard Tournament Turkey. He helped BKT sweep through the tournament with seeming ease, landing a relentless cascade of Thresh hooks.\n</p>\n<p>\nMoss has a penchant for unusual champion picks. He pulled out several niche supports such as Gragas and Kennen at the IWC Turkey, catching his opponents off-guard. If there is one member on BKT with the ability (and desire) to shake up the meta, it’s Moss.\n</p>","fr_FR":"<p>Sorawat « Moss » Boonphrom est le nouveau coéquipier des Bangkok Titans. Avant de rejoindre l'équipe, il était le capitaine du principal rival de Bangkok Titan, Team Infinite. Si quelqu'un avait des doutes sur la loyauté de Moss envers BKT, ils ont été levés lors de ses débuts à l'International Wildcard Tournament 2015 en Turquie. Il a aidé BKT à dominer le tournoi, notamment avec le tournoiement des grappins de son Thresh.\n</p>\n<p>\nMoss a un goût pour les choix de champion inhabituels. Il a travaillé avec divers supports de niche comme Gragas et Kennen à l'IWC en Turquie, prenant ses adversaires par surprise. Si quelqu'un, au sein de l'équipe BKT, a la capacité et la volonté de faire évoluer la meta, c'est bien Moss.\n</p>","pl_PL":"<p>Sorawat „Moss” Boonphrom jest najnowszym dodatkiem do składu Bangkok Titans. Przed dołączeniem do nich był kapitanem największych rywali Bangkok Titans, Team Infinite. Wszelkie wątpliwości co do lojalności Mossa do BKT zniknęły podczas jego debiutu w turnieju 2015 International Wildcard Tournament Turkey. Pomógł BKT przebić się przez turniej bez większych problemów, co chwila doskonale trafiając hakami Thresha.\n</p>\n<p>\nMoss słynie z wybierania nietypowych bohaterów. Podczas IWC Turkey sięgnął po kilku z nich, jak chociażby Gragasa czy Kennena, zupełnie zaskakując swoich przeciwników. Jeżeli jest jakiś członek BKT, który może (i chce) wstrząsnąć metą, to właśnie Moss\n</p>","de_DE":"<p>Sorawat „Moss“ Boonphrom ist der neuste Zuwachs der Bangkok Titans. Bevor er Teil des Teams wurde, war er Kapitän des größten Rivalens von BKT, Team Infinite. Jeder Zweifel, dass Moss BKT nicht loyal ist, wurde während dem Wildcard Turnier beseitigt. Er half seinem Team durch das Turnier mit einer Leichtigkeit, die sich in seinen immer wieder treffenden Todesurteilen von Thresh widerspiegelten. </p>\n\n<p>Moss hat eine Vorliebe für ungewöhnliche Champion Picks. Er zauberte so einige außergewöhnliche Unterstützer, wie beispielsweise Gragas oder Kennen, auf das Spielfeld. Aus der Reserve lockte er damit so einige Bot-Lanes, die dem Ganzen nicht geheuer waren. Wenn es einen Spieler von den Bangkok Titans gibt, der das Zeug hat die Meta aufzumischen, dann ist es Moss. </p>\n","es_ES":"<p>Sorawat ”Moss” Boonphrom ha sido la última incorporación a la plantilla de Bangkok Titans. Antes de unirse al equipo, era capitán de Team Infinite, el mayor rival de Bangkok Titans. Aunque cualquier duda de la implicación de Moss con el equipo se disipó cuando, en su debut, contribuyó para conseguir la clasificación para el Campeonato Mundial mediante el International Wildcard Tournament 2015. Ayudó al equipo a arrasar en el campeonato con aparente facilidad, en gran parte debido a su precisión con Thresh y Sentencia de Muerte. </p>\n\n<p>Moss tiene inclinación por jugar campeones diferentes. En la IWC Turkey ha jugado unos cuantos supports inusuales como Gragas o Kennen, pillando a sus enemigos desprevenidos. Si hay un miembro de BKT con la suficiente habilidad (y ganas) para darle la vuelta al metajuego, ese es Moss. </p>\n","pt_BR":"<p>Antes de entrar para a BKT em 2015, Moss era simplesmente o capitão da maior rival, Team Infinite. Dúvidas sobre a sua lealdade logo caíram durante o International Wildcard 2015 na Turquia, quando ele ajudou o time a passar com facilidade pelos rivais, usando com sabedoria seus ganchos de Thresh. \n</p>\n<p>\nMoss gosta de usar Campeões incomuns. No IWC, ele foi visto usando Gragas e Kennen para surpreender os adversários. Se existe alguém na BKT capaz de balançar o meta, esse alguém é Moss.</p>"},"foreignIds":{"TRLH3":"1001160061","TRLH4":"1001160061","drupalId":"4907"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":846,"slug":"qaizer","name":"QaiZer","firstName":"Nuttapong","lastName":"Dechtanon","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/qaizer-9mecqset.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2015-09-04T23:54:24.000Z","updatedAt":"2015-09-29T18:11:47.000Z","bios":{"en_US":"<p>Nuttapong “QaiZer” Dechtanon is a substitute top laner for the Bangkok Titans. While he is a relatively new addition to the squad, he brings a wealth of experience in multiple roles to BKT.</p>","fr_FR":"<p>\nNuttapong « QaiZer » Dechtanon est le top laner remplaçant de Bangkok Titans. Bien qu'assez nouveau dans l'équipe, il a emmagasiné beaucoup d'expérience à de multiples positions au sein de l'équipe BKT.\n</p>","es_ES":"<p>\nNuttapong ''QaiZer'' Dechtanon es el suplente de Bangkok Titans para la calle superior. Aunque es relativamente nuevo en el puesto, ha aportado gran experiencia a BKT en diferentes roles.\n</p>","pl_PL":"<p>\nNuttapong „QaiZer” Dechtanon jest rezerwowym zawodnikiem w górnej alei z drużyny Bangkok Titans. Choć jest on nowym nabytkiem w drużynie, jest w stanie zaoferować jej bardzo wiele ze względu na swe bogate doświadczenia.\n</p>","de_DE":"<p>\nNuttapong „QaiZer“ Dechtanon ist Ersatz-Toplaner bei den Bangkok Titans. Er ist zwar noch relativ neu in der Mannschaft, aber er bringt sich mit jeder Menge Erfahrung in verschiedenen Rollen bei BKT ein. \n</p>","pt_BR":"<p>Apesar de ser novo no time, QaiZer é um jogador substituto que traz muita experiência em diversas rotas, principalmente no topo, como reserva de WarL0cK.</p>"},"foreignIds":{"TRLH3":"1001160062","TRLH4":"1001160062"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41}],"scheduleItems":[{"id":"AU_dgZg6OPWArxM1l4VU","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:fbb6be62-36ee-4670-add3-0f4d811d07ce","scheduledTime":"2015-10-01T17:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"1","subBlockLabel":"paris - W1D1","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:f6c0af3f-85e7-4de6-b064-ee9a0558d668"},"match":"fbb6be62-36ee-4670-add3-0f4d811d07ce","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"f6c0af3f-85e7-4de6-b064-ee9a0558d668","league":"9"}],"gameIdMappings":[{"id":"29cba860-6acf-4a5a-b5b3-eed1038f86cf","gameHash":"1a31ff26dbd27368"}],"videos":[{"id":7,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:29cba860-6acf-4a5a-b5b3-eed1038f86cf","source":"https://www.youtube.com/embed/QXMXOpocMQk?wmode=transparent","createdAt":"2015-10-01T18:57:38.000Z","updatedAt":"2015-10-01T18:57:38.000Z","game":"29cba860-6acf-4a5a-b5b3-eed1038f86cf"},{"id":8,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:29cba860-6acf-4a5a-b5b3-eed1038f86cf","source":"https://www.youtube.com/embed/UEpGcPOR0gk?wmode=transparent","createdAt":"2015-10-01T18:57:45.000Z","updatedAt":"2015-10-01T18:57:45.000Z","game":"29cba860-6acf-4a5a-b5b3-eed1038f86cf"},{"id":24,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:29cba860-6acf-4a5a-b5b3-eed1038f86cf","source":"https://www.youtube.com/embed/V6cdKA5k1LE?wmode=transparent","createdAt":"2015-10-02T13:37:03.000Z","updatedAt":"2015-10-02T13:37:03.000Z","game":"29cba860-6acf-4a5a-b5b3-eed1038f86cf"},{"id":26,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:29cba860-6acf-4a5a-b5b3-eed1038f86cf","source":"https://www.youtube.com/embed/eGpzNLBKGOE?wmode=transparent","createdAt":"2015-10-02T15:49:40.000Z","updatedAt":"2015-10-02T15:49:40.000Z","game":"29cba860-6acf-4a5a-b5b3-eed1038f86cf"}],"htmlBlocks":[],"match":{"id":"fbb6be62-36ee-4670-add3-0f4d811d07ce","name":"EDG-vs-BKT","position":5,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"},{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}],"games":{"29cba860-6acf-4a5a-b5b3-eed1038f86cf":{"id":"29cba860-6acf-4a5a-b5b3-eed1038f86cf","name":"G1","generatedName":"BKT|EDG|G1|fbb6be6236ee4670add","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"},{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}],"standings":{"result":[[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}],[{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}]],"timestamp":1443722977068,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380216","gameRealm":"TRLH3","platformId":"TRLH3:1001380216","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"05994bbf-837c-4b67-ad68-0d443b8507e1"}],[{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}]],"timestamp":1443722977070,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"b0598a21-e7d7-4b10-b8ad-2e12abe0be14":0,"05994bbf-837c-4b67-ad68-0d443b8507e1":1}}}