{"teams":[{"id":199,"slug":"supermassive-esports","name":"BAUSuperMassive eSports","guid":"be7123e9-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-57rm1o9y.png","acronym":"SUP","homeLeague":"urn:rg:lolesports:global:league:league:32","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-1twy6scg.png","createdAt":"2016-04-11T16:37:23.000Z","updatedAt":"2017-07-26T14:57:57.000Z","bios":{"en_US":"<p>SuperMassive eSports formed in 2016 to compete in the Turkish Championship League. They set out to gather some of the best players in the region with the goal of succeeding not only domestically, but also internationally. It took some time for the team to gel, but they eventually earned a spot at the 2016 Mid-Season Invitational.</p>\n\n<p>SuperMassive fell to Dark Passage in the 2016 Summer Season playoffs, failing to earn a shot at attending Worlds. But they’ve bounced back in 2017, earning the TCL Winter title and a spot at the 2017 Mid-Season Invitational in Brazil. They’ll be aiming to improve on their performance at last year’s event, but they’ll have to fight their way through the Play-In first.</p>\n\n<p>Coach: Catalin Daniel “Exorant” Podosu</p>","es_AR":"<p>SuperMassive se formó en Turquía justo antes del inicio de la temporada 2016 del Campeonato Turco de League (TCL), logrando alcanzar un éxito y reconocimiento no solo local, sino internacional. Para conseguir dicho objetivo, han incorporar a los mejores jugadores de Turquía en cada uno de sus respectivas posiciones.</p>\n\n<p>A SUP le tomó un buen tiempo congeniar como equipo y crear una sinergia positive. Sin embargo, su alineación joven tomó forma durante el Torneo de Invierno, en el que derrotaron a Beşiktaş con un marcador de 3-1 durante la final.</p>\n\n<p>El siguiente paso para SuperMassive fue el International Wildcard Invitational 2016, en la Ciudad de México. Tras perder enfrentamientos importantes durante la fase de grupos, el equipo se vio obligado a jugar partidas de desempate. A partir de ese momento, todo funcionó en favor de este equipo. Solo perdieron una partida durante la fase de desempate y eliminatorias, lo que concedió a SUP la oportunidad de representar a Turquía en el MSI 2016.</p>","fr_FR":"SuperMassive eSports a été formée en 2016 pour concourir dans la Turkish Championship League. Plusieurs des meilleurs joueurs de la région ont ainsi été réunis dans le but de réussir à domicile, mais aussi au niveau international. L'équipe a mis un peu de temps à se souder, mais elle a finalement décroché une place pour le Mid-Season Invitational 2016.\n\nSuperMassive s'est ensuite inclinée face à Dark Passage lors des play-offs du segment d'été 2016, manquant sa chance de participer au Mondial. Mais l'équipe a rebondi en 2017, remportant le titre hivernal de la TCL, ainsi qu'une place pour le Mid-Season Invitational 2017 au Brésil. Elle cherchera à présent à améliorer sa performance de l'an dernier, mais elle devra d'abord se frayer un chemin à travers les qualifications.\n\nEntraîneur : Catalin Daniel « Exorant » Podosu\n","es_ES":"SuperMassive eSports se formó en 2016 para competir en la Championship League de Turquía (TCL). Fichó a algunos de los mejores jugadores de la región con el propósito de vencer no solo a nivel local, sino internacional. Les llevó un tiempo adaptarse los unos a los otros, pero finalmente consiguieron hacerse con un puesto en el Mid-Season Invitational 2016.\n\nSuperMassive perdió contra Dark Passage en los playoffs de la temporada de verano de 2016, por lo que no consiguió una plaza para el Mundial. En 2017, llegaron con las pilas cargadas y se han ganado el título de invierno de la TCL, así como su participación en el Mid-Season Invitational 2017 en Brasil. Intentarán mejorar los resultados del evento del año pasado, pero para ello tendrán que superar la fase de apertura.\n\nEntrenador: Catalin Daniel ''Exorant'' Podosu\n","de_DE":"SuperMassive eSports wurde 2016 gegründet, um an der türkischen Championship League teilzunehmen. Die Verantwortlichen versammelten ein paar der besten Spieler der Region, um nicht nur national, sondern auch international erfolgreich zu sein. Es dauerte etwas, bis aus den Spielern eine richtige Mannschaft wurde, aber sie konnten sich dennoch einen Platz beim Mid-Season Invitational 2017 sichern.\n\nSuperMassive verlor in den Entscheidungsspielen der Sommer-Saison 2016 gegen Dark Passage und verpasste damit die Teilnahme an der WM. Aber sie konnten 2017 zurückschlagen, den Winter-Split der TCL gewinnen und sich einen Platz beim Mid-Season Invitational 2017 in Brasilien sichern. Dort werden sie versuchen, ihr Ergebnis vom letzten Jahr zu verbessern, aber dazu müssen sie sich zuerst durch die Vorrundenphase kämpfen.\n\nTrainer: Catalin Daniel „Exorant“ Podosu\n","pl_PL":"SuperMassive eSports powstali w 2016 roku, by podjąć rywalizację w Turkish Championship League. Postanowiono zebrać kilku z najlepszych graczy w regionie, stawiając sobie za cel osiągnięcie sukcesu nie tylko u siebie, ale także na świecie. Zgranie się drużyny zajęło trochę czasu, ale w końcu zdobyli miejsce na Mid-Season Invitational 2016.\n\nW play-offach sezonu letniego 2016 SuperMassive ustąpili Dark Passage, tracąc okazję do udziału w Mistrzostwach. Ale w 2017 roku powrócili, zdobywając tytuł zimy TCL i miejsce na Mid-Season Invitational 2017 w Brazylii. Zapewne zamierzają poprawić swoje wyniki z zeszłorocznego turnieju, ale najpierw będą musieli przebić się przez rundę wstępną.\n\nTrener: Catalin Daniel „Exorant” Podosu\n\n","pt_BR":"<p>A SuperMassive eSports foi formada em 2016 para competir na Turkish Championship League. Eles saíram em busca de alguns dos melhores jogadores da região com o objetivo de vencer não apenas nacionalmente, mas também internacionalmente. Demorou algum tempo para a equipe se entender, mas eles finalmente conquistaram um lugar no Mid-Season Invitational 2016.</p>\n\n<p>A SuperMassive perdeu para a Dark Passage nas eliminatórias da Temporada de Verão 2016, perdendo a chance de participar do Mundial. Mas eles se recuperaram em 2017, ganhando o título da Etapa de Inverno da TCL e um lugar no Mid-Season Invitational 2017 no Brasil. Eles vão tentar se sair melhor do que no evento do ano passado, mas vão precisar vencer a Fase de Entrada primeiro.</p>\n\n<p>Técnico: Catalin Daniel \"Exorant\" Podosu</p>","tr_TR":"Kurulduğu günden itibaren şampiyonluk adayı olma parolasıyla yoluna devam eden BAUSuperMassive eSports şimdiye kadar elde ettiği iki KMF bir IWCI kupasıyla doğru adımlar attığını gösterdi.<br><br>Hedefe kilitlendiği zaman korkulacak bir takım haline gelen SUP, geçtiğimiz sene kaçırdığı TBF kupasını bu sene alabilmek için iletişimi ön planda tuttu ve tamamen yerli oyunculardan oluşan bir kadro kurdu.\n"},"foreignIds":{},"players":[282,285,1210,1420,1421,1864,1925],"starters":[282,285,1210,1420,1421],"subs":[1864,1925]},{"id":318,"slug":"marines-esports","name":"GIGABYTE Marines","guid":"0d7c7400-eeee-458d-a76f-3e0440c7bdbf","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/marines-esports-ed4kafqu.png","acronym":"GAM","homeLeague":"urn:rg:lolesports:global:league:league:10","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/marines-esports-fqdynzgf.png","createdAt":"2017-04-16T19:37:27.000Z","updatedAt":"2017-07-26T17:50:26.000Z","bios":{"en_US":"<p>Vietnam’s GIGABYTE Marines are one of the youngest professional organizations in the world, having been formed at the tail end of 2016. They wasted no time in picking up top talent for the region and as a result rampaged through their first split in the Vietnam Championship Series A Spring Season. Through the regular season and playoffs they didn’t drop a single game to any opponent, showcasing just how dominant they could be. Their momentum carried through to the Garena Premier League (GPL), where they were seeded into the playoffs and subsequently qualified for the 2017 Mid-Season Invitational after dispatching the opposition in convincing fashion. If their early success is any indication, they’ll be a team to watch as they square up against some of the best teams in the world.</p>\n\n<p>Coach: Nguyen Duy Thanh “Tinikun” Duong</p>","es_AR":"<p>Los Marines Esports de Vietnam son una de las organizaciones profesionales más jóvenes del mundo; se formaron a finales de 2016. No perdieron tiempo en escoger a los mejores talentos de la región y, como resultado, arrasaron en su primer torneo en la temporada de primavera del Campeonato Serie A de Vietnam. Durante la temporada regular y eliminaciones no cedieron ni una sola partida a sus oponentes, demostrando qué tan dominantes podían ser. Su impulso se extendió hasta la Garena Premier League (GPL), en donde tuvieron una entrada en las eliminatorias y subsecuentemente calificaron para el Mid-Season Invitational 2017 después de acabar con la oposición de una manera bastante persuasiva. Si su éxito temprano es un indicio, será un equipo que habrá que seguir al enfrentarse a algunos de los mejores equipos en el mundo.</p>","pl_PL":"Wietnamscy Marines Esports to jedna z najmłodszych organizacji profesjonalnych na świecie. Uformowali się pod sam koniec 2016 roku. Nie tracąc czasu, ściągnęli do siebie najlepsze talenty w regionie i w rezultacie wzięli szturmem swój pierwszy split w sezonie wiosennym Vietnam Championship Series A. W toku sezonu zasadniczego i play-offów nie przegrali z nikim ani jednej gry, pokazując, jak bardzo potrafią dominować. Z impetem przebili się do Garena Premier League (GPL), gdzie zdobyli miejsce w play-offach i w konsekwencji zakwalifikowali się do Mid-Season Invitational 2017, pokonując przeciwników w przekonujący sposób. Jeśli ich wczesny sukces ma być wyznacznikiem przyszłości, będą drużyną, na którą trzeba mieć oko, gdy zmierzą się z kilkoma z najlepszych drużyn na świecie.","fr_FR":"Les Vietnamiens de Marines Esports constituent l'une des équipes les plus jeunes du monde, sa formation ne datant que de fin 2016. Ils n'ont pas perdu de temps pour recruter les meilleurs talents de la région, ce qui leur a permis de faire un carnage lors de leur premier segment, pendant la saison de printemps des Vietnam Championship Series A. Pendant la saison régulière et les play-offs, ils n'ont pas perdu une seule partie, prouvant de manière plus que convaincante leur supériorité. Ils ont ensuite continué sur leur lancée dans la Garena Premier League (GPL), en participant aux play-offs, puis en se qualifiant pour le Mid-Season Invitational 2017 après s'être facilement débarrassés de leurs adversaires. À en juger par son succès précoce, il faudra surveiller Marine Esports de près dans ses futurs affrontements contre les meilleures équipes du monde.","es_ES":"La organización Marines Esports de Vietnam es uno de los equipos profesionales más nuevos del mundo, fundado a finales de 2016. No han dudado al elegir a los mejores talentos de la región y por eso han arrasado en su primer split en la temporada de primavera de la Championship Series vietnamita. Durante la temporada regular y los playoffs, no perdieron una sola partida contra ningún oponente, dejando claro su gran potencial. Ese impulso los llevó hasta la Garena Premier League (GPL), donde participaron en los playoffs y se clasificaron para el Mid-Season Invitational 2017 tras despachar a sus rivales de forma convincente. Si este éxito es muestra de lo que puede llegar a ofrecer, será un equipo a tener en cuenta cuando se enfrente a algunos de los mejores del mundo.","de_DE":"Marines Esports aus Vietnam wurde erst Ende 2016 gegründet und ist damit eine der jüngsten professionellen Organisationen der Welt. Sie verschwendeten jedoch keine Zeit und sicherten sich einige der besten Talente, mit denen sie sich gleich in ihrem ersten Split der vietnamesischen Championship Series A den Titel sichern konnten. Dabei verloren sie weder ein Spiel in der regulären Saison noch in den Entscheidungsspielen und stellten damit unter Beweis, wie dominant sie sein können. Sie konnten ihren Erfolgslauf auch in der Garena Premier League (GPL) fortsetzen, wo sie für die Entscheidungsspiele gesetzt waren und sich für das Mid-Season Invitational 2017 qualifizieren konnten, nachdem sie ihre Gegner in überzeugender Manier besiegt hatten. Wenn sie auf ihrem frühen Erfolg aufbauen können, könnte diese Mannschaft im Duell mit den Besten der Welt für eine Überraschung sorgen.","pt_BR":"<p>A GIGABYTE Marines, do Vietnã, é uma das organizações profissionais mais jovens do mundo, tendo se formado no fim de 2016. Eles não perderam tempo escolhendo grandes talentos da região e, como resultado, atropelaram na primeira Etapa da Temporada de Primavera do Campeonato de Série A do Vietnã. Ao longo da temporada regular e das eliminatórias, eles não perderam uma única partida, demonstrando exatamente até onde eles podem ir. Eles mantiveram esse ritmo até a Garena Premier League (GPL), quando foram cabeça-de-chave e passaram às eliminatórias, qualificando-se para o Mid-Season Invitational 2017 após derrotar os oponentes de forma incontestável. Se o seu sucesso inicial for algum indicativo, vale a pena observá-los em suas disputas contra algumas das melhores equipes do mundo.</p>"},"foreignIds":{},"players":[13,915,1491,1885,1886,1887],"starters":[13,915,1491,1886,1887],"subs":[1885]}],"players":[{"id":13,"slug":"archie","name":"Archie","firstName":"Minh Nhut","lastName":"Tran","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/archie-f50lczuu.png","hometown":"Ho Chi Minh City","region":"SEA","birthdate":"1992-07-26","createdAt":"2014-07-16T22:59:15.000Z","updatedAt":"2017-05-13T18:50:41.000Z","bios":{"en_US":"<p>Minh Nhut \"Archie\" Tran is the brains behind the GIGABYTE Marines. As an AD Carry in a former life with the Saigon Jokers, he became renown for his refined Ezreal play. Not only did he play AD Carry formerly, but he also tried his hand in the top lane as well. As one of the few players that has played at a professional level in three different positions, Archie has accumulated an incredible amount of game knowledge. He leverages all this when he’s masterminding his team’s macro play from the support position. While Optimus and Levi may live in the spotlight, Archie pulls the strings quietly in the background in order to lead the Marines to glory. He’s hoping to orchestrate more victories as his team heads to Brazil for their first test against top-flight international competition.</p>","de_DE":"Minh Nhut „Archie“ Tran ist der Denker von Marines Esports. Archie war in seinem früheren Leben der AD-Carry der Saigon Jokers und erlangte aufgrund seiner starken Spielzüge mit Ezreal Bekanntheit. Er hat früher aber nicht nur als AD-Carry, sondern auch als Top-Laner gespielt. Archie gehört zu den wenigen Spieler, die in ihrer professionellen Karriere auf drei verschiedenen Positionen gespielt haben, und er hat sich ein unglaubliches Wissen über das Spiel angeeignet. Und dieses Wissen nutzt er, wenn er das Makrospiel seiner Mannschaft von der Supporter-Position aus lenkt. Obwohl Optimus und Levi mehr im Rampenlicht stehen, ist es eigentlich Archie, der im Hintergrund die Fäden zieht und die Marines zum Ruhm führt. Er hofft, seine Mannschaft auch in Brasilien zu einigen Siegen führen zu können, wo sie sich mit der internationalen Konkurrenz messen müssen.","es_ES":"Minh Nhut ''Archie'' Tran es el cerebro detrás de Marines Esports. Jugó como AD carry para Saigon Jokers y se hizo famoso por sus grandes jugadas con Ezreal. No solo ha jugado como ADC, sino que también ha pasado por la calle superior. Archie, uno de los pocos jugadores que ha jugado a nivel profesional en tres posiciones diferentes, ha acumulado una cantidad increíble de conocimiento sobre el juego. Saca provecho de su gran conocimiento cuando planea las macroestrategias de su equipo desde la posición de apoyo. Aunque Optimus y Levi se lleven el protagonismo, Archie maneja los hilos entre bambalinas para que los Marines consigan la gloria. Espera poder orquestar más victorias ahora que su equipo se dispone a viajar a Brasil para disputar su primer campeonato internacional.","fr_FR":"Minh Nhut « Archie » Tran est le cerveau des Marines Esports. Ancien carry AD des Saigon Jokers, il est devenu célèbre pour son utilisation raffinée d'Ezreal. En plus de son expérience de carry, il s'est également essayé à la voie du haut. L'un des seuls joueurs à avoir joué dans trois positions différentes au niveau professionnel, Archie a accumulé des connaissances de jeu inégalables. Et il en tire profit en orientant le macro-jeu de son équipe à partir de sa position de support. Optimus et Levi vivent peut-être sous le feu des projecteurs, mais c'est Archie qui tire les ficelles dans l'ombre afin de conduire les Marines à la gloire. Il espère maintenant orchestrer d'autres victoires alors que son équipe se dirige vers le Brésil pour son premier défi contre les meilleurs joueurs internationaux.","pl_PL":"Minh Nhut „Archie” Tran to mózg Marines Esports. Jako były prowadzący Saigon Jokers stał się znany z doskonałej gry Ezrealem. Nie tylko grał wcześniej jako prowadzący, ale także próbował sił na górnej alei. Będąc jednym z niewielu zawodników, którzy grali na profesjonalnym poziomie na trzech różnych pozycjach, Archie uzyskał niesamowity zasób wiedzy o grze. Wykorzystuje ją w pełni, gdy kieruje grą makro swojej drużyny z pozycji wspierającego. Podczas gdy Optimus i Levi walczą w blasku jupiterów, Archie cicho pociąga za sznurki w tle, prowadząc Marines do chwały. Ma nadzieję, że uda mu się zdobyć więcej zwycięstw, gdy jego drużyna wybierze się do Brazylii, by po raz pierwszy przetestować swoje umiejętności przeciwko najlepszym rywalom międzynarodowym.","pt_BR":"<p>Minh Nhut \"Archie\" Tran é o cérebro por trás da GIGABYTE Marines. Como ADC anterior da Saigon Jokers, ele ficou famoso por seu jogo refinado como Ezreal. Não só ele jogou como ADC antes, como também tentou a mão pela rota superior. Como um dos poucos jogadores que se aventuraram no nível profissional em três posições distintas, Archie acumulou uma enorme quantidade de conhecimento do jogo. Ele tira proveito de tudo isso quando planeja o jogo da equipe a partir de sua posição de suporte. Enquanto Optimus e Levi vivem sob os holofotes, Archie carrega o piano silenciosamente por trás dos panos e leva os Marines à glória. Ele espera orquestrar mais vitórias agora que sua equipe vai ao Brasil disputar sua primeira competição internacional.</p>"},"foreignIds":{"drupalId":"960","TRLT3":"200000051","TRLH1":"200000446","TRLH2":"200000346"},"socialNetworks":{"facebook":"https://www.facebook.com/SAJArchie-312854105507403/"},"champions":[{"id":206,"playerId":13,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2015-11-26T18:17:10.000Z","updatedAt":"2017-05-13T18:50:41.000Z"}],"liveGameTeam":318},{"id":282,"slug":"naru","name":"Naru","firstName":"Koray","lastName":"Bıçak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/naru-7v36dmtn.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1996-08-27","createdAt":"2014-09-16T21:51:39.000Z","updatedAt":"2017-07-21T15:01:28.000Z","bios":{"en_US":"<p>Koray “Naru” Bıçak is a legend of the Turkish scene. He began his career with Dark Passage in 2013 and finished in first place in all but one split. He left the team last year to join SuperMassive eSports, where he continued his success and earned the chance to play at the 2016 Mid-Season Invitational.</p>\n\n<p>Naru is known for his wide champion pool and ability to pick up a new champion at a moment’s notice. His most played champions in the TCL regular season were Ryze, Corki and LeBlanc -- three unique play styles that he balanced effortlessly. If he wants to perform better at this year’s MSI in Brazil, he might need to pull out something surprising against world class mid laners like Bjergsen and Faker.</p>","es_AR":"<p>Koray 'Naru' Bıçak es el jugador profesional de Turquía más exitoso de todos los tiempos. Naru comenzó su carrera con el afamado equipo Dark Passage, con quien asistió a todas las finales de la TCL desde 2013, perdiendo un solo trofeo durante esta travesía. También cuenta con un amplio repertorio de experiencias internacionales, habiendo competido en varios torneos Wildcard y el Campeonato Mundial de 2014.</p>\n\n<p>Naru posee un repertorio de campeones inmenso, y juega cualquier cosa que requiera la composición de su equipo. También es un gran seguidor de los cambios en el metajuego, adoptando selecciones que se ponen de moda en las tendencias globales, y adaptándolas a su propio estilo de juego. Los equipos que participan en el Mid-Season Invitational 2016 necesitarán estar atentos a su flexibilidad y a su tendencia a acumular impresionantes ventajas de últimos golpes.</p>","fr_FR":"Koray « Naru » Bıçak est une légende sur la scène turque. Il a débuté sa carrière chez Dark Passage en 2013 et a terminé en première place dans tous ses segments, à l'exception d'un. Il a quitté l'équipe l'an dernier pour rejoindre SuperMassive eSports, où il a continué sur sa lancée victorieuse et s'est qualifié pour le Mid-Season Invitational 2016.\n\nNaru est connu pour son large pool de champions et sa capacité à choisir un nouveau champion sans préavis. Ses champions les plus utilisés durant la saison régulière de la TCL ont été Ryze, Corki et LeBlanc – trois styles de jeu uniques qu'il a su équilibrer sans mal. Cette année, s'il souhaite améliorer sa performance au MSI, au Brésil, il devra sûrement créer la surprise contre des midlaners de classe mondiale tels que Bjergsen et Faker.\n","es_ES":"Koray ''Naru'' Bıçak es una leyenda de la escena turca. Comenzó su trayectoria profesional con Dark Passage en 2013 y acabó en primer lugar en todos los splits salvo en uno. Abandonó el equipo el año pasado para unirse a SuperMassive eSports, donde siguió cosechando éxitos y se ganó la oportunidad de jugar en el Mid-Season Invitational 2016.\n\nNaru es famoso por su gran variedad de campeones y por su capacidad para aprender a jugar con nuevos campeones rápidamente. Sus campeones más jugados en la temporada regular de la TCL fueron Ryze, Corki y LeBlanc (tres estilos de juego únicos que pudo equilibrar sin esfuerzo). Si quiere obtener mejores resultados en el MSI de este año en Brasil, puede que tenga que sorprender a los mejores mid del mundo, como Bjergsen y Faker.\n","de_DE":"Koray „Naru“ Bıçak ist eine Legende der türkischen E-Sport-Szene. Er begann seine Karriere 2013 bei Dark Passage und gewann mit einer Ausnahme jeden Split. Im letzten Jahr verließ er die Mannschaft und wechselte zu SuperMassive eSports, wo er seinen Erfolgslauf fortsetzte und sich für das Mid-Season Invitational 2017 qualifizieren konnte.\n\nNaru ist für seinen umfangreichen Championpool und seine Fähigkeit bekannt, den Umgang mit neuen Champions in Windeseile zu erlernen. Im Verlauf der regulären Saison der TCL spielte er am häufigsten mit Ryze, Corki und LeBlanc – drei unterschiedliche Spielstile, zwischen denen er problemlos wechseln kann. Wenn er beim diesjährigen MSI in Brasilien eine bessere Vorstellung abliefern will, wird er die eine oder andere Überraschung aus seinem Hut zaubern müssen, um mit Mid-Lanern wie Bjergsen und Faker mithalten zu können.\n","pl_PL":"Koray „Naru” Bıçak to legenda tureckiej sceny. W 2013 roku rozpoczął swoją karierę z Dark Passage i wszystkie splity poza jednym kończył na pierwszym miejscu. Opuścił drużynę w zeszłym roku, by dołączyć do SuperMassive eSports, z którymi kontynuował odnoszenie sukcesów i zdobył szansę na udział w Mid-Season Invitational 2016.\n\nNaru znany jest z szerokiej puli bohaterów i tego, że potrafi niespodziewanie wybrać całkiem nowego bohatera. Najczęściej wykorzystywanymi przez niego bohaterami w sezonie zasadniczym TCL byli Ryze, Corki i LeBlanc — to trzy unikalne style gry, między którymi Naru balansuje bez wysiłku. Jeśli chce dać lepszy występ na tegorocznym MSI w Brazylii, będzie musiał wyciągnąć coś zaskakującego z rękawa, mierząc się ze światowej klasy środkowymi, takimi jak Bjergsen i Faker\n\n","pt_BR":"<p>Koray \"Naru\" Bıçak é uma lenda do cenário turco. Ele começou a sua carreira com a Dark Passage em 2013 e terminou em primeiro lugar em quase todas Etapas, não vencendo apenas uma. Ele saiu da equipe no ano passado para entrar na SuperMassive eSports, onde continuou a ter sucesso e conquistou a chance de jogar no Mid-Season Invitational 2016.</p>\n\n<p>Naru é conhecido pelo seu amplo elenco de Campeões e a habilidade de escolher um novo Campeão rapidamente. Os Campeões com os quais ele mais jogou na temporada regular da TCL foram Ryze, Corki e LeBlanc; três estilos de jogo diferentes que ele equilibrou sem esforço. Se ele quiser se sair melhor neste MSI no Brasil, precisará surpreender os jogadores de meio do mundo, como Bjergsen e Faker.\n</p>","tr_TR":"Koray \"Naru\" Bıçak Şampiyonluk Ligi’nde orta koridor denince akla gelen belki de ilk isim. Uzun yıllar Dark Passage kadrosunda yer alan Naru, yurt içinde düzenlenen her resmi turnuvayı takımının kazanmasında en büyük pay sahibi olan oyunculardan biriydi. Yurt dışında da yavaş yavaş tecrübe kazanmasıyla beraber ilk olarak 2013 IWCQ’da ülkemizi başarıyla temsil eden Dark Passage, bir sonraki sene 2014 Worlds’e katılmayı başarıyordu. Sadece yurt içinde gösterdiği performansla değil, EUW tekli dereceli sıralarında da gösterdiği başarı sonrası bir zamanların efsane takımı Gambit Gaming’den transfer teklifi alan Naru, her çevreden saygı gören bir isim haline geldi. Kaptanı olduğu Dark Passage’dan ayrılıp BAUSuperMassive eSports’a transfer olan Naru, 2016 ve 2017 KMF’yi ve 2016 IWCI’yi kazanmayı başardı ve son MSI’ın kapısından döndü. Bu mevsimde de geçtiğimiz mevsimdeki dominant performansını tekrarlamayı hedefleyen BAUSuperMassive’de Naru’dan beklentiler yüksek.\n <br><br>\nNaru her ne kadar hâlâ en üst düzey orta koridorlardan biri de olsa eski günlerini aradığı bir gerçek. Uzun yıllar boyu üst düzey performans göstermenin onu yıprattığı gerçeği bir yana, karşı orta koridordan skor almak için gereğinden fazla agresif oynaması ve Naru’nun üzerindeki “ne zaman düzelecek” baskısı gibi etmenler de Naru’yu efsanevi performansından uzaklaştırıyor. Eğer BAUSuperMassive geçen seneki başarısını tekrar etmek istiyorsa eski Naru’ya çok ihtiyaçları var.\n"},"foreignIds":{"drupalId":"3200","ESPORTSTMNT03":"200001302","TRLT3":"200000087","ESPORTSTMNT04":"200001535"},"socialNetworks":{"twitch":"http://www.twitch.tv/dpnaru","facebook":"https://www.facebook.com/dpnaru","twitter":"https://twitter.com/koraynaru"},"champions":[],"liveGameTeam":199},{"id":285,"slug":"fabfabulous","name":"fabFabulous","firstName":"Asim Cihat","lastName":"Karakaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fabfabulous-7yh3zrzv.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2014-09-16T21:51:40.000Z","updatedAt":"2017-07-21T14:58:22.000Z","bios":{"en_US":"<p>Asım Cihat \"fabFabulous\" Karakaya is the top laner for SuperMassive eSports. If he had it his way, he’d play nothing but carries in the top lane. But more often than not, his team needs him on a tank like Maokai or Shen. He was able to bring out Camille a bit during the regular season, though, going 5-0 on the champion. In his second trip to the Mid-Season Invitational, he might need to do some carrying if his team wants to make it through to the group stage in Rio de Janeiro.</p>","es_AR":"<p>Asım Cihat 'fabFabulous' Karakaya prefiere jugar carrileros superiores agresivos como Kha'Zix y Nidalee. Sin embargo, el nuevo meta ha cambiado y tuvo que adaptar su estilo de juego a campeones como Maokai. Como resultado tiene una poza de campeones muy amplia, con partidas con Vayne o Lissandra durante la Temporada 4. Esta característica hace que los bloqueos en su contra se vuelvan muy difíciles y le permite adaptarse a los cambios de meta con facilidad.</p>","tr_TR":"Asım \"fabFabulous\" Cihat Karakaya Türkiye’de League of Legends denince akla gelen ilk isimlerden. Bu unvanı da bileğinin hakkıyla kazanan fabFabulous profesyonel arenaya Şampiyonluk Ligi’nin en köklü takımlarından HWA ile adım attı. Gösterdiği inanılmaz performans sonrası yurt dışı turnuvalarda başarı hedefleyen Dark Passage’ın transfer ettiği fabFabulous, 2013 IWCQ’da imza şampiyonu olan Kha’Zix ile Pain Gaming karşısında beşte beş yaparak Dark Passage yöneticilerinin doğru karar verdiğini gösterdi. Bir sonraki sene de Dark Passage ile 2014 Worlds’e giden fabFabulous bu başarısını perçinlemiş oldu. <br><br> Yeni sezonda HWA’ya dönen fabFabulous, Kha’Zix’in başta ormanda oynanması yüzünden ormana geçeceğini söylemişti. Sonradan bu kararından vazgeçen fabFabulous, takımın üst koridoru Stomaged’in Ahraz Esports takımındaki gibi ormana geçmesine ve böylece Şampiyonluk Ligi’nin en üst düzey ormancılarından birinin doğmasına ön ayak oldu. <br><br>  HWA sonrası yıldızlar topluluğu olarak nitelendirilen BAUSuperMassive eSports’a geçen fabFabulous, bu takımda Thaldrin ile forma rekabetine girmesinin yanında koçluk görevine Hatchy gelene dek takımına koçluk bile yaptı. Thaldrin sonrası BAUSuperMassive’in üst koridorunda özlenen performansına devam eden fabFabulous’u sürekli izleyebilmek her espor izleyicisini mutlu eden bir durum.\n \nfabFabulous özellikle agresif şampiyonlarla yaptığı oyunlarla hatırlansa da sadece agresif şampiyonları oynayabildiğini düşünmek yanlış olur. Defansif şampiyonlarla da çok tehlikeli olan fabFabulous, geriye düşen takımını oyunun geç aşamasında takım savaşlarında gösterdiği performansla oyuna geri döndürebileceğini pek çok defa gösterdi. Sadece taraftarları değil, sunucuları bile yaptığı oyunlarla gaza getirip “fab fab fab fab” diye bağırtabilen fabFabulous’un varlığı BAUSuperMassive için çok önemli. Bu mevsim de pek çok yetenekli üst koridora karşı oynayacak olan fab, MSI elemelerinde gösterdiği performansa devam etmeye çalışacak ve performansıyla MSI’a kalamadıkları için üzülen taraftarlarının gönlünü almak için ter dökecek.\n","pl_PL":"Asım Cihat „fabFabulous” Karakaya gra jako górny SuperMassive eSports. Gdyby to zależało tylko od niego, grałby wyłącznie jako prowadzący na górnej alei. Ale często drużyna potrzebuje go w roli obrońcy, takiego jak Maokai lub Shen. Mimo wszystko udało mu się parę razy wybrać Camille podczas sezonu zasadniczego i osiągnąć z tą bohaterką wynik 5-0. W swojej drugiej wyprawie na Mid-Season Invitational być może będzie musiał trochę pograć jako prowadzący, jeśli jego drużyna chce przebić się do fazy grupowej w Rio de Janeiro.","fr_FR":"Asım Cihat « fabFabulous » Karakaya est le toplaner de SuperMassive eSports. S'il pouvait n'en faire qu'à sa tête, il se contenterait de jouer les carrys dans la voie du haut. Mais son équipe a parfois besoin de lui en tant que tank avec Maokai ou Shen. Cela dit, il a été capable d'utiliser un peu Camille pendant la saison régulière et a enregistré un 5-0 avec la championne. Lors de son second passage dans le Mid-Season Invitational, il devra peut-être jouer les carrys occasionnellement si son équipe espère accéder à la phase de groupe à Rio de Janeiro.","es_ES":"Asım Cihat ''fabFabulous'' Karakaya es el jugador de la calle superior de SuperMassive eSports. Si tiene la oportunidad de jugar según su estilo, optará por los carries para la calle superior. No obstante, es frecuente que su equipo necesite que juegue tanques como Maokai o Shen. Durante la temporada regular, pudo jugar un poco con Camille y consiguió un 5-0 con ella. En su segundo viaje al Mid-Season Invitational, puede que tenga que guiar a su equipo hasta la victoria si quieren participar en la fase de grupos en Río de Janeiro.","de_DE":"Asım Cihat „fabFabulous“ Karakaya ist der Top-Laner von SuperMassive eSports. Wenn es nach ihm ginge, würde er auf der oberen Lane nur Carrys spielen. Leider muss er für seine Mannschaft häufig Tanks wie Maokai oder Shen auswählen. Er konnte im Verlauf der regulären Saison aber immer wieder Camille spielen, mit der er bei fünf Siegen und null Niederlagen hält. Bei seiner zweiten Teilnahme am Mid-Season Invitational muss er wahrscheinlich das eine oder andere Spiel entscheiden, wenn er seiner Mannschaft dabei helfen will, die Gruppenphase in Rio de Janeiro zu erreichen.","pt_BR":"<p>Asım Cihat \"fabFabulous\" Karakaya é quem joga na rota superior da SuperMassive eSports. Por ele, jogaria sempre com carregadores na rota superior. Mas, frequentemente, sua equipe precisa dele com um tanque como Maokai ou Shen. Porém ele foi capaz de usar a Camille um pouco durante a temporada regular, conquistando 5-0 com a Campeã. Na sua segunda ida a um Mid-Season Invitational, ele pode precisar carregar um pouco a equipe se quiser passar da Fase de grupos no Rio de Janeiro.</p>"},"foreignIds":{"drupalId":"3198","TRLT3":"200000085","ESPORTSTMNT03":"200001300","ESPORTSTMNT04":"200001533"},"socialNetworks":{"facebook":"https://www.facebook.com/HWA.fabulous"},"champions":[],"liveGameTeam":199},{"id":915,"slug":"optimus","name":"Optimus","firstName":"Van Cuong","lastName":"Tran","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/optimus-iccm94kb.png","hometown":null,"region":"N/A","birthdate":"","createdAt":"2015-11-26T18:26:07.000Z","updatedAt":"2017-05-13T18:46:14.000Z","bios":{"en_US":"<p>Van Cuong “Optimus” Tran is making his case for being the best mid laner in the Southeast Asia region. Nicknamed “OP-timus” for his many highlight plays, Optimus began his career in 2013 with the Saigon Jokers. Despite a brief stint as an ADC, he’s proven himself a match for SEA mid lane legends Westdoor and Morning. He’s a veteran of several international events, including a handful of All-Star events where he showed the world glimpses of his ridiculous skill ceiling, but he’ll need to keep surprising us in order to give his team a fighting chance in Brazil. One thing’s for sure, though: When you’ve got someone like Optimus who has ample experience and can pop off at a moment’s notice, you’ll always have at shot at downing even the mightiest of foes.</p>","de_DE":"Van Cuong „Optimus“ Tran beansprucht den Titel des besten Mid-Laners in Südostasien für sich. Optimus hat seine Karriere im Jahr 2013 bei den Saigon Jokers begonnen und für seine vielen überragenden Spielzüge den Spitznamen „OP-timus“ bekommen. Trotz eines kurzen Intermezzos als AD-Carry bewies er, dass er den südostasiatischen Mid-Laner-Legenden, Westdoor und Morning, das Wasser reichen kann. Er war schon bei einigen internationalen Events dabei, darunter auch eine Handvoll All-Stars-Events, bei denen er der Welt Teile seines unglaublichen Könnens zeigen konnte. Aber er wird uns auch weiterhin überraschen müssen, damit seine Mannschaft in Brasilien eine Chance hat. Eines ist aber sicher: Wenn du jemanden wie Optimus in deiner Mannschaft hast, der schon einiges an Erfahrung hat und sein Können im Handumdrehen abrufen kann, dann hast du selbst gegen die stärksten Gegner eine Chance.","es_AR":"<p><strong>Van Cuong \"Optimus\" Tran</strong> demostrará por qué es el mejor carrilero central de la región del Sureste de Asia. <strong>Optimus</strong> comenzó su carrera en 2013 con los Saigon Jokers y recibió el apodo de <strong>\"OP-timus\"</strong> por sus muchas jugadas estelares. A pesar de un corto tiempo como tirador, <strong>Van Cuong</strong> ha demostrado ser un competidor digno frente a leyendas de la región SEA del carril central como <strong>Westdoor</strong> y <strong>Morning</strong>. Es un veterano en una gran cantidad de eventos internacionales, incluyendo varios eventos All-Star en donde le ha mostrado al mundo vistazos de su increíble techo de habilidad; sin embargo, tendrá que seguir sorprendiéndonos para que pueda darle una oportunidad a su equipo en Brasil. Pero hay algo que es seguro: Cuando tienes a alguien como <strong>Optimus</strong>, con una amplia experiencia y que puede aparecerse de la nada en cualquier momento, siempre tendrás una oportunidad de vencer al enemigo más fuerte.</p>","es_ES":"Van Cuong ''Optimus'' Tran quiere demostrar que es el mejor mid de la región del sudeste asiático. Comenzó su trayectoria en 2013 con los Saigon Jokers, y fue apodado ''OP-timus'' por sus muchas jugadas destacadas. A pesar de haber pasado un breve periodo de tiempo jugando como ADC, ha demostrado estar a la altura de las leyendas mid del sudeste asiático Westdoor y Morning. Veterano en diversos eventos internacionales, ha participado en varios All-Star, donde mostró al mundo su estratosférica habilidad. No obstante, tendrá que seguir sorprendiéndonos si quiere que su equipo tenga la oportunidad de competir en Brasil. Una cosa está clara: si un equipo cuenta con alguien como Optimus, con gran experiencia y que puede reaccionar al instante, siempre existirá una oportunidad de vencer a los enemigos más fuertes.","fr_FR":"Van Cuong « Optimus » Tran a prouvé son talent en devenant le meilleur midlaner d'Asie du Sud-Est. Surnommé « OP-timus » pour ses nombreux temps forts, Optimus a commencé sa carrière en 2013 avec les Saigon Jokers. Malgré une courte période en tant qu'ADC, il a démontré qu'il était au niveau des midlaners mythiques de la région, Westdoor et Morning. Il a déjà participé à de nombreux événements internationaux, dont quelques tournois All-Stars où il a fait preuve d'un niveau de maîtrise absolu, mais il devra continuer à nous surprendre si son équipe espère remporter la victoire au Brésil. En tout cas, une chose est sûre : Avec un joueur expérimenté et capable d'exploser instantanément comme Optimus, même les ennemis les plus redoutables peuvent devenir inoffensifs.","en_PL":"","es_MX":"Van Cuong ''Optimus'' Tran está haciendo las maletas porque es el mejor central del Sudeste Asiático. Comenzó su trayectoria en 2013 con los Saigon Jokers, y recibe el nombre de ''OP-timus'' por sus jugadas de otro nivel. A pesar de que pasó un breve periodo de tiempo jugando como ADC, ha demostrado que puede equipararse a las leyendas de central de su región, Westdoor y Morning. En el International Wildcard All-Star Event 2016, demostró, en varias partidas clave, lo engañosa y destructiva que es la recientemente actualizada LeBlanc. Ahora tendrá la oportunidad de poner a prueba sus habilidades contra los centrales de todo el mundo en el All-Star Event 2016 de Barcelona.","pl_PL":"Van Cuong „Optimus” Tran zdobywa dla siebie uznanie jako najlepszy środkowy regionu Azji Południowowschodniej. Zyskał przezwisko „OP-timus” za swoje liczne świetne zagrywki. Karierę rozpoczął w 2013 r. u Saigon Jokers. Pomimo krótkich występów jako prowadzący, okazał się godnym przeciwnikiem legend środkowej alei z SEA, Westdoora i Morninga. Jest weteranem kilku imprez międzynarodowych, włącznie z paroma turniejami All-Star, na których pokazał światu swój niesamowicie wysoki pułap umiejętności. Będzie jednak musiał dalej nas zaskakiwać, aby zapewnić swojej drużynie szanse podczas walki w Brazylii. Jedno jest pewne: gdy ma się w drużynie kogoś takiego jak Optimus, z jego wielkim doświadczeniem, który potrafi momentalnie dać z siebie wszystko, zawsze jest szansa na pokonanie nawet najsilniejszych przeciwników.","pt_BR":"<p>Van Cuong \"Optimus” Tran tem se candidatado como melhor jogador da rota do meio do sudeste asiático. Conhecido como \"OP-timus” por realizar muitas jogadas de destaque, Optimus começou sua carreira em 2013 pela Saigon Jokers. Embora já tenha jogado como Atirador, ele provou ser tão bom quanto os lendários Westdoor e Morning, jogadores da rota do meio do sudeste asiático. Ele tem experiência em muitos eventos internacionais, incluindo alguns eventos All-Star, onde deu ao mundo mostras de sua habilidade absurda. Contudo ele terá de continuar nos surpreendendo se quiser ajudar a sua equipe a chegar longe no MSI 2017. Mas uma coisa é certa: Quando você tem alguém como Optimus, que tem ampla experiência e pode tirar um coelho da cartola a qualquer momento, você sempre terá chance de derrubar até os mais poderosos adversários.</p>"},"foreignIds":{"TRLH3":"1001360038","TRLH4":"1001310038","TRLT3":"200000049","TRLH1":"200000444","TRLH2":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1210,"slug":"stomaged","name":"Stomaged","firstName":"Furkan","lastName":"Güngör","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stomaged-4cek2mao.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2016-04-11T16:48:04.000Z","updatedAt":"2017-07-21T14:58:36.000Z","bios":{"en_US":"<p>Furkan “Stomaged” Güngör is the jungler for SuperMassive eSports. He’s making his second trip to the Mid-Season Invitational after attending in 2016. Stomaged is a versatile jungler, playing 10 unique champions in the 2017 TCL Winter Split. But he’s most at home on strong early game champions like Rek’Sai and Lee Sin. After a poor performance at last year’s event, he’ll be itching for another shot at the world’s top junglers in Brazil.</p>","es_AR":"<p>Furkan 'Stomaged' Güngör es el junglero de SuperMassive. Se unió a la escuadra para participar en el Torneo de Invierno de 2016. Stomaged es considerado como el jugador con mayor crecimiento en SUP, consolidando su transición hacia un junglero fiable y multifacético, en lugar de limitarse a sus viejos hábitos de utilizar solamente campeones tanque durante el 2014 y 2015. Incluso cambió posición al carril superior por un tiempo, pero los monstruos de la Grieta lo sedujeron a regresar a la jungla.  Y es donde mejor se desempeña.</p>\n\n<p>Aunque pudiera faltarle experiencia en torneos internacionales, Stomaged sigue siendo una pieza clave en la alineación de SUP. Y ahora, con un trofeo de campeonato de la TCL y un título IWCI, Stomaged participará en el Mid-Season Invitational 2016 con toda la seguridad y confianza a cuestas.</p>","fr_FR":"Furkan « Stomaged » Güngör est le jungler de SuperMassive eSports. Il revient au Mid-Season Invitational après une première participation en 2016. Stomaged est un jungler polyvalent, il a joué 10 champions uniques lors du segment d'hiver de la TCL 2017. Mais il est le plus à son aise avec des champions de début de partie puissants comme Rek’Sai et Lee Sin. Après une performance médiocre à l'événement de l'an dernier, il tentera de se racheter face aux meilleurs junglers du monde, au Brésil.","es_ES":"Furkan ''Stomaged'' Güngör es el jungla de SuperMassive eSports. Este es su segundo viaje al Mid-Season Invitational tras su visita de 2016. Stomaged es un jungla versátil: ha jugado con 10 campeones diferentes en el split de invierno de la TCL 2017. No obstante, destaca especialmente con campeones fuertes al principio de la partida, como Rek’Sai o Lee Sin. Tras su pobre actuación en el evento del año pasado, intentará aprovechar al máximo su nueva oportunidad internacional contra los mejores junglas del mundo en Brasil.","de_DE":"Furkan „Stomaged“ Güngör ist der Jungler von SuperMassive eSports. Er nimmt nach 2016 bereits zum zweiten Mal am Mid-Season Invitational teil. Stomaged ist ein vielseitiger Jungler, der im Winter-Split der TCL zehn verschiedene Champions spielte. Am wohlsten fühlt er sich aber mit Champions wie Rek’Sai und Lee Sin, die vor allem im frühen Spiel stark sind. Nach einer schwachen Vorstellung im letzten Jahr wird er in diesem Jahr in Brasilien beweisen wollen, dass er mit den besten Junglern der Welt mithalten kann.","pl_PL":"Furkan „Stomaged” Güngör jest dżunglerem SuperMassive eSports. To jego druga wyprawa na Mid-Season Invitational po pojawieniu się na turnieju w 2016 roku. Stomaged to wszechstronny dżungler, który grał 10 różnymi bohaterami podczas zimowego splitu TCL 2017. Jednak najpewniej czuje się, grając bohaterami silnymi we wczesnej fazie gry, takimi jak Rek’Sai i Lee Sin. Po kiepskim występie na zeszłorocznym turnieju nie może się doczekać kolejnej okazji, by zmierzyć się z najlepszymi dżunglerami świata w Brazylii.","pt_BR":"<p>Furkan \"Stomaged\" Güngör é o caçador da SuperMassive eSports. Ele fará sua segunda viagem ao Mid-Season Invitational depois de participar em 2016. Stomaged é um caçador versátil, que jogou com 10 Campeões diferentes na Etapa de Inverno da TCL 2017. Mas ele se sente mais em casa com Campeões fortes já no início do jogo, como Rek’Sai e Lee Sin. Depois de um desempenho ruim no evento do ano passado, ele está ansioso para ter outra chance de ser um dos melhores caçadores do mundo no Brasil.</p>","tr_TR":"Furkan \"Stomaged\" Güngör Şampiyonluk Ligi’nin en değerli ormancılarından biri. Eskiden en değerli üst koridorlardan biri olan Stomaged, 2013 Sezonu dereceli sırasında Ustalık seviyesine özellikle üst koridorda yaptığı Shen oyunlarıyla çıkan ilk oyunculardan biri olmuştu. HWA’da profesyonel kariyerine başlayan Stomaged, HWA’dan sonra AWH ve Ahraz Esports takımlarında da oynadı. HWA’ya geri dönmesiyle beraber orman rolüne geçen Stomaged, fabFabulous ile beraber rakiplerinin korkulu rüyası haline geldi. Yeni kurulan süper takım BAUSuperMassive eSports’ta da bu performansıyla kendine yer bulan Stomaged kendini giderek daha çok geliştirdi ve en iyi yerli ormancı unvanını Crystal’dan almayı başardı. BAUSuperMassive kadrosuyla 2016 ve 2017 KMF’yi kazanan ve 2016 IWCI’yi kazanarak 2016 MSI’a giden Stomaged, bu turnuvada dünyaca ünlü SKT takımından Baron çalarak büyük sükse yaptı. Bu mevsime de orman rolünde Stomaged ile devam eden BAUSuperMassive’in rakipleri beklenmeyen baskınlar için hazır olmalı.\n <br><br>\nEn iyi oynadığı rolü değiştirip yeni rolünde de en iyilerden biri olan Stomaged tam bir başarı hikayesi... Yine de özellikle yurt dışı maçlarda hâlâ diğer ormancılara göre bazı temel eksiklikleri olduğu göze çarpıyor. Bu eksiklerini kapatabilirse fabFabulous, Naru ve Zeitnot gibi isimlere rağmen BAUSuperMassive’in bu mevsim en büyük yıldızı haline gelebilir.\n"},"foreignIds":{"TRLT3":"200000086","ESPORTSTMNT03":"200001301","ESPORTSTMNT04":"200001534"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1420,"slug":"zeitnot","name":"Zeitnot","firstName":"Berkay","lastName":"Aşıkuzun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zeitnot-c7w21tyy.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-01-02","createdAt":"2016-08-22T15:00:06.000Z","updatedAt":"2017-07-21T14:59:37.000Z","bios":{"en_US":"<p>Berkay \"Zeitnot\" Aşıkuzun is the AD carry for SuperMassive eSports. After playing alongside Naru on Dark Passage beginning in 2015, Zeitnot joined SuperMassive to start the 2017 season. During the regular season, he thrived in the lethality meta, going undefeated in 11 games as Varus and Jhin. As the only current member of SuperMassive who didn’t attend the 2016 Mid-Season Invitational, Zeitnot will be making his first international appearance in Brazil. He’ll need to find his footing on a new set of champions if he wants to make it through the Play-In stage and beyond.</p>","de_DE":"Berkay „Zeitnot“ Aşıkuzun ist der AD-Carry von SuperMassive eSports. Zeitnot begann seine Karriere 2015 zusammen mit Naru bei Dark Passage, wechselte zu Beginn der Saison 2017 aber zu SuperMassive. Dank des neuen „Tödlichkeitsfaktor“-Metaspiels blühte er in der regulären Saison auf und schaffte es mit Varus und Jhin, elf Spiele lang ungeschlagen zu bleiben. Da Zeitnot das einzige Mitglied von SuperMassive ist, das nicht beim Mid-Season Invitational 2016 war, wird er in Brasilien sein Debüt auf der internationalen Bühne geben. Er wird sich jedoch mit neuen Champions zurechtfinden müssen, wenn er die Vorrundenphase überstehen will.","es_ES":"Berkay ''Zeitnot'' Aşıkuzun es el ADC de SuperMassive eSports. Tras jugar junto a Naru en Dark Passage al comienzo de 2015, Zeitnot se unió a SuperMassive a comienzos de la temporada 2017. Durante la temporada regular, destacó en el metajuego de la letalidad: consiguió mantenerse 11 partidas invicto con Varus y Jhin. Zeitnot es el único miembro actual de SuperMassive que no asistió al Mid-Season Invitational 2016, por lo que su viaje a Brasil será su primera aparición internacional. Tendrá que aprender a jugar con nuevos campeones si quiere superar la fase de apertura y llegar hasta lo más alto.","fr_FR":"Berkay « Zeitnot » Aşıkuzun est le carry AD de SuperMassive eSports. Après avoir joué aux côtés de Naru chez Dark Passage à partir de 2015, Zeitnot a rejoint SuperMassive au début de la saison 2017. Pendant la saison régulière, il a excellé dans la méta létalité, restant invaincu pendant 11 parties avec Varus et Jhin. Seul membre actuel de SuperMassive n'ayant pas participé au Mid-Season Invitational 2016, Zeitnot fera sa première apparition internationale au Brésil. Il devra donc trouver ses marques avec un nouvel ensemble de champions s'il veut dépasser la phase de qualifications.","pl_PL":"Berkay „Zeitnot” Aşıkuzun jest prowadzącym SuperMassive eSports. Już na początku 2015 roku grał z Naru w Dark Passage Zeitnot, a sezon 2017 rozpoczął, dołączając do SuperMassive. W sezonie zasadniczym rozwinął skrzydła w stanie gry opartym na Destrukcji, nie ponosząc porażki w 11 grach jako Varus i Jhin. Jako jedyny z obecnych członków SuperMassive, który nie wziął udziału w Mid-Season Invitational 2016, Zeitnot po raz pierwszy pojawi się przed międzynarodową widownią w Brazylii. Jeśli chce przebić się przez rundę wstępną i dotrzeć dalej, będzie musiał oprzeć grę na nowym zestawie bohaterów.","pt_BR":"<p>Berkay \"Zeitnot\" Aşıkuzun é o carregador da SuperMassive eSports. Depois de jogar ao lado de Naru na Dark Passage no início de 2015, Zeitnot entrou para a SuperMassive no início da temporada de 2017. Durante a temporada regular, ele teve êxito na meta da Letalidade, conseguindo sair invicto em 11 jogos como Varus e Jhin. Ele é o único membro atual da SuperMassive que não participou do Mid-Season Invitational 2016 e fará sua primeira aparição internacional no Brasil. Ele vai precisar se virar com um novo conjunto de Campeões se quiser passar pela Fase de Entrada e além.</p>","tr_TR":"Berkay \"Zeitnot\" Aşıkuzun Şampiyonluk Ligi’ndeki en yetenekli nişancılardan biri. Kısa süreli Ahraz Gaming macerası dışında uzun yıllar HWA’da kalan Zeitnot kendini Şampiyonluk Ligi’nin en korkulan nişancılarından biri olarak kanıtladı. HolyPhoenix sonrası nişancı rolünde sıkıntı yaşayan Dark Passage’a transfer olan Zeitnot kısa sürede burada da yeteneklerini sergilemeye başladı. Kariyerinin en başarılı yıllarını Dark Passage formasıyla geçiren Zeitnot, son olarak 2016 TBF Şampiyonu olarak 2016 IWCQ’ya katıldı ve 2016 IWCA’da da nişancı pozisyonunda ülkemizi temsil etti. Geçtiğimiz mevsimde BAUSuperMassive eSports’un 5 yerli isimli kadrosunda yer alan Zeitnot şimdiye kadarki en iyi mevsimini geçirdi.\n <br><br>\nBeraber oynadığı Dumbledoge’un ayrılması ve pek fazla tecrübesi olmayan destek Tolerant’ın gelmesiyle Zeitnot için yepyeni bir macera başlıyor. Kendini çoktan kanıtlamış nişancı bu zorlukları rahatlıkla aşacaktır ve MSI ön elemelerinde sergilediği herkesi büyüleyen performansa kaldığı yerden devam edecektir.\n"},"foreignIds":{"ESPORTSTMNT03":"200001255","TRLT3":"200000030","ESPORTSTMNT04":"200001536"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1421,"slug":"rogu","name":"Rogu Sama","firstName":"Burak","lastName":"Eryol","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rogu-1z5rl0lr.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-06-13","createdAt":"2016-08-22T15:03:26.000Z","updatedAt":"2017-07-21T15:07:51.000Z","bios":{"en_US":"","tr_TR":"Burak \"Rogu sama\" Eryol Şampiyonluk Ligi’nin en tecrübeli destek oyuncularından biri. Profesyonel oyuna BPI ve ANT Gaming takımlarıyla başlasa da Oyunhizmetleri’yle Şampiyonluk Ligi’ne dönene kadar bir süre üst ligden uzak kaldı. Oyunhizmetleri’nde gösterdiği performans sonrası Ruvelius ile Immortoru’nun Şampiyonluk Ligi’nin en korkulan ikililerinden biri haline gelmesini sağlayan gizli kahraman Rogu sama, bir sonraki mevsim Beşiktaş.Oyunhizmetleri’nin KMF oynayan kadrosunda yer aldı. SL i-League turnuvasında da birinci olarak ülkemizi başarıyla temsil eden Beşiktaş.Oyunhizmetleri, aynı başarıyı Şampiyonluk Ligi’nde gösteremedi. Bir sonraki mevsim, mevsim finallerinde Dark Passage’a transfer olan Rogu sama özellikle TBF’de rakip destek Dumbledoge’u kilitleyerek takımının şampiyon olmasında büyük katkı sahibi oldu. Geçtiğimiz mevsim aynı performansı gösteremeyen Rogu bu mevsim Galakticos formasıyla ter dökecek.\n <br><br>\nYeni mevsimde Zeitnot, HolyPhoenix ve Ruve sama yerine tecrübesiz bir oyuncu olan meân ile oynayacak olan Rogu sama’nın artık işi daha zor. Bu mevsimde tank destek şampiyonlar metada kendisine yer bulursa Rogu sama’nın işi oldukça kolaylaşacaktır. Bu mevsime en iddialı kadrolardan biriyle giren Galakticos eğer TBF’de yer almak istiyorsa desteklerinin sergileyeceği performansa çok ihtiyaçları olacak.\n"},"foreignIds":{"ESPORTSTMNT03":"200001237"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1491,"slug":"levi","name":"Levi","firstName":"Duy Khanh","lastName":"Do","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/levi-ck1xccz8.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-12-05T18:12:25.000Z","updatedAt":"2017-05-13T18:50:58.000Z","bios":{"en_US":"<p>Duy Khanh “Levi” Do is one of the most promising young talents in Southeast Asia. He began his career in 2015 as a mid laner for SkyRed, but later made the switch to jungling. While his role changed, his affinity for playing assassins in the mid lane still shapes his playstyle as a jungler. He dominated with Kha’Zix in several games at the 2016 International Wildcard All-Star Event, showing off the potential of the newly-reworked Voidreaver. Levi has settled easily into the current meta where carry junglers are the picks of choice. He excels at deleting the opposition with ease, whether that be a shotgun to the face as Graves or making mincemeat of a squishy on Rengar, he can do it all. Levi also played a key defensive role in the tense base race against the TCL All-Stars. If his past performance is any indication, we’re in for a wild ride in Brazil. Buckle up!</p>","de_DE":"Duy Khanh „Levi“ Do ist eines der größten jungen Talente in Südostasien. Levi startete seine Karriere im Jahr 2015 als Mid-Laner für SkyRed, wechselte aber später in den Dschungel. Obwohl er seine Rolle gewechselt hat, ändert sich nichts an seiner Vorliebe für Assassinen auf der mittleren Lane, die weiterhin seinen Stil im Dschungel beeinflusst. Beim IWCA 2016 dominierte er mit Kha’Zix mehrere Spiele und zeigte dabei das Potenzial des überarbeiteten Räubers der Leere. Levi gewöhnte sich schnell an das neue Metaspiel, in dem Carry-Jungler die erste Wahl sind. Er kann seine Gegner mit Leichtigkeit unschädlich machen, egal ob er ihnen mit Graves die Waffen an die Schläfe hält oder sie mit Rengar zu Hackfleisch verarbeitet. Außerdem spielte Levi eine entscheidende Rolle im knappen Wettrennen um die Basen gegen die TCL-All-Stars. Gemessen an seinen alten Vorstellungen dürfte uns in Brasilien eine wilde Reise bevorstehen. Wir sollten uns wohl besser anschnallen!","es_ES":"Duy Khanh ''Levi'' Do es uno de los jóvenes talentos más prometedores del sudeste asiático. Comenzó su trayectoria en 2015 como mid de SkyRed, pero más tarde se cambiaría a la posición de jungla. Aunque su rol cambió, su afinidad con los asesinos en mid dio forma a su estilo de juego en la jungla. Dominó con Kha'Zix en varias partidas del International Wildcard All-Star Event de 2016, demostrando el potencial del recién actualizado Saqueador del Vacío. Levi se ha adaptado fácilmente al metajuego actual, en el que los junglas carry son habituales. Tiene grandes dotes para machacar al oponente sin dificultad alguna, ya sea con un disparo a la cara con Graves o haciendo carne picada de los más débiles con Rengar. Él puede con todo. Levi también cumplió un papel defensivo clave en la tensa carrera hacia la base contra los All-Stars de TCL. Si sigue en sus trece, ya podemos prepararnos para otra tensa carrera en Brasil. ¡Abrochaos los cinturones!","es_AR":"<p><strong>Duy Khanh \"Levi\" Do</strong> es uno de los talentos jóvenes más prometedores del Sureste de Asia. Comenzó su carrera en 2015 como carrilero central en SkyRed, pero más tarde cambió a junglero. Aunque cambió su papel, su gusto por jugar con asesinos en el carril central sigue definiendo su estilo de juego como junglero. En el International Wildcard All-Star Event 2016 dominó con Kha'Zix en varias partidas, demostrando así el potencial del recientemente modificado Saqueador del Vacío. <strong>Levi</strong> se ha adaptado fácilmente al metajuego en el cual los jungleros acarreadores son la elección principal. Es experto en acabar con el enemigo fácilmente, ya sea con una escopeta en la cara como Graves o haciendo carne molida a un enemigo débil con Rengar. Él puede con todo. <strong>Levi</strong> también tuvo un papel defensivo clave en el <a href=\"https://youtu.be/d7AIGccpe2c?t=3509\" target=\"_blank\">tenso torneo</a> contra los All-Stars de TCL. Si su desempeño en el pasado se puede considerar como una señal, podemos esperar un buen espectáculo en Brasil. ¡Abróchense los cinturones!</p>","fr_FR":"Duy Khanh « Levi » Do est l'un des jeunes talents les plus prometteurs d'Asie du Sud-Est. Il a commencé sa carrière en 2015 en tant que midlaner pour SkyRed, avant de passer au rôle de jungler. Malgré ce changement, il adore jouer les assassins sur la voie du milieu et cette passion influence son style de jeu en tant que jungler. Il a dominé avec Kha’Zix dans plusieurs parties de l'événement All-Stars IWC 2016, montrant le potentiel du Faucheur du Néant suite à sa récente refonte. Levi s'est adapté facilement à la méta actuelle où les junglers carrys sont les choix privilégiés. Il sait se débarrasser de l'opposition comme personne, que ce soit à coups de fusil avec Graves ou en réduisant ses victimes en bouillie avec Rengar – il sait tout faire. Levi a également joué un rôle défensif clé dans la course tendue pour assiéger la base ennemie contre les All-Stars des TCL. Étant donné ses performances passées, le spectacle devrait valoir le détour au Brésil. Accrochez vos ceintures !","pl_PL":"Duy Khanh „Levi” Do jest jednym z najbardziej obiecujących młodych talentów z Azji Południowowschodniej. Rozpoczął karierę jako środkowy w SkyRed w 2015 r., ale później przeszedł na dżunglowanie. Chociaż jego rola się zmieniła, nawyk grania zabójcami na środkowej alei wciąż ma wpływ na jego styl gry na pozycji dżunglera. Dominował, grając Kha’Zixem w kilku grach podczas wydarzenia International Wildcard All-Star 2016, pokazując potencjał dopiero co odświeżonego Łowcy Pustki. Levi łatwo dopasował się do aktualnego stanu gry, zgodnie z którym najchętniej wybiera prowadzących dżunglerów. Szybko i bez wysiłku kasuje przeciwników, czy to strzelając im w twarz jako Graves, czy robiąc z nich mielonkę jako Rengar. Potrafi wszystko. Levi odegrał także kluczową rolę defensywną w zaciętym wyścigu do bazy przeciwko All-Stars z TCL. Jego wcześniejsze występy pokazują, że w Brazylii czeka nas szalona jazda. Zapnijcie pasy!","es_MX":"Duy Khanh ''Levi'' Do es uno de los jóvenes talentos más prometedores del Sudeste Asiático. Este chico de 19 años comenzó su trayectoria el año pasado como central de SkyRed, pero más tarde se cambiaría a la posición de la jungla. Aunque su rol cambió, su afinidad con los asesinos centrales dio forma a su estilo de juego en la jungla. Dominó con Kha'Zix en varias partidas en el International Wildcard All-Star Event 2016, demostrando el potencial del recién actualizado Saqueador del Vacío. Levi también cumplió un papel defensivo clave en <a href=\"https://www.youtube.com/watch?v=Xje30TIdRPE&feature=youtu.be&t=1h4m54s\">tensa carrera hacia la base </a> contra los All-Stars de TCL. Si esas actuaciones quieren decir algo, está claro que habrá caos en Barcelona.","el_GR":"","en_PL":"","cs_CZ":"","pt_BR":"<p>Duy Khanh \"Levi” Do é um dos talentos mais jovens e promissores do sudeste asiático. Ele começou sua carreira em 2015 como jogador da rota do meio para a SkyRed, mas acabou mudando para a Selva. Embora tenha mudado de função, sua afinidade com os assassinos da rota do meio ainda definem seu estilo de jogo como Caçador. Durante o International Wildcard All-Star 2016, ele dominou diversas partidas com seu Kha’Zix, mostrando todo o potencial do reformulado Ceifador do Vazio. Levi se encaixou fácil na meta atual, em que os caçadores da selva são a bola da vez. Ele é capaz de eliminar a oposição com facilidade, seja com uma arma na cara como Graves ou fazendo picadinho como Rengar. Ele faz de tudo. Levi também teve um papel defensivo fundamental na corrida pela base inimiga contra a TCL All-Stars. Apertem os cintos!</p>"},"foreignIds":{"TRLH3":"1001360037","TRLH4":"1001310037","TRLT3":"200000048","TRLH1":"200000443","TRLH2":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1864,"slug":"tolerant","name":"Tolerant","firstName":"Barış","lastName":"Çepnioğlu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tolerant-9q5v56mb.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-04-14T10:25:19.000Z","updatedAt":"2017-07-21T14:38:44.000Z","bios":{"en_US":"","tr_TR":"Almanya doğumlu Türk oyuncu, profesyonel arenaya adım atalı henüz bir buçuk ay olmasına karşın en prestijli iki Türk ekibinin formasını giymeyi başardı. İlk olarak Dark Passage.BKM Express’te HolyPhoenix’in yanında görev alan genç destek, şimdi ise BAUSuperMassive’de Zeitnot’un partneri olacak.<br><br>\nTolerant’ın doldurması gereken boşluk da, üzerindeki sorumluluk da çok büyük. Takımın yıldız desteği Dumbledoge’un yerini alacak genç oyuncunun sürekli selefiyle karşılaştırılması kaçınılmaz gibi duruyor. Her ne kadar BAUSuperMassive’in makro oyununa sağlayacağı uyum merak konusu olsa da, en iyilerle çalışma fırsatına sahip olamsı Tolerant'ın uyum sürecini hızlandıracaktır."},"foreignIds":{"ESPORTSTMNT03":"200001460","ESPORTSTMNT04":"200002914"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1885,"slug":"sergh","name":"Sergh","firstName":"Nam Loc","lastName":"Lieu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sergh-7st1or6f.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:39:00.000Z","updatedAt":"2017-05-09T19:16:02.000Z","bios":{},"foreignIds":{"TRLT3":"200000052","TRLH1":"200000447"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1886,"slug":"slay","name":"Slay","firstName":"Ngoc Hung","lastName":"Nguyen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/slay-ctubpw87.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:43:39.000Z","updatedAt":"2017-05-13T18:49:40.000Z","bios":{"en_US":"<p>Ngoc Hung \"Slay\" Nguyen started his career in 2014 as a part of G5 E-Sport Fate Team. He eventually helped the Saigon Jokers to a Vietnam Championship Series A victory in 2016 before jumping on the opportunity to becomes GIGABYTE Marines’ starting AD Carry in December of 2016. Since then, he’s helped the team tear through the competition on their way the 2017 Mid-Season Invitational. He’ll have to prove that he’s got what it takes to gunsling with the best as he hits the international stage for the first time in his career in Brazil.</p>","pl_PL":"Ngoc Hung „Slay” Nguyen zaczął karierę w 2014 roku jako część G5 E-Sport Fate Team. Ostatecznie pomógł Saigon Jokers zdobyć zwycięstwo w Vietnam Championship Series A w 2016 roku, a potem skorzystał z okazji, by stać się prowadzącym w pierwszym składzie Marines Esports, w grudniu 2016 roku. Od tamtego czasu pomagał drużynie przebijać się przez konkurencję w drodze do Mid-Season Invitational 2017. Będzie musiał dowieść, że jest w stanie pojedynkować się z najlepszymi, gdy po raz pierwszy w swojej karierze wkroczy na międzynarodową arenę w Brazylii.","fr_FR":"Ngoc Hung « Slay » Nguyen a commencé sa carrière en 2015 au sein de G5 E-Sport Fate Team. Il a ensuite contribué à la victoire des Saigon Jokers dans les Vietnam Championship Series A en 2016 avant de sauter sur l'occasion de devenir le carry AD titulaire de Marines Esports en décembre 2016. Depuis, il a aidé l'équipe à pulvériser la concurrence sur la route du Mid-Season Invitational 2017. Lorsqu'il montera sur la scène internationale pour la première fois de sa carrière au Brésil, il devra prouver qu'il est au niveau des meilleurs.","es_ES":"Ngoc Hung ''Slay'' Nguyen comenzó su trayectoria en 2014 como parte de G5 E-Sport Fate Team. Poco después, ayudó a que Saigon Jokers ganase la Championship Series A en 2016, y no tardaría en surgirle la oportunidad de ocupar el puesto de ADC titular de Marine Esports en diciembre de 2016. Desde entonces, ha ayudado a que su equipo se abra paso en la competición hasta llegar al Mid-Season Invitational 2017. Tendrá que demostrar que tiene lo que hace falta para medirse ante los mejores en su primera aparición en el escenario internacional en Brasil.","de_DE":"Ngoc Hung „Slay“ Nguyen begann seine Karriere 2014 bei G5 E-Sport Fate Team. 2016 verhalf er Saigon Jokers zum Titel in der vietnamesischen Championship Series, bevor er im Dezember 2016 die Gelegenheit ergriff, zu Marines Esports zu wechseln. Seither half er der Mannschaft dabei, die Konkurrenz aus dem Weg zu räumen und sich für das Mid-Season Invitational 2017 zu qualifizieren. Wenn er in Brasilien zum ersten Mal in seiner Karriere die internationale Bühne betritt, wird er beweisen müssen, dass er es mit den Besten der Welt aufnehmen kann.","es_AR":"<p><strong>Minh Nhut \"Archie\" Tran</strong> es el genio detrás de los Marines Esports. Siendo tirador en el pasado con los Saigon Jokers, <strong>Archie</strong> se volvió conocido por su refinado estilo con Ezreal. No contento con ser tirador, también probó suerte en el carril superior. Como uno de los pocos jugadores que ha jugado a nivel profesional en tres posiciones distintas, <strong>Archie</strong> ha acumulado una gran cantidad de conocimiento acerca del juego. <strong>Archie</strong> logra un gran equilibrio cuando funge como mente maestra al crear jugadas desde su posición de soporte. Si bien <strong>Optimus</strong> y <strong>Levi</strong> se llevan todos los reflectores, <strong>Archie</strong> mueve los hilos silenciosamente desde atrás para llevar a los Marines a la gloria. Espera poder orquestar más victorias en su camino hacia Brasil para su primer enfrentamiento contra competidores de talla internacional.</p>","pt_BR":"<p>Ngoc Hung \"Slay\" Nguyen começou sua carreira em 2014 como parte da G5 E-Sport Fate Team. Por fim, ele ajudou a Saigon Jokers a vencer o Temporada de Primavera do Campeonato de Série A do Vietnã antes de embarcar na oportunidade de se tornar Carregador dos Marines Esports em dezembro de 2016. Desde então, ele ajudou sua equipe a atropelar a competição rumo ao Mid-Season Invitational 2017. Ele terá de provar que é capaz de disputar com os melhores no cenário internacional pela primeira vez na carreira.</p>"},"foreignIds":{"TRLT3":"200000050","TRLH1":"200000445","TRLH2":"200000345"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1887,"slug":"stark","name":"Stark","firstName":"Cong Minh","lastName":"Phan","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stark-9hy5qaf.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:45:11.000Z","updatedAt":"2017-05-13T18:52:38.000Z","bios":{"en_US":"<p>Cong Minh \"Stark\" Phan is extremely new to the Rift. The 19-year-old started his professional career just a couple of months ago when he joined up with Vietnam’s best team, the GIGABYTE Marines. He was noticed by the team due to his exceptional performance on the Vietnamese solo queue ladder. Even though he’s the team’s newest addition, he’s fit in just fine with their high octane style, excelling on top lane bullies like Renekton and Rumble. Look for Stark to make a name for himself as he and the Marines fight to put their region on the map at the 2017 Mid-Season Invitational.</p>","de_DE":"Cong Minh „Stark“ Phan ist ein absoluter Neuling in der Kluft. Der 19-jährige begann seine professionelle Karriere erst vor ein paar Monaten, als er bei der besten Mannschaft Vietnams, Marines Esports, anheuerte. Die Mannschaft wurde aufgrund seiner herausragenden Leistung in der vietnamesischen Solo-Warteschlange auf ihn aufmerksam. Obwohl er das neueste Mitglied der Mannschaft ist, passt er perfekt zum kraftvollen Stil seiner Kameraden und liefert auf der oberen Lane überragende Leistungen mit Champions wie Renekton und Rumble ab. Stark will sich einen Namen machen und wird zusammen mit den Marines versuchen, beim Mid-Season Invitational 2017 Eindruck zu hinterlassen.","es_ES":"Cong Minh ''Stark'' Phan es todo un principiante en la Grieta. Este jugador de 19 años comenzó su carrera profesional hace tan solo un par de meses, cuando fue fichado por el mejor equipo de Vietnam, Marines Esports. El equipo se percató de su potencial tras observar su excepcional actuación en la cola en solitario vietnamita. Aunque es el fichaje más reciente del equipo, encaja perfectamente con su estilo acelerado, y destaca con los matones de la calle superior como Renekton y Rumble. Que a nadie le extrañe que Stark se haga valer cuando él y los Marines luchen por poner a su región en el mapa durante el Mid-Season Invitational 2017.","fr_FR":"Cong Minh « Stark » Phan est un nouveau venu dans la Faille. Le joueur de 19 ans a commencé sa carrière professionnelle il y a à peine deux mois lorsqu'il a rejoint la meilleure équipe vietnamienne, Marines Esports. Il a été repéré par l'équipe grâce à sa performance exceptionnelle dans le classement de la file solo du Vietnam. Même s'il est le petit dernier de l'équipe, il correspond parfaitement à son style explosif, excellant sur la voie du haut avec des brutes comme Renekton et Rumble. Stark cherchera sans doute à se faire un nom avec les Marines en tentant de marquer l'histoire au Mid-Season Invitational 2017.","pl_PL":"Cong Minh „Stark” Phan jest naprawdę nowy na Summoner’s Rift. Ten 19-latek rozpoczął swoją profesjonalną karierę dopiero kilka miesięcy temu, gdy dołączył do najlepszej drużyny Wietnamu, Marines Esports. Został zauważony przez drużynę dzięki swojej wyjątkowej grze na wietnamskiej drabince kolejki solo. Chociaż jest najnowszym uzupełnieniem drużyny, doskonale dopasował się do jej żywiołowego stylu. Najlepiej gra górnymi osiłkami, takimi jak Renekton i Rumble. Spodziewajcie się, że Stark zdobędzie rozgłos dla siebie, gdy razem z Marines będzie walczył na Mid-Season Invitational 2017 o zaznaczenie swojego regionu na mapie.","es_AR":"<p><strong>Cong Minh \"Stark\" Phan</strong> es muy muy nuevo en la Grieta. Este chico de 19 años comenzó su carrera profesional hace un par de meses cuando se unió al mejor equipo de Vietnam, los Marines Esports. El equipo lo notó gracias a su desempeño excepcional en la cola individual de Vietnam. Aunque es el agregado más reciente al equipo, se ha acoplado más que bien con el estilo de alto octanaje y es experto en el carril superior con matones como Renekton y Rumble. No le quites el ojo a <strong>Stark</strong> mientras busca ganarse un lugar cuando él y los Marines peleen para poner a su región en el mapa en el Mid-Season Invitational 2017.</p>","pt_BR":"<p>Cong Minh \"Stark\" Phan é um recém-chegado no Rift. O jovem de 19 anos iniciou sua carreira profissional há poucos meses, quando entrou para a melhor equipe do Vietnã, a Marines. Ele foi visto pela equipe devido ao seu excepcional desempenho na classificação solo do Vietnã. Apesar de ser o integrante mais recente da equipe, ele se encaixou muito bem com seu estilo agressivo, demonstrando excelência com brutamontes da rota superior como Renekton e Rumble. Vejamos se Stark coloca o seu nome no mapa ao mesmo tempo em que os Marines lutam para dar destaque à sua região no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000047","TRLH1":"200000442","TRLH2":"200000342"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1925,"slug":"secaf","name":"Secaf","firstName":"Sercan","lastName":"Çevikoğlu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/secaf-i0wakbms.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-05-29T04:37:58.000Z","updatedAt":"2017-07-21T14:43:49.000Z","bios":{},"foreignIds":{"ESPORTSTMNT04":"200002635"},"socialNetworks":{},"champions":[],"liveGameTeam":199}],"scheduleItems":[{"id":"AVt-tz4SoUG4HPFjOKNQ","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:fc04ee4c-7966-4831-a26a-bf8b689477f9","scheduledTime":"2017-05-06T18:00:00.411+0000","tags":{"blockLabel":"Round 3","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:9e7b7b4d-ba7c-458c-ae7b-b7d188480035","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"fc04ee4c-7966-4831-a26a-bf8b689477f9","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"9e7b7b4d-ba7c-458c-ae7b-b7d188480035","league":"10"}],"gameIdMappings":[{"id":"86039aff-9c94-42a7-8d80-92c46bd24c6f","gameHash":"b8824ac6f54594bd"},{"id":"836fa4d9-de88-446d-8bad-fabe211de35f","gameHash":"ee5bbd8bf9256442"},{"id":"9af9cf99-119b-4b2a-a39d-86a916caf310","gameHash":"70f1912f2a3e3f1f"},{"id":"14bf8a0e-bea2-4e34-9327-a43fe7d89f25","gameHash":"bc2eac000c32076d"}],"videos":[{"id":6793,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:86039aff-9c94-42a7-8d80-92c46bd24c6f","source":"https://www.youtube.com/embed/XFMhKRrScVA?wmode=transparent","createdAt":"2017-05-06T19:52:07.000Z","updatedAt":"2017-05-06T19:52:07.000Z","game":"86039aff-9c94-42a7-8d80-92c46bd24c6f"},{"id":6794,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:9af9cf99-119b-4b2a-a39d-86a916caf310","source":"https://www.youtube.com/embed/E0P2bNBMnw4?wmode=transparent","createdAt":"2017-05-06T20:45:49.000Z","updatedAt":"2017-05-06T20:45:49.000Z","game":"9af9cf99-119b-4b2a-a39d-86a916caf310"},{"id":6795,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:86039aff-9c94-42a7-8d80-92c46bd24c6f","source":"https://www.youtube.com/embed/4aCEOq52AW0","createdAt":"2017-05-06T21:10:08.000Z","updatedAt":"2017-05-06T21:10:08.000Z","game":"86039aff-9c94-42a7-8d80-92c46bd24c6f"},{"id":6796,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:9af9cf99-119b-4b2a-a39d-86a916caf310","source":"https://www.youtube.com/embed/tVynTHovUjI","createdAt":"2017-05-06T21:06:20.000Z","updatedAt":"2017-05-06T21:06:20.000Z","game":"9af9cf99-119b-4b2a-a39d-86a916caf310"},{"id":6797,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:14bf8a0e-bea2-4e34-9327-a43fe7d89f25","source":"https://www.youtube.com/embed/WZQNaWLxthM","createdAt":"2017-05-06T21:11:14.000Z","updatedAt":"2017-05-06T21:11:14.000Z","game":"14bf8a0e-bea2-4e34-9327-a43fe7d89f25"},{"id":6798,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:14bf8a0e-bea2-4e34-9327-a43fe7d89f25","source":"https://www.youtube.com/embed/JFQ2gN999fo?wmode=transparent","createdAt":"2017-05-06T21:27:26.000Z","updatedAt":"2017-05-06T21:27:26.000Z","game":"14bf8a0e-bea2-4e34-9327-a43fe7d89f25"},{"id":6799,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:836fa4d9-de88-446d-8bad-fabe211de35f","source":"https://www.youtube.com/embed/Lms_DKJrk54","createdAt":"2017-05-06T21:30:21.000Z","updatedAt":"2017-05-06T21:30:21.000Z","game":"836fa4d9-de88-446d-8bad-fabe211de35f"},{"id":6800,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:836fa4d9-de88-446d-8bad-fabe211de35f","source":"https://www.youtube.com/embed/C5ZMdk5lIsI?wmode=transparent","createdAt":"2017-05-06T22:45:58.000Z","updatedAt":"2017-05-06T22:45:58.000Z","game":"836fa4d9-de88-446d-8bad-fabe211de35f"},{"id":6959,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:9af9cf99-119b-4b2a-a39d-86a916caf310","source":"https://www.youtube.com/embed/1IVI5DSxYy4","createdAt":"2017-05-29T03:40:07.000Z","updatedAt":"2017-05-29T03:40:43.000Z","game":"9af9cf99-119b-4b2a-a39d-86a916caf310"},{"id":6960,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:86039aff-9c94-42a7-8d80-92c46bd24c6f","source":"https://www.youtube.com/embed/sKcf5L_H4AY","createdAt":"2017-05-29T03:40:33.000Z","updatedAt":"2017-05-29T03:40:33.000Z","game":"86039aff-9c94-42a7-8d80-92c46bd24c6f"},{"id":6961,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:14bf8a0e-bea2-4e34-9327-a43fe7d89f25","source":"https://www.youtube.com/embed/ec0xrNzhOfM","createdAt":"2017-05-29T03:41:09.000Z","updatedAt":"2017-05-29T03:41:09.000Z","game":"14bf8a0e-bea2-4e34-9327-a43fe7d89f25"},{"id":6962,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:836fa4d9-de88-446d-8bad-fabe211de35f","source":"https://www.youtube.com/embed/YffZXPrJ5eY","createdAt":"2017-05-29T03:41:21.000Z","updatedAt":"2017-05-29T03:41:21.000Z","game":"836fa4d9-de88-446d-8bad-fabe211de35f"}],"htmlBlocks":[],"match":{"id":"fc04ee4c-7966-4831-a26a-bf8b689477f9","name":"R3M1","position":0,"state":"resolved","groupPosition":1,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1},{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],"games":{"9af9cf99-119b-4b2a-a39d-86a916caf310":{"id":"9af9cf99-119b-4b2a-a39d-86a916caf310","name":"G2","generatedName":"GAM|SUP|G2|fc04ee4c79664831a26","input":[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1},{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],"standings":{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}]],"timestamp":1496029422931,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}]],"timestamp":1496029569372,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}]],"timestamp":1494103742500,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}]],"timestamp":1494100401617,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"130368","gameRealm":"TRLT3","platformId":"TRLT3:130368","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"28103ee2-2596-4f73-a218-afe6eb64d39e":{"id":"28103ee2-2596-4f73-a218-afe6eb64d39e","name":"G5","generatedName":"GAM|SUP|G5|fc04ee4c79664831a26","input":[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1},{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"86039aff-9c94-42a7-8d80-92c46bd24c6f":{"id":"86039aff-9c94-42a7-8d80-92c46bd24c6f","name":"G1","generatedName":"GAM|SUP|G1|fc04ee4c79664831a26","input":[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1},{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1496029436513,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494104937436,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494096948556,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120289","gameRealm":"TRLT3","platformId":"TRLT3:120289","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"14bf8a0e-bea2-4e34-9327-a43fe7d89f25":{"id":"14bf8a0e-bea2-4e34-9327-a43fe7d89f25","name":"G3","generatedName":"GAM|SUP|G3|fc04ee4c79664831a26","input":[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1},{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1496029456633,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494106315446,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494105003095,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494103738560,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120290","gameRealm":"TRLT3","platformId":"TRLT3:120290","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"836fa4d9-de88-446d-8bad-fabe211de35f":{"id":"836fa4d9-de88-446d-8bad-fabe211de35f","name":"G4","generatedName":"GAM|SUP|G4|fc04ee4c79664831a26","input":[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1},{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}],"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1496029469691,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494110710201,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe","match":"38def7ed-5bc3-4c81-a54a-b135533209ea","standing":1}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397","match":"3edd5310-15cf-43bf-bbe8-b9d2df671bdf","standing":1}]],"timestamp":1494106244804,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"130370","gameRealm":"TRLT3","platformId":"TRLT3:130370","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496029469691,"source":"bestOf","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496029456633,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496029422931,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496029436514,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496029569372,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1494110710201,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1494106315446,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1494106244805,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}