{"teams":[{"id":168,"slug":"red-canids","name":"Red Canids","guid":"be70ded3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-canids-9by71u8p.png","acronym":"RED","homeLeague":"urn:rg:lolesports:global:league:league:14","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-canids-3ci94wz2.png","createdAt":"2016-01-04T16:14:20.000Z","updatedAt":"2017-06-02T16:54:10.000Z","bios":{"pt_BR":"<p>A Red Canids teve uma jornada árdua até ganhar uma vaga definitiva no Mid-Season Invitational 2017. Anteriormente chamada de INTZ Red, a equipe teve pouco sucesso no CBLOL, terminando em 6º e 7º nas temporadas de verão e de inverno respectivamente. No entanto, a baixa temporada de 2016 trouxe grandes mudanças nos integrantes da equipe. Novos acréscimos incluíram o aclamado atirador brTT, da paiN Gaming, e o meio tockers, previamente da INTZ e-Sports. A nova seleção ficou em segundo na temporada regular e foi para as finais, onde a equipe derrotou a Keyd Stars em uma partida decisiva por 3-0. Como o time da casa no MSI 2017 no Rio, eles querem deixar o país orgulhoso e vão tentar provar seu valor no palco internacional.</p>\n\n<p>Técnico: Ram “Brokenshard” Djemal</p>\n\n\n<h2>Histórico em torneios oficiais</h2>\n<p>\n<ul class=\"esp-team-history\">\n<p><li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2017</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>1º lugar</strong> CBLoL - 1ª Etapa</li>\n    </ul>\n  </li>\n<br></p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2016</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>5º lugar</strong> CBLoL - 1ª Etapa</li>\n      <li><strong>7º lugar</strong> CBLoL - 2ª Etapa</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2015</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>1º lugar</strong> Série de Promoção - 1ª Etapa (INTZ Red)</li>\n      <li><strong>6º lugar</strong> CBLoL - 2ª Etapa (INTZ Red)</li>\n      <li><strong>1º lugar</strong> Série de Promoção - 2ª Etapa (INTZ Red)</li>\n      <li><strong>5-8º lugar</strong> CBLoL - Pós-Temporada (INTZ Red)</li>\n    </ul>\n  </li>\n</ul>","en_US":"<p>The Red Canids have overcome a rocky history to convincingly earn a spot at the 2017 Mid-Season Invitational. Formerly INTZ Red, the team initially saw little success in the CBLOL, finishing 5th and 7th in summer and winter, respectively. The 2016 offseason brought massive roster changes. New additions included paiN Gaming’s acclaimed ADC brTT, as well as mid laner Tockers, formerly of INTZ e-Sports. The new roster finished second in the regular season and went on to the finals, where they defeated Keyd Stars in a decisive 3-0 match. As Brazil’s home team for MSI 2017, they’ll look to do their country proud and prove themselves on the international stage.</p>\n\n<p>Coach: Ram “Brokenshard” Djemal</p>","es_AR":"<p>Los Red Canids han superado una escabrosa historia para ganar sin duda alguna su lugar en el Mid-Season Invitational 2017. Antes llamados INTZ Red, el equipo tuvo poco éxito al principio en el CBLOL, terminando en 6&deg; y 7&deg; lugares en verano e invierno, respectivamente. La temporada baja del 2016 trajo consigo un cambio masivo en sus alineaciones. Se incluyeron nuevos miembros en el equipo, como el aclamado tirador <strong>brTT</strong>, así como a <strong>Tockers</strong> en el carril central, antes miembro de INTZ e-Sports. La nueva alineación terminó en segundo lugar en la temporada regular y fue a las finales, donde venció a Keyd Stars con un decisivo 3 a 0. Como el equipo local de Brasil para el MSI 2017, se esforzarán por enorgullecer a su país y probarse a sí mismos en el escenario internacional.</p>","de_DE":"Der Weg war steinig, aber Red Canids konnte überzeugen und sich einen Platz beim Mid-Season Invitational 2017 sichern. Die Mannschaft, die früher als INTZ Red bekannt war, hatte anfangs Probleme in der CBLOL und beendete die letzten beiden Splits auf dem 6. und 7. Platz. In der Nebensaison 2016 gab es jede Menge Veränderungen an der Aufstellung. Zu den Neuzugängen gehören brTT, der umjubelte AD-Carry von paiN Gaming, sowie der ehemalige Mid-Laner von INTZ e-sports, tockers. Die neu formierte Mannschaft beendete die reguläre Saison auf dem zweiten Platz und bahnte sich ihren Weg ins Finale, wo sie die Keyd Stars mit 3–0 besiegten. Die Brasilianer haben beim MSI 2017 in Rio de Janeiro Heimvorteil und werden alles geben, um ihr Land auf der internationalen Bühne stolz zu machen.","en_AU":"","fr_FR":"Les Red Canids ont connu une histoire tumultueuse mais ils s'en sont sorti en réussissant à décrocher leur billet pour le Mid-Season Invitational 2017. Anciennement connue sous le nom INTZ Red, l'équipe a connu, au départ, un succès limité en CBLOL avec une 6e place lors du segment d'été, puis une 7e place lors du segment d'hiver. Au cours de l'intersaison 2016, la formation a subi de nombreux changements. L'ADC de paiN Gaming, le célèbre brTT, ainsi que l'ancien mid-laner d'INTZ e-Sports, Tockers, ont rejoint l'effectif. La nouvelle formation a terminé deuxième de la saison régulière et a pu accéder à la finale, un match épique lors duquel elle a vaincu Keyd Stars avec un score de 3-0. En tant que représentants du Brésil pour le MSI 2017 à Rio de Janeiro, les Red Canids auront à cœur de faire la fierté de leur pays et de démontrer leur niveau sur la scène internationale.","es_ES":"Red Canids ha superado un historial de obstáculos y se ha hecho con un merecido puesto en el Mid-Season Invitational 2017. El equipo, antes conocido como INTZ Red, no obtuvo buenos resultados en la CBLOL en sus inicios, con un sexto y séptimo puesto en el split de verano y de invierno, respectivamente. Durante la pretemporada 2016, la plantilla sufrió un cambio radical. Fichó a jugadores como el aclamado ADC de paiN Gaming, brTT, así como a tockers, el que fuera mid de INTZ e-Sports. La nueva plantilla quedó segunda en la temporada regular y llegó hasta la final, en la que vencieron 3-0 a Keyd Stars en un enfrentamiento decisivo. Como representante de Brasil en el MSI 2017, Red Canids intentará que su país se sienta orgulloso y se pondrá a prueba en el escenario internacional.","pl_PL":"Red Canids w przekonujący sposób pozbyli się etykietki żółtodziobów, dostając się do Mid-Season Invitational 2017. Występująca wcześniej pod nazwą INTZ Red drużyna miała początkowo trudny start w CBLOL ostatecznie zajmując 6 miejsce w sezonie letnim i 7 w zimowym. Po sezonie 2016 roku w składzie drużyny zaszły głębokie zmiany. Nowe nabytki to przejęty z paiN Gaming osławiony prowadzący brTT, a także środkowy tockers z INTZ e-Sports. W nowym składzie drużyna zajęła drugie miejsce podczas sezonu zasadniczego, dostając się do finału, w którym pokonała Keyd Stars podczas rozstrzygającego meczu z wynikiem 3−0. Jako lokalna drużyna z Brazylii podczas MSI 2017 w Brazylii będą chcieli walczyć o honor swojego kraju i sprawdzić się na międzynarodowej arenie."},"foreignIds":{},"players":[421,422,428,465,471,474,1113],"starters":[421,422,428,465,471],"subs":[474,1113]},{"id":199,"slug":"supermassive-esports","name":"BAUSuperMassive eSports","guid":"be7123e9-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-57rm1o9y.png","acronym":"SUP","homeLeague":"urn:rg:lolesports:global:league:league:32","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-1twy6scg.png","createdAt":"2016-04-11T16:37:23.000Z","updatedAt":"2017-07-26T14:57:57.000Z","bios":{"en_US":"<p>SuperMassive eSports formed in 2016 to compete in the Turkish Championship League. They set out to gather some of the best players in the region with the goal of succeeding not only domestically, but also internationally. It took some time for the team to gel, but they eventually earned a spot at the 2016 Mid-Season Invitational.</p>\n\n<p>SuperMassive fell to Dark Passage in the 2016 Summer Season playoffs, failing to earn a shot at attending Worlds. But they’ve bounced back in 2017, earning the TCL Winter title and a spot at the 2017 Mid-Season Invitational in Brazil. They’ll be aiming to improve on their performance at last year’s event, but they’ll have to fight their way through the Play-In first.</p>\n\n<p>Coach: Catalin Daniel “Exorant” Podosu</p>","es_AR":"<p>SuperMassive se formó en Turquía justo antes del inicio de la temporada 2016 del Campeonato Turco de League (TCL), logrando alcanzar un éxito y reconocimiento no solo local, sino internacional. Para conseguir dicho objetivo, han incorporar a los mejores jugadores de Turquía en cada uno de sus respectivas posiciones.</p>\n\n<p>A SUP le tomó un buen tiempo congeniar como equipo y crear una sinergia positive. Sin embargo, su alineación joven tomó forma durante el Torneo de Invierno, en el que derrotaron a Beşiktaş con un marcador de 3-1 durante la final.</p>\n\n<p>El siguiente paso para SuperMassive fue el International Wildcard Invitational 2016, en la Ciudad de México. Tras perder enfrentamientos importantes durante la fase de grupos, el equipo se vio obligado a jugar partidas de desempate. A partir de ese momento, todo funcionó en favor de este equipo. Solo perdieron una partida durante la fase de desempate y eliminatorias, lo que concedió a SUP la oportunidad de representar a Turquía en el MSI 2016.</p>","fr_FR":"SuperMassive eSports a été formée en 2016 pour concourir dans la Turkish Championship League. Plusieurs des meilleurs joueurs de la région ont ainsi été réunis dans le but de réussir à domicile, mais aussi au niveau international. L'équipe a mis un peu de temps à se souder, mais elle a finalement décroché une place pour le Mid-Season Invitational 2016.\n\nSuperMassive s'est ensuite inclinée face à Dark Passage lors des play-offs du segment d'été 2016, manquant sa chance de participer au Mondial. Mais l'équipe a rebondi en 2017, remportant le titre hivernal de la TCL, ainsi qu'une place pour le Mid-Season Invitational 2017 au Brésil. Elle cherchera à présent à améliorer sa performance de l'an dernier, mais elle devra d'abord se frayer un chemin à travers les qualifications.\n\nEntraîneur : Catalin Daniel « Exorant » Podosu\n","es_ES":"SuperMassive eSports se formó en 2016 para competir en la Championship League de Turquía (TCL). Fichó a algunos de los mejores jugadores de la región con el propósito de vencer no solo a nivel local, sino internacional. Les llevó un tiempo adaptarse los unos a los otros, pero finalmente consiguieron hacerse con un puesto en el Mid-Season Invitational 2016.\n\nSuperMassive perdió contra Dark Passage en los playoffs de la temporada de verano de 2016, por lo que no consiguió una plaza para el Mundial. En 2017, llegaron con las pilas cargadas y se han ganado el título de invierno de la TCL, así como su participación en el Mid-Season Invitational 2017 en Brasil. Intentarán mejorar los resultados del evento del año pasado, pero para ello tendrán que superar la fase de apertura.\n\nEntrenador: Catalin Daniel ''Exorant'' Podosu\n","de_DE":"SuperMassive eSports wurde 2016 gegründet, um an der türkischen Championship League teilzunehmen. Die Verantwortlichen versammelten ein paar der besten Spieler der Region, um nicht nur national, sondern auch international erfolgreich zu sein. Es dauerte etwas, bis aus den Spielern eine richtige Mannschaft wurde, aber sie konnten sich dennoch einen Platz beim Mid-Season Invitational 2017 sichern.\n\nSuperMassive verlor in den Entscheidungsspielen der Sommer-Saison 2016 gegen Dark Passage und verpasste damit die Teilnahme an der WM. Aber sie konnten 2017 zurückschlagen, den Winter-Split der TCL gewinnen und sich einen Platz beim Mid-Season Invitational 2017 in Brasilien sichern. Dort werden sie versuchen, ihr Ergebnis vom letzten Jahr zu verbessern, aber dazu müssen sie sich zuerst durch die Vorrundenphase kämpfen.\n\nTrainer: Catalin Daniel „Exorant“ Podosu\n","pl_PL":"SuperMassive eSports powstali w 2016 roku, by podjąć rywalizację w Turkish Championship League. Postanowiono zebrać kilku z najlepszych graczy w regionie, stawiając sobie za cel osiągnięcie sukcesu nie tylko u siebie, ale także na świecie. Zgranie się drużyny zajęło trochę czasu, ale w końcu zdobyli miejsce na Mid-Season Invitational 2016.\n\nW play-offach sezonu letniego 2016 SuperMassive ustąpili Dark Passage, tracąc okazję do udziału w Mistrzostwach. Ale w 2017 roku powrócili, zdobywając tytuł zimy TCL i miejsce na Mid-Season Invitational 2017 w Brazylii. Zapewne zamierzają poprawić swoje wyniki z zeszłorocznego turnieju, ale najpierw będą musieli przebić się przez rundę wstępną.\n\nTrener: Catalin Daniel „Exorant” Podosu\n\n","pt_BR":"<p>A SuperMassive eSports foi formada em 2016 para competir na Turkish Championship League. Eles saíram em busca de alguns dos melhores jogadores da região com o objetivo de vencer não apenas nacionalmente, mas também internacionalmente. Demorou algum tempo para a equipe se entender, mas eles finalmente conquistaram um lugar no Mid-Season Invitational 2016.</p>\n\n<p>A SuperMassive perdeu para a Dark Passage nas eliminatórias da Temporada de Verão 2016, perdendo a chance de participar do Mundial. Mas eles se recuperaram em 2017, ganhando o título da Etapa de Inverno da TCL e um lugar no Mid-Season Invitational 2017 no Brasil. Eles vão tentar se sair melhor do que no evento do ano passado, mas vão precisar vencer a Fase de Entrada primeiro.</p>\n\n<p>Técnico: Catalin Daniel \"Exorant\" Podosu</p>","tr_TR":"Kurulduğu günden itibaren şampiyonluk adayı olma parolasıyla yoluna devam eden BAUSuperMassive eSports şimdiye kadar elde ettiği iki KMF bir IWCI kupasıyla doğru adımlar attığını gösterdi.<br><br>Hedefe kilitlendiği zaman korkulacak bir takım haline gelen SUP, geçtiğimiz sene kaçırdığı TBF kupasını bu sene alabilmek için iletişimi ön planda tuttu ve tamamen yerli oyunculardan oluşan bir kadro kurdu.\n"},"foreignIds":{},"players":[282,285,1210,1420,1421,1864,1925],"starters":[282,285,1210,1420,1421],"subs":[1864,1925]}],"players":[{"id":282,"slug":"naru","name":"Naru","firstName":"Koray","lastName":"Bıçak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/naru-7v36dmtn.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1996-08-27","createdAt":"2014-09-16T21:51:39.000Z","updatedAt":"2017-07-21T15:01:28.000Z","bios":{"en_US":"<p>Koray “Naru” Bıçak is a legend of the Turkish scene. He began his career with Dark Passage in 2013 and finished in first place in all but one split. He left the team last year to join SuperMassive eSports, where he continued his success and earned the chance to play at the 2016 Mid-Season Invitational.</p>\n\n<p>Naru is known for his wide champion pool and ability to pick up a new champion at a moment’s notice. His most played champions in the TCL regular season were Ryze, Corki and LeBlanc -- three unique play styles that he balanced effortlessly. If he wants to perform better at this year’s MSI in Brazil, he might need to pull out something surprising against world class mid laners like Bjergsen and Faker.</p>","es_AR":"<p>Koray 'Naru' Bıçak es el jugador profesional de Turquía más exitoso de todos los tiempos. Naru comenzó su carrera con el afamado equipo Dark Passage, con quien asistió a todas las finales de la TCL desde 2013, perdiendo un solo trofeo durante esta travesía. También cuenta con un amplio repertorio de experiencias internacionales, habiendo competido en varios torneos Wildcard y el Campeonato Mundial de 2014.</p>\n\n<p>Naru posee un repertorio de campeones inmenso, y juega cualquier cosa que requiera la composición de su equipo. También es un gran seguidor de los cambios en el metajuego, adoptando selecciones que se ponen de moda en las tendencias globales, y adaptándolas a su propio estilo de juego. Los equipos que participan en el Mid-Season Invitational 2016 necesitarán estar atentos a su flexibilidad y a su tendencia a acumular impresionantes ventajas de últimos golpes.</p>","fr_FR":"Koray « Naru » Bıçak est une légende sur la scène turque. Il a débuté sa carrière chez Dark Passage en 2013 et a terminé en première place dans tous ses segments, à l'exception d'un. Il a quitté l'équipe l'an dernier pour rejoindre SuperMassive eSports, où il a continué sur sa lancée victorieuse et s'est qualifié pour le Mid-Season Invitational 2016.\n\nNaru est connu pour son large pool de champions et sa capacité à choisir un nouveau champion sans préavis. Ses champions les plus utilisés durant la saison régulière de la TCL ont été Ryze, Corki et LeBlanc – trois styles de jeu uniques qu'il a su équilibrer sans mal. Cette année, s'il souhaite améliorer sa performance au MSI, au Brésil, il devra sûrement créer la surprise contre des midlaners de classe mondiale tels que Bjergsen et Faker.\n","es_ES":"Koray ''Naru'' Bıçak es una leyenda de la escena turca. Comenzó su trayectoria profesional con Dark Passage en 2013 y acabó en primer lugar en todos los splits salvo en uno. Abandonó el equipo el año pasado para unirse a SuperMassive eSports, donde siguió cosechando éxitos y se ganó la oportunidad de jugar en el Mid-Season Invitational 2016.\n\nNaru es famoso por su gran variedad de campeones y por su capacidad para aprender a jugar con nuevos campeones rápidamente. Sus campeones más jugados en la temporada regular de la TCL fueron Ryze, Corki y LeBlanc (tres estilos de juego únicos que pudo equilibrar sin esfuerzo). Si quiere obtener mejores resultados en el MSI de este año en Brasil, puede que tenga que sorprender a los mejores mid del mundo, como Bjergsen y Faker.\n","de_DE":"Koray „Naru“ Bıçak ist eine Legende der türkischen E-Sport-Szene. Er begann seine Karriere 2013 bei Dark Passage und gewann mit einer Ausnahme jeden Split. Im letzten Jahr verließ er die Mannschaft und wechselte zu SuperMassive eSports, wo er seinen Erfolgslauf fortsetzte und sich für das Mid-Season Invitational 2017 qualifizieren konnte.\n\nNaru ist für seinen umfangreichen Championpool und seine Fähigkeit bekannt, den Umgang mit neuen Champions in Windeseile zu erlernen. Im Verlauf der regulären Saison der TCL spielte er am häufigsten mit Ryze, Corki und LeBlanc – drei unterschiedliche Spielstile, zwischen denen er problemlos wechseln kann. Wenn er beim diesjährigen MSI in Brasilien eine bessere Vorstellung abliefern will, wird er die eine oder andere Überraschung aus seinem Hut zaubern müssen, um mit Mid-Lanern wie Bjergsen und Faker mithalten zu können.\n","pl_PL":"Koray „Naru” Bıçak to legenda tureckiej sceny. W 2013 roku rozpoczął swoją karierę z Dark Passage i wszystkie splity poza jednym kończył na pierwszym miejscu. Opuścił drużynę w zeszłym roku, by dołączyć do SuperMassive eSports, z którymi kontynuował odnoszenie sukcesów i zdobył szansę na udział w Mid-Season Invitational 2016.\n\nNaru znany jest z szerokiej puli bohaterów i tego, że potrafi niespodziewanie wybrać całkiem nowego bohatera. Najczęściej wykorzystywanymi przez niego bohaterami w sezonie zasadniczym TCL byli Ryze, Corki i LeBlanc — to trzy unikalne style gry, między którymi Naru balansuje bez wysiłku. Jeśli chce dać lepszy występ na tegorocznym MSI w Brazylii, będzie musiał wyciągnąć coś zaskakującego z rękawa, mierząc się ze światowej klasy środkowymi, takimi jak Bjergsen i Faker\n\n","pt_BR":"<p>Koray \"Naru\" Bıçak é uma lenda do cenário turco. Ele começou a sua carreira com a Dark Passage em 2013 e terminou em primeiro lugar em quase todas Etapas, não vencendo apenas uma. Ele saiu da equipe no ano passado para entrar na SuperMassive eSports, onde continuou a ter sucesso e conquistou a chance de jogar no Mid-Season Invitational 2016.</p>\n\n<p>Naru é conhecido pelo seu amplo elenco de Campeões e a habilidade de escolher um novo Campeão rapidamente. Os Campeões com os quais ele mais jogou na temporada regular da TCL foram Ryze, Corki e LeBlanc; três estilos de jogo diferentes que ele equilibrou sem esforço. Se ele quiser se sair melhor neste MSI no Brasil, precisará surpreender os jogadores de meio do mundo, como Bjergsen e Faker.\n</p>","tr_TR":"Koray \"Naru\" Bıçak Şampiyonluk Ligi’nde orta koridor denince akla gelen belki de ilk isim. Uzun yıllar Dark Passage kadrosunda yer alan Naru, yurt içinde düzenlenen her resmi turnuvayı takımının kazanmasında en büyük pay sahibi olan oyunculardan biriydi. Yurt dışında da yavaş yavaş tecrübe kazanmasıyla beraber ilk olarak 2013 IWCQ’da ülkemizi başarıyla temsil eden Dark Passage, bir sonraki sene 2014 Worlds’e katılmayı başarıyordu. Sadece yurt içinde gösterdiği performansla değil, EUW tekli dereceli sıralarında da gösterdiği başarı sonrası bir zamanların efsane takımı Gambit Gaming’den transfer teklifi alan Naru, her çevreden saygı gören bir isim haline geldi. Kaptanı olduğu Dark Passage’dan ayrılıp BAUSuperMassive eSports’a transfer olan Naru, 2016 ve 2017 KMF’yi ve 2016 IWCI’yi kazanmayı başardı ve son MSI’ın kapısından döndü. Bu mevsimde de geçtiğimiz mevsimdeki dominant performansını tekrarlamayı hedefleyen BAUSuperMassive’de Naru’dan beklentiler yüksek.\n <br><br>\nNaru her ne kadar hâlâ en üst düzey orta koridorlardan biri de olsa eski günlerini aradığı bir gerçek. Uzun yıllar boyu üst düzey performans göstermenin onu yıprattığı gerçeği bir yana, karşı orta koridordan skor almak için gereğinden fazla agresif oynaması ve Naru’nun üzerindeki “ne zaman düzelecek” baskısı gibi etmenler de Naru’yu efsanevi performansından uzaklaştırıyor. Eğer BAUSuperMassive geçen seneki başarısını tekrar etmek istiyorsa eski Naru’ya çok ihtiyaçları var.\n"},"foreignIds":{"drupalId":"3200","ESPORTSTMNT03":"200001302","TRLT3":"200000087","ESPORTSTMNT04":"200001535"},"socialNetworks":{"twitch":"http://www.twitch.tv/dpnaru","facebook":"https://www.facebook.com/dpnaru","twitter":"https://twitter.com/koraynaru"},"champions":[],"liveGameTeam":199},{"id":285,"slug":"fabfabulous","name":"fabFabulous","firstName":"Asim Cihat","lastName":"Karakaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fabfabulous-7yh3zrzv.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2014-09-16T21:51:40.000Z","updatedAt":"2017-07-21T14:58:22.000Z","bios":{"en_US":"<p>Asım Cihat \"fabFabulous\" Karakaya is the top laner for SuperMassive eSports. If he had it his way, he’d play nothing but carries in the top lane. But more often than not, his team needs him on a tank like Maokai or Shen. He was able to bring out Camille a bit during the regular season, though, going 5-0 on the champion. In his second trip to the Mid-Season Invitational, he might need to do some carrying if his team wants to make it through to the group stage in Rio de Janeiro.</p>","es_AR":"<p>Asım Cihat 'fabFabulous' Karakaya prefiere jugar carrileros superiores agresivos como Kha'Zix y Nidalee. Sin embargo, el nuevo meta ha cambiado y tuvo que adaptar su estilo de juego a campeones como Maokai. Como resultado tiene una poza de campeones muy amplia, con partidas con Vayne o Lissandra durante la Temporada 4. Esta característica hace que los bloqueos en su contra se vuelvan muy difíciles y le permite adaptarse a los cambios de meta con facilidad.</p>","tr_TR":"Asım \"fabFabulous\" Cihat Karakaya Türkiye’de League of Legends denince akla gelen ilk isimlerden. Bu unvanı da bileğinin hakkıyla kazanan fabFabulous profesyonel arenaya Şampiyonluk Ligi’nin en köklü takımlarından HWA ile adım attı. Gösterdiği inanılmaz performans sonrası yurt dışı turnuvalarda başarı hedefleyen Dark Passage’ın transfer ettiği fabFabulous, 2013 IWCQ’da imza şampiyonu olan Kha’Zix ile Pain Gaming karşısında beşte beş yaparak Dark Passage yöneticilerinin doğru karar verdiğini gösterdi. Bir sonraki sene de Dark Passage ile 2014 Worlds’e giden fabFabulous bu başarısını perçinlemiş oldu. <br><br> Yeni sezonda HWA’ya dönen fabFabulous, Kha’Zix’in başta ormanda oynanması yüzünden ormana geçeceğini söylemişti. Sonradan bu kararından vazgeçen fabFabulous, takımın üst koridoru Stomaged’in Ahraz Esports takımındaki gibi ormana geçmesine ve böylece Şampiyonluk Ligi’nin en üst düzey ormancılarından birinin doğmasına ön ayak oldu. <br><br>  HWA sonrası yıldızlar topluluğu olarak nitelendirilen BAUSuperMassive eSports’a geçen fabFabulous, bu takımda Thaldrin ile forma rekabetine girmesinin yanında koçluk görevine Hatchy gelene dek takımına koçluk bile yaptı. Thaldrin sonrası BAUSuperMassive’in üst koridorunda özlenen performansına devam eden fabFabulous’u sürekli izleyebilmek her espor izleyicisini mutlu eden bir durum.\n \nfabFabulous özellikle agresif şampiyonlarla yaptığı oyunlarla hatırlansa da sadece agresif şampiyonları oynayabildiğini düşünmek yanlış olur. Defansif şampiyonlarla da çok tehlikeli olan fabFabulous, geriye düşen takımını oyunun geç aşamasında takım savaşlarında gösterdiği performansla oyuna geri döndürebileceğini pek çok defa gösterdi. Sadece taraftarları değil, sunucuları bile yaptığı oyunlarla gaza getirip “fab fab fab fab” diye bağırtabilen fabFabulous’un varlığı BAUSuperMassive için çok önemli. Bu mevsim de pek çok yetenekli üst koridora karşı oynayacak olan fab, MSI elemelerinde gösterdiği performansa devam etmeye çalışacak ve performansıyla MSI’a kalamadıkları için üzülen taraftarlarının gönlünü almak için ter dökecek.\n","pl_PL":"Asım Cihat „fabFabulous” Karakaya gra jako górny SuperMassive eSports. Gdyby to zależało tylko od niego, grałby wyłącznie jako prowadzący na górnej alei. Ale często drużyna potrzebuje go w roli obrońcy, takiego jak Maokai lub Shen. Mimo wszystko udało mu się parę razy wybrać Camille podczas sezonu zasadniczego i osiągnąć z tą bohaterką wynik 5-0. W swojej drugiej wyprawie na Mid-Season Invitational być może będzie musiał trochę pograć jako prowadzący, jeśli jego drużyna chce przebić się do fazy grupowej w Rio de Janeiro.","fr_FR":"Asım Cihat « fabFabulous » Karakaya est le toplaner de SuperMassive eSports. S'il pouvait n'en faire qu'à sa tête, il se contenterait de jouer les carrys dans la voie du haut. Mais son équipe a parfois besoin de lui en tant que tank avec Maokai ou Shen. Cela dit, il a été capable d'utiliser un peu Camille pendant la saison régulière et a enregistré un 5-0 avec la championne. Lors de son second passage dans le Mid-Season Invitational, il devra peut-être jouer les carrys occasionnellement si son équipe espère accéder à la phase de groupe à Rio de Janeiro.","es_ES":"Asım Cihat ''fabFabulous'' Karakaya es el jugador de la calle superior de SuperMassive eSports. Si tiene la oportunidad de jugar según su estilo, optará por los carries para la calle superior. No obstante, es frecuente que su equipo necesite que juegue tanques como Maokai o Shen. Durante la temporada regular, pudo jugar un poco con Camille y consiguió un 5-0 con ella. En su segundo viaje al Mid-Season Invitational, puede que tenga que guiar a su equipo hasta la victoria si quieren participar en la fase de grupos en Río de Janeiro.","de_DE":"Asım Cihat „fabFabulous“ Karakaya ist der Top-Laner von SuperMassive eSports. Wenn es nach ihm ginge, würde er auf der oberen Lane nur Carrys spielen. Leider muss er für seine Mannschaft häufig Tanks wie Maokai oder Shen auswählen. Er konnte im Verlauf der regulären Saison aber immer wieder Camille spielen, mit der er bei fünf Siegen und null Niederlagen hält. Bei seiner zweiten Teilnahme am Mid-Season Invitational muss er wahrscheinlich das eine oder andere Spiel entscheiden, wenn er seiner Mannschaft dabei helfen will, die Gruppenphase in Rio de Janeiro zu erreichen.","pt_BR":"<p>Asım Cihat \"fabFabulous\" Karakaya é quem joga na rota superior da SuperMassive eSports. Por ele, jogaria sempre com carregadores na rota superior. Mas, frequentemente, sua equipe precisa dele com um tanque como Maokai ou Shen. Porém ele foi capaz de usar a Camille um pouco durante a temporada regular, conquistando 5-0 com a Campeã. Na sua segunda ida a um Mid-Season Invitational, ele pode precisar carregar um pouco a equipe se quiser passar da Fase de grupos no Rio de Janeiro.</p>"},"foreignIds":{"drupalId":"3198","TRLT3":"200000085","ESPORTSTMNT03":"200001300","ESPORTSTMNT04":"200001533"},"socialNetworks":{"facebook":"https://www.facebook.com/HWA.fabulous"},"champions":[],"liveGameTeam":199},{"id":421,"slug":"brtt","name":"brTT","firstName":"Felipe","lastName":"Gonçalves","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brtt-5ae8cs6q.png","hometown":"Rio de Janeiro - RJ","region":"CBLOL Brazil","birthdate":"1991-02-19","createdAt":"2015-05-13T21:17:03.000Z","updatedAt":"2017-05-30T22:06:56.000Z","bios":{"pt_BR":"<p>Pode-se dizer que Felipe \"brTT\" Gonçalves é o Doublelift brasileiro. E ele provavelmente diria que o Doublelift é o brTT norte-americano. Lenda do CBLOL, brTT fez seu nome com jogadas chamativas e balacas próprias durante o seu período na paiN Gaming. Seu Campeão favorito é o Draven, e, vendo ele jogar, dá para entender rapidinho o porquê. Ele nunca perde a oportunidade de ganhar a adoração de seus muitos fãs brasileiros. brTT vai voltar ao palco internacional no MSI frente a uma torcida conterrânea no Rio de Janeiro. Bem-vindos ao League do brTT.</p>\n","en_US":"<p>You might say Felipe “brTT” Gonçalves is the Doublelift of Brazil. He’d probably tell you Doublelift is the brTT of North America. A legend of the CBLOL, brTT made a name for himself with his flashy plays and signature bravado during his time on paiN Gaming. His favorite champion is Draven; watching him play, you’ll quickly understand why. He never backs down from an opportunity to gain the adoration of his many Brazilian fans. He’ll make his return to the international stage at MSI in front of a home crowd. Welcome to the League of brTT.</p>","fr_FR":"Felipe « brTT » Gonçalves est en quelque sort le Doublelift du Brésil. Et il vous dirait probablement que Doublelift est le brTT d'Amérique du Nord. Véritable légende du CBLOL, brTT s'est forgé un nom par ses actions spectaculaires et ses bravades caractéristiques lorsqu'il jouait pour paiN Gaming. Son champion favori est Draven et en le regardant jouer, vous comprendrez rapidement pourquoi. Ce joueur ne manque jamais une opportunité de briller devant ses nombreux fans brésiliens. Il fera son grand retour sur la scène internationale au MSI, sous les encouragements de son public au Brésil. Bienvenue dans League of brTT.\n\n","pl_PL":"Można powiedzieć, że Felipe „brTT” Gonçalves to Doublelift Brazylii. On pewnie powiedziałby, że Doublelift to brTT Ameryki Północnej. Zanim stał się legendą CBLOL, brTT zyskał sobie sławę dzięki efektownym zagrywkom i charakterystycznej brawurze podczas gry z paiN Gaming. Jego ulubionym bohaterem jest Draven, a patrząc na jego grę, szybko zorientujecie się dlaczego. Nigdy nie cofa się przed okazją zdobycia uznania swoich licznych brazylijskich fanów. Z pewnością będzie chciał z fasonem wrócić na międzynarodową scenę MSI na oczach rzeszy kibiców w Brazylii. Witamy w League of brTT","de_DE":"Würde man behaupten, dass Felipe „brTT“ Gonçalves der Doublelift von Brasilien ist. Würde er wahrscheinlich antworten, dass Doublelift der brTT von Nordamerika ist. brTT ist eine Legende der CBLOL und hat sich während seiner Zeit bei paiN Gaming mit seinem auffälligen Spielstil und seiner angeberischen Art einen Namen gemacht. Sein Lieblingschampion ist Draven und wenn man ihm zusieht, weiß man auch schnell, warum. Er lässt keine Gelegenheit aus, sich die Anerkennung seiner vielen brasilianischen Fans zu sichern. Beim diesjährigen MSI wird er vor heimischem Publikum auf die internationale Bühne zurückkehren. Willkommen zu League of brTT.\n","es_ES":"Podría decirse que Felipe ''brTT'' Gonçalves es el Doublelift brasileño. Él seguramente os diría que Doublelift es el brTT de Norteamérica. brTT es una leyenda de la CBLOL que se ha ganado una reputación gracias a sus increíbles jugadas y al estilo bravucón que le caracterizó durante su época en paiN Gaming. Su campeón favorito es Draven. Entenderéis por qué si lo veis jugar con él. Nunca pierde la oportunidad de recibir la adoración de sus numerosos fans brasileños. Volverá a pisar el escenario internacional en el MSI, con sus compatriotas como público en Brasil. Bienvenidos a League of brTT","es_AR":"<p>Se podría decir que <strong>Felipe \"brTT\" Gonçalves</strong> es el <strong>Doublelift</strong> de Brasil. Él tal vez te diga que <strong>Doublelift</strong> es el <strong>brTT</strong> de Norteamérica. <strong>brTT</strong>, una leyenda de CBLOL, se ganó su renombre con sus jugadas llamativas y su bravata característica durante tu época en paiN Gaming. Su campeón favorito es Draven. Al verlo jugar entenderán por qué. Nunca rechaza una oportunidad para ganarse la adoración de sus muchos seguidores brasileños. Regresará al escenario internacional del MSI frente de una audiencia local. Bienvenidos a League of <strong>brTT</strong>.</p>","en_PL":""},"foreignIds":{"TRLH3":"1001160089","TRLH4":"1001160089","drupalId":"4872","TRLT3":"200000013"},"socialNetworks":{"facebook":"https://www.facebook.com/felipebrTT","twitter":"https://twitter.com/brttOficial","twitch":"https://www.twitch.tv/brtt"},"champions":[{"id":13,"playerId":421,"championId":119,"championKey":"Draven","championName":"Draven","createdAt":"2015-05-13T21:18:17.000Z","updatedAt":"2017-05-30T22:06:55.000Z"},{"id":15,"playerId":421,"championId":29,"championKey":"Twitch","championName":"Twitch","createdAt":"2015-05-13T21:18:17.000Z","updatedAt":"2017-05-30T22:06:55.000Z"},{"id":428,"playerId":421,"championId":429,"championKey":"Kalista","championName":"Kalista","createdAt":"2016-05-17T23:10:13.000Z","updatedAt":"2017-05-30T22:06:55.000Z"}],"liveGameTeam":168},{"id":422,"slug":"dioud","name":"Dioud","firstName":"Hugo","lastName":"Padioleau","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dioud-fybalb23.png","hometown":"Barbechat - França","region":"CBLOL Brazil","birthdate":"1990-03-11","createdAt":"2015-05-13T21:18:42.000Z","updatedAt":"2017-05-30T22:09:35.000Z","bios":{"pt_BR":"<p>Hugo \"Dioud\" Padioleau é o responsável pelo suporte à agressão do brTT na rota inferior para a Red Canids. O francês juntou-se à paiN Gaming em 2015, quando jogou com brTT pela primeira vez. Quando ele entrou na Red Canids em 2016, brTT logo fez o mesmo. Para combinar com o estilo de jogo do atirador de sua equipe, ele é conhecido por seus suportes de ataque com o Thresh e o Blitzcrank. Inclusive, Dioud foi retratado como o Grande Golem a Vapor no <strong><a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">papel de parede oficial do CBLoL de 2015.</a></strong></p>","en_US":"<p>Hugo “Dioud” Padioleau is the man tasked with supporting brTT’s aggression in the bot lane for Red Canids. The Frenchman joined paiN Gaming in 2015, where he laned with brTT for the first time. When he joined Red Canids in 2016, brTT soon followed. To match his ADC’s playstyle, he’s known for his offensive supports like Thresh and Blitzcrank. In fact, he was portrayed as the Great Steam Golem in the official CBLOL wallpaper for 2015.</p>","fr_FR":"<Hugo « Dioud » Padioleau est le joueur dont le rôle est de soutenir les agressions de brTT dans la voie du bas pour Red Canids. Ce français a intégré paiN Gaming en 2015 et c'est dans cette équipe qu'il s'est associé à brTT pour la première fois. Il a rejoint les Red Canids en 2016 et brTT l'a suivi peu après. Pour s'accorder au style de jeu de son ADC, il utilise des supports offensifs comme Thresh et Blitzcrank. Dioud a été représenté en Golem de vapeur sur le fond d'écran officiel du CBLOL 2015. ","pl_PL":"Można powiedzieć, że Felipe „brTT” Gonçalves to Doublelift Brazylii. On pewnie powiedziałby, że Doublelift to brTT Ameryki Północnej. Zanim stał się legendą CBLOL, brTT zyskał sobie sławę dzięki efektownym zagrywkom i charakterystycznej brawurze podczas gry z paiN Gaming. Jego ulubionym bohaterem jest Draven, a patrząc na jego grę, szybko zorientujecie się dlaczego. Nigdy nie cofa się przed okazją zdobycia uznania swoich licznych brazylijskich fanów. Z pewnością będzie chciał z fasonem wrócić na międzynarodową scenę MSI na oczach rzeszy kibiców w Brazylii. Witamy w League of brTT","de_DE":"Hugo „Dioud“ Padioleau ist der Mann, der brTT auf RED Canids’ unteren Lane unterstützen soll. Der Franzose wechselte 2015 zu paiN Gaming, wo er das erste Mal auf brTT traf. Als er 2016 zu RED Canids wechselte, dauerte es nicht lange, bis ihm brTT folgte. Diouds Spielweise passt perfekt zum Spielstil seines AD-Carrys und er ist dafür bekannt, bevorzugt offensive Supporter wie Thresh und Blitzcrank zu spielen. Auf dem offiziellen Bildschirmhintergrund der CBLOL 2015 stellte er sogar den großen Dampfgolem dar. ","es_ES":"Hugo ''Dioud'' Padioleau es el encargado de ayudar a brTT en sus jugadas agresivas en la calle inferior. El francés se unió a paiN Gaming en 2015, donde jugó como dúo de brTT por primera vez. Cuando se unió a Red Canids en 2016, brTT no tardaría en seguirlo. Para encajar con el estilo de juego de su ADC, Dioud es famoso por jugar con apoyos ofensivos como Thresh y Blitzcrank. De hecho, lo retrataron como el Gran Gólem de Vapor en el fondo de pantalla oficial de la CBLOL 2015. ","es_AR":"<p><strong>Hugo \"Dioud\" Padioleau</strong> es el encargado de apoyar la agresión de <strong>brTT</strong> en el carril inferior de los Red Canids. El francés se unió a paiN Gaming en 2015 cuando jugó con <strong>brTT</strong> por primera vez. Cuando se unió a los Red Canids en el 2016, <strong>brTT</strong> lo siguió poco después. En concordancia con el estilo de juego de su tirador, se le conoce por sus soportes ofensivos como Thresh y Blitzcrank. Incluso lo representaron como el Gran Gólem de Vapor en el <a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">poster oficial del CBLOL 2015</a>.</p>","en_PL":""},"foreignIds":{"TRLH3":"1001160090","TRLH4":"1001160090","drupalId":"200","TRLT3":"200000014"},"socialNetworks":{"facebook":"https://www.facebook.com/Dioudy","twitter":"https://twitter.com/Dioudlol","twitch":"www.twitch.tv/Dioudlol","youtube":"https://www.youtube.com/channel/UCOLZUkTcdFrg1aiwSr8TAmw"},"champions":[{"id":17,"playerId":422,"championId":40,"championKey":"Janna","championName":"Janna","createdAt":"2015-05-13T21:20:45.000Z","updatedAt":"2017-05-30T22:09:35.000Z"},{"id":18,"playerId":422,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2015-05-13T21:20:45.000Z","updatedAt":"2017-05-30T22:09:35.000Z"},{"id":398,"playerId":422,"championId":53,"championKey":"Blitzcrank","championName":"Blitzcrank","createdAt":"2016-05-17T21:34:41.000Z","updatedAt":"2017-05-30T22:09:35.000Z"}],"liveGameTeam":168},{"id":428,"slug":"nappon","name":"Nappon","firstName":"Carlos","lastName":"Henrique Rücker","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nappon-axrfoxrj.png","hometown":"Três Passos - RS","region":"CBLOL Brazil","birthdate":"1994-06-04","createdAt":"2015-05-13T22:18:33.000Z","updatedAt":"2017-05-30T22:04:45.000Z","bios":{"pt_BR":"Carlos \"Nappon\" Henrique Rücker é um caçador veterano do CBLoL. Nappon, membro antigo da CNB e-Sports Club, entrou na equipe renovada dos Red Canis em 2017. Seu Campeão mais utilizado até agora foi o Kha’Zix, mas ele é um dos mais conhecidos jogadores brasileiros do Lee Sin e inclusive foi retratado como o Monge Cego no <strong><a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">papel de parede oficial do CBLoL de 2015</a></strong>. Sua mecânica vai ter que ser de primeira se ele quiser competir com os melhores do mundo no MSI.","en_US":"<p>Carlos “Nappon” Henrique Rücker is a veteran jungler of the CBLOL. The longtime CNB e-Sports Club member found himself on Red Canid’s revamped roster for 2017. His most played champion for 2017 so far has been Kha’Zix, but he’s one of Brazil’s most well-known Lee Sin players. He was even portrayed as the Blind Monk on the official CBLOL wallpaper for 2015. His mechanics will have to be top notch if he hopes to compete with the world’s best at MSI.</p>","es_AR":"<p><strong>Carlos \"Nappon\" Henrique Rücker</strong> es un junglero veterano del CBLOL. El antiguo miembro de CNB e-Sports Club se encuentra en la alineación mejorada de Red Canid para el 2017. El campeón que más ha utilizado en el 2017 ha sido Kha'Zix, pero es uno de los jugadores brasileños de Lee Sin más conocidos. Incluso lo representaron como el Monje Ciego en el <a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">poster oficial del CBLOL 2015</a>. Su estrategia tendrá que ser perfecta si espera competir contra los mejores del mundo en el MSI.</p>","de_DE":"Carlos „Nappon“ Henrique Rücker ist ein erfahrener Jungler der CBLOL. Das langjährige Mitglied von CNB e-Sports Club wechselte 2017 zu RED Canids. 2017 war Kha’Zix sein meistgespielter Champions, aber er ist auch einer der besten „Lee Sin“-Spieler Brasiliens. Auf dem offiziellen Bildschirmhintergrund der CBLOL 2015 war er sogar als der blinde Mönch abgebildet. Seine Mechaniken müssen erstklassig sein, wenn er sich beim MSI mit den Besten der Welt messen will.","fr_FR":"Carlos « Nappon » Henrique Rücker est un jungler vétéran du CBLOL. Ce membre de longue date de CNB e-Sports Club s'est retrouvé dans la nouvelle formation Red Canids pour l'année 2017. Jusqu'à présent, son champion favori en 2017 est Kha'Zix, mais il fait également partie des joueurs de Lee Sin les plus célèbres au Brésil. Nappon a d'ailleurs été représenté en moine aveugle sur le fond d'écran officiel du CBLOL 2015. Il devra maîtriser parfaitement ses mécaniques s'il veut rivaliser avec les meilleurs joueurs mondiaux au MSI.","en_PL":"","es_ES":"Carlos ''Nappon'' Henrique Rücker es un jungla veterano de la CBLOL. Fue miembro durante mucho tiempo de CNB e-Sports Club, hasta que se sumó a la renovada plantilla de Red Canids en 2017. Su campeón más jugado este año ha sido Kha'Zix, pero es uno de los jugadores de Lee Sin más famosos de Brasil. Incluso lo retrataron como al Monje Ciego en el fondo de pantalla oficial de la CBLOL 2015. Tendrá que sacar el mayor rendimiento a sus mecánicas si quiere competir contra los mejores del mundo en el MSI.","pl_PL":"Carlos „Nappon” Henrique Rücker gra jako dżungler i jest weteranem CBLOL. Ten wieloletni członek CNB e-Sports Club w 2017 roku znalazł się w odnowionym składzie Red Canids. Jak do tej pory najczęściej wykorzystywanym przez niego bohaterem w 2017 r. był Kha’Zix, ale ogólnie jest najbardziej znanym brazylijskim zawodnikiem grającym Lee Sinem. Został nawet sportretowany jako Ślepy Mnich na oficjalnej tapecie CBLOL w 2015 roku. Jeśli chce dorównać najlepszym na świecie podczas MSI, będzie musiał wznieść się na szczyty swoich umiejętności mechanicznych."},"foreignIds":{"TRLT3":"200000012"},"socialNetworks":{"azubu":"","facebook":"https://www.facebook.com/carlosnappon","twitter":"https://twitter.com/nappon_","twitch":"http://www.twitch.tv/napponzera"},"champions":[{"id":25,"playerId":428,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-05-13T22:19:50.000Z","updatedAt":"2017-05-30T22:04:45.000Z"},{"id":217,"playerId":428,"championId":76,"championKey":"Nidalee","championName":"Nidalee","createdAt":"2016-01-15T21:34:07.000Z","updatedAt":"2017-05-30T22:04:45.000Z"},{"id":462,"playerId":428,"championId":203,"championKey":"Kindred","championName":"Kindred","createdAt":"2016-05-18T19:19:18.000Z","updatedAt":"2017-05-30T22:04:45.000Z"}],"liveGameTeam":168},{"id":465,"slug":"tockers","name":"tockers","firstName":"Gabriel","lastName":"Claumann","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tockers-isxstfmn.png","hometown":"Santa Cruz do Sul - RS","region":"CBLOL Brazil","birthdate":"1996-08-21","createdAt":"2015-05-14T00:51:15.000Z","updatedAt":"2017-05-30T22:21:21.000Z","bios":{"pt_BR":"<p>Gabriel \"tockers\" Claumann é a imagem da consistência na rota do meio. Mesmo nas derrotas, o jogador dá o melhor de si sempre e nem precisa de abates; ele consegue se estabelecer no jogo matando tropas e garantindo objetivos com o restante da equipe. No seu período como membro da INTZ e-Sports Club, ele era considerado um dos melhores meios no CBLoL. Tockers vai se unir ao restante dos Red Canids para representar seu país no MSI no Rio de Janeiro.</p>","en_US":"<p>Gabriel “tockers” Claumann is the picture of consistency in the mid lane. Even in losses, he can be counted on to perform. And he doesn’t even need kills; he can build leads from creep kills and securing objectives with the rest of his team. During his time with INTZ e-Sports Club, he was considered one of the best laning mids in the CBLOL. He’ll be joining the rest of the Red Canids as they represent their country at MSI.</p>","de_DE":"Gabriel „Tockers“ Claumann ist die personifizierte Beständigkeit auf der mittleren Lane. Selbst bei Niederlagen spielt er meistens in Topform. Und er braucht nicht einmal Tötungen. Ihm reichen Vasallentötungen und Ziele, um sich einen Vorteil zu erarbeiten. Während seiner Zeit bei INTZ e-Sports Club galt er als einer der besten Mid-Laner der CBLOL. Er wird sein Land zusammen mit dem Rest von RED Candis beim MSI in Brasilien repräsentieren.","es_AR":"<p><strong>Gabriel \"tockers\" Claumann</strong> es la imagen de la consistencia en el carril central. Incluso en las derrotas, puedes contar con él. Ni siquiera necesita asesinatos, puede obtener ventaja a partir de matar súbditos y asegurar objetivos con el resto de su equipo. Mientras formó parte de INTZ e-Sports Club, se le consideró uno de los mejores carrileros centrales en el CBLOL. Se unirá con el resto de los Red Canids cuando representen a su país en el MSI.</p>","es_ES":"Gabriel ''tockers'' Claumann es la viva imagen de la regularidad en la calle central. Incluso en las derrotas, su buen rendimiento está garantizado. Ni siquiera necesita asesinatos; es capaz de conseguir la ventaja a costa de asesinar monstruos y asegurar objetivos con el resto de su equipo. Durante su paso por INTZ e-Sports Club, se le consideró uno de los mejores mid de la CBLOL. Se unirá al resto de Red Canids para representar a su país en el MSI de Brasil.","fr_FR":"Gabriel « Tockers » Claumann incarne la régularité sur la voie du milieu. Même dans les défaites, son équipe peut toujours compter sur son talent. Tockers n'a pas besoin d'accumuler les éliminations : il peut construire son avance sur la destruction des sbires et sécuriser les objectifs avec son équipe. Au sein d'INTZ e-Sports Club, il était considéré comme l'un des meilleurs mid-laners du CBLOL. Il rejoindra l'effectif des Red Canids qui représentera le Brésil lors du MSI à domicile.","en_PL":"","pl_PL":"Gabriel „tockers” Claumann niezmiennie świetnie spisuje się na środkowej alei. Nawet w przegranych meczach daje znakomite pokazy gry. Nie musi nawet sam zdobywać zabójstw, potrafi budować przewagę dzięki zabitym stworom, aby realizować cele we współpracy z drużyną. W czasach INTZ e-Sports Club był uważany za jednego z najlepszych środkowych CBLOL. Razem z pozostałymi członkami Red Canids będzie reprezentował gospodarzy podczas MSI w Brazylii."},"foreignIds":{"TRLH1":"1001380138","TRLH2":"1001280108","TRLT3":"200000079"},"socialNetworks":{"azubu":"http://www.azubu.tv/tockers","facebook":"https://www.facebook.com/tockers.lol","twitter":"https://twitter.com/tockerslol"},"champions":[{"id":85,"playerId":465,"championId":34,"championKey":"Anivia","championName":"Anivia","createdAt":"2015-05-14T00:52:47.000Z","updatedAt":"2017-05-30T22:21:21.000Z"},{"id":87,"playerId":465,"championId":238,"championKey":"Zed","championName":"Zed","createdAt":"2015-05-14T00:52:47.000Z","updatedAt":"2017-05-30T22:21:21.000Z"},{"id":233,"playerId":465,"championId":4,"championKey":"TwistedFate","championName":"Twisted Fate","createdAt":"2016-01-15T22:21:56.000Z","updatedAt":"2017-05-30T22:21:21.000Z"}],"liveGameTeam":168},{"id":471,"slug":"robo","name":"Robo","firstName":"Leonardo","lastName":"Souza","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/robo-904dzlb5.png","hometown":"São Paulo - SP","region":"CBLOL Brazil","birthdate":"1998-04-22","createdAt":"2015-05-14T13:35:41.000Z","updatedAt":"2017-05-30T22:15:32.000Z","bios":{"pt_BR":"Leonardo \"Robo\" Souza controla a rota superior para os Red Canids. Robo era um dos membros originais da INTZ Red quando a equipe foi formada em 2015, mas saiu do time antes de ganharem o nome de Red Canids. Por causa do estilo agressivo do caçador e da rota inferior da equipe, Robo costuma ser designado como tanque na rota superior. Durante a temporada regular de CBLoL, ele foi invicto com Maokai e Shen.","en_US":"<p>Leonardo “Robo” Souza anchors the top lane for Red Canids. Robo was one of the original members of INTZ Red when the team formed in 2015, but he departed the team before it was renamed to Red Canids. With the aggressive playstyles of his jungler and bot lane, Robo is often tasked with playing tanks in the top lane. During the CBLOL regular season, he was undefeated on Maokai and Shen.</p>","es_AR":"<p><strong>Leonardo \"Robo\" Souza</strong> está en el carril superior de los Red Canids. <strong>Robo</strong> fue uno de los miembros originales de INTZ Red cuando se formó el equipo en 2015, pero lo abandonó antes de que lo renombraran como Red Canids. Con los agresivos estilos de juego de su junglero y su carril inferior, <strong>Robo</strong> a menudo tiene que ser el tanque en el carril superior. Durante la temporada regular de CBLOL, salió invicto con Maokai y Shen.</p>","de_DE":"Leonardo „Robo“ Souza ist RED Canids’ Top-Laner. Robo war bei der Gründung von INTZ Red im Jahr 2015 dabei, verließ die Mannschaft aber wieder, bevor sie in RED Candis umbenannt wurde. Durch den aggressiven Spielstil seines Junglers und der unteren Lane muss Robo auf der oberen Lane häufig einen Tank spielen. Während der regulären Saison der CBLOL verlor er mit Maokai und Shen kein einziges Spiel","fr_FR":"Leonardo « Robo » Souza joue sur la voie du haut pour les Red Canids. Robo était l'un des membres d'origine d'INTZ Red quand l'équipe s'est formée en 2015, mais il l'avait quittée avant qu'elle ne prenne le nom de Red Canids. Son jungler et sa voie du bas ayant un jeu agressif, Robo est souvent chargé de jouer les tanks sur la voie du haut. Lors de la saison régulière du CBLOL, il a été invaincu avec Maokai et Shen","es_ES":"Leonardo ''Robo'' Souza es el responsable de la calle superior de Red Canids. Robo era uno de los miembros originales de INTZ Red cuando el equipo se creó en 2015, pero se marchó antes de que fuese renombrado como Red Canids. Debido al estilo de juego agresivo de su jungla y su dúo de la calle inferior, Robo suele necesitar jugar con tanques en la calle superior. Durante la temporada regular de la CBLOL, quedó invicto con Maokai y Shen.","en_PL":"","pl_PL":"Leonardo „Robo” Souza zabezpiecza w Red Canids górną aleję. Robo należał do oryginalnego składu INTZ Red, gdy drużyna formowała się w 2015 roku, ale opuścił ją, zanim przyjęła nazwę Red Canids. Ze względu na agresywny styl gry dżunglera i dolnego, Robo często ma za zadanie odgrywanie roli obrońcy na górnej alei. Podczas podstawowego sezonu CBLOL był niepokonany, grając Maokaiem i Shenem."},"foreignIds":{"TRLT3":"200000011"},"socialNetworks":{"azubu":"http://www.azubu.tv/robolol","facebook":"https://www.facebook.com/roobolol","twitter":"https://twitter.com/robolol1"},"champions":[{"id":167,"playerId":471,"championId":245,"championKey":"Ekko","championName":"Ekko","createdAt":"2015-11-04T12:14:28.000Z","updatedAt":"2017-05-30T22:15:31.000Z"},{"id":352,"playerId":471,"championId":222,"championKey":"Jinx","championName":"Jinx","createdAt":"2016-05-17T19:24:08.000Z","updatedAt":"2017-05-30T22:15:31.000Z"}],"liveGameTeam":168},{"id":474,"slug":"sacyr","name":"Sacy","firstName":"Gustavo","lastName":"Rossi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sacyr-k4sbrmb.png","hometown":"Jundiaí - SP","region":"CBLOL Brazil","birthdate":"1997-12-02","createdAt":"2015-05-14T13:39:40.000Z","updatedAt":"2017-05-31T00:19:57.000Z","bios":{"pt_BR":"SacyR tem aparições constantes desde 2013, mas parte disso no cenário semi-profissional. Quando finalmente conseguiu chegar à elite, o atirador contou com a sua surpreendente regularidade para atuar ao lado de diversos suportes e manter o alto nível de jogo. Especialista em atiradores de <em>late game</em>, SacyR busca ganhar cada vez mais espaço e despontar no CBLoL em um meta complicado para sua posição.","en_US":""},"foreignIds":{},"socialNetworks":{"azubu":"http://www.azubu.tv/sacylol","facebook":"https://www.facebook.com/sacyadc","twitter":"https://twitter.com/sacylol"},"champions":[{"id":169,"playerId":474,"championId":222,"championKey":"Jinx","championName":"Jinx","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"},{"id":170,"playerId":474,"championId":119,"championKey":"Draven","championName":"Draven","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"},{"id":171,"playerId":474,"championId":67,"championKey":"Vayne","championName":"Vayne","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"}],"liveGameTeam":168},{"id":1113,"slug":"rhuckz","name":"rhuckz","firstName":"Rúben ","lastName":"Neves","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rhuckz-h5bx2iqn.png","hometown":"","region":"CBLOL Brazil","birthdate":null,"createdAt":"2016-01-22T18:38:14.000Z","updatedAt":"2017-05-30T22:14:38.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"385024"},"socialNetworks":{"facebook":"https://www.facebook.com/rhuckz/"},"champions":[],"liveGameTeam":168},{"id":1210,"slug":"stomaged","name":"Stomaged","firstName":"Furkan","lastName":"Güngör","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stomaged-4cek2mao.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2016-04-11T16:48:04.000Z","updatedAt":"2017-07-21T14:58:36.000Z","bios":{"en_US":"<p>Furkan “Stomaged” Güngör is the jungler for SuperMassive eSports. He’s making his second trip to the Mid-Season Invitational after attending in 2016. Stomaged is a versatile jungler, playing 10 unique champions in the 2017 TCL Winter Split. But he’s most at home on strong early game champions like Rek’Sai and Lee Sin. After a poor performance at last year’s event, he’ll be itching for another shot at the world’s top junglers in Brazil.</p>","es_AR":"<p>Furkan 'Stomaged' Güngör es el junglero de SuperMassive. Se unió a la escuadra para participar en el Torneo de Invierno de 2016. Stomaged es considerado como el jugador con mayor crecimiento en SUP, consolidando su transición hacia un junglero fiable y multifacético, en lugar de limitarse a sus viejos hábitos de utilizar solamente campeones tanque durante el 2014 y 2015. Incluso cambió posición al carril superior por un tiempo, pero los monstruos de la Grieta lo sedujeron a regresar a la jungla.  Y es donde mejor se desempeña.</p>\n\n<p>Aunque pudiera faltarle experiencia en torneos internacionales, Stomaged sigue siendo una pieza clave en la alineación de SUP. Y ahora, con un trofeo de campeonato de la TCL y un título IWCI, Stomaged participará en el Mid-Season Invitational 2016 con toda la seguridad y confianza a cuestas.</p>","fr_FR":"Furkan « Stomaged » Güngör est le jungler de SuperMassive eSports. Il revient au Mid-Season Invitational après une première participation en 2016. Stomaged est un jungler polyvalent, il a joué 10 champions uniques lors du segment d'hiver de la TCL 2017. Mais il est le plus à son aise avec des champions de début de partie puissants comme Rek’Sai et Lee Sin. Après une performance médiocre à l'événement de l'an dernier, il tentera de se racheter face aux meilleurs junglers du monde, au Brésil.","es_ES":"Furkan ''Stomaged'' Güngör es el jungla de SuperMassive eSports. Este es su segundo viaje al Mid-Season Invitational tras su visita de 2016. Stomaged es un jungla versátil: ha jugado con 10 campeones diferentes en el split de invierno de la TCL 2017. No obstante, destaca especialmente con campeones fuertes al principio de la partida, como Rek’Sai o Lee Sin. Tras su pobre actuación en el evento del año pasado, intentará aprovechar al máximo su nueva oportunidad internacional contra los mejores junglas del mundo en Brasil.","de_DE":"Furkan „Stomaged“ Güngör ist der Jungler von SuperMassive eSports. Er nimmt nach 2016 bereits zum zweiten Mal am Mid-Season Invitational teil. Stomaged ist ein vielseitiger Jungler, der im Winter-Split der TCL zehn verschiedene Champions spielte. Am wohlsten fühlt er sich aber mit Champions wie Rek’Sai und Lee Sin, die vor allem im frühen Spiel stark sind. Nach einer schwachen Vorstellung im letzten Jahr wird er in diesem Jahr in Brasilien beweisen wollen, dass er mit den besten Junglern der Welt mithalten kann.","pl_PL":"Furkan „Stomaged” Güngör jest dżunglerem SuperMassive eSports. To jego druga wyprawa na Mid-Season Invitational po pojawieniu się na turnieju w 2016 roku. Stomaged to wszechstronny dżungler, który grał 10 różnymi bohaterami podczas zimowego splitu TCL 2017. Jednak najpewniej czuje się, grając bohaterami silnymi we wczesnej fazie gry, takimi jak Rek’Sai i Lee Sin. Po kiepskim występie na zeszłorocznym turnieju nie może się doczekać kolejnej okazji, by zmierzyć się z najlepszymi dżunglerami świata w Brazylii.","pt_BR":"<p>Furkan \"Stomaged\" Güngör é o caçador da SuperMassive eSports. Ele fará sua segunda viagem ao Mid-Season Invitational depois de participar em 2016. Stomaged é um caçador versátil, que jogou com 10 Campeões diferentes na Etapa de Inverno da TCL 2017. Mas ele se sente mais em casa com Campeões fortes já no início do jogo, como Rek’Sai e Lee Sin. Depois de um desempenho ruim no evento do ano passado, ele está ansioso para ter outra chance de ser um dos melhores caçadores do mundo no Brasil.</p>","tr_TR":"Furkan \"Stomaged\" Güngör Şampiyonluk Ligi’nin en değerli ormancılarından biri. Eskiden en değerli üst koridorlardan biri olan Stomaged, 2013 Sezonu dereceli sırasında Ustalık seviyesine özellikle üst koridorda yaptığı Shen oyunlarıyla çıkan ilk oyunculardan biri olmuştu. HWA’da profesyonel kariyerine başlayan Stomaged, HWA’dan sonra AWH ve Ahraz Esports takımlarında da oynadı. HWA’ya geri dönmesiyle beraber orman rolüne geçen Stomaged, fabFabulous ile beraber rakiplerinin korkulu rüyası haline geldi. Yeni kurulan süper takım BAUSuperMassive eSports’ta da bu performansıyla kendine yer bulan Stomaged kendini giderek daha çok geliştirdi ve en iyi yerli ormancı unvanını Crystal’dan almayı başardı. BAUSuperMassive kadrosuyla 2016 ve 2017 KMF’yi kazanan ve 2016 IWCI’yi kazanarak 2016 MSI’a giden Stomaged, bu turnuvada dünyaca ünlü SKT takımından Baron çalarak büyük sükse yaptı. Bu mevsime de orman rolünde Stomaged ile devam eden BAUSuperMassive’in rakipleri beklenmeyen baskınlar için hazır olmalı.\n <br><br>\nEn iyi oynadığı rolü değiştirip yeni rolünde de en iyilerden biri olan Stomaged tam bir başarı hikayesi... Yine de özellikle yurt dışı maçlarda hâlâ diğer ormancılara göre bazı temel eksiklikleri olduğu göze çarpıyor. Bu eksiklerini kapatabilirse fabFabulous, Naru ve Zeitnot gibi isimlere rağmen BAUSuperMassive’in bu mevsim en büyük yıldızı haline gelebilir.\n"},"foreignIds":{"TRLT3":"200000086","ESPORTSTMNT03":"200001301","ESPORTSTMNT04":"200001534"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1420,"slug":"zeitnot","name":"Zeitnot","firstName":"Berkay","lastName":"Aşıkuzun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zeitnot-c7w21tyy.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-01-02","createdAt":"2016-08-22T15:00:06.000Z","updatedAt":"2017-07-21T14:59:37.000Z","bios":{"en_US":"<p>Berkay \"Zeitnot\" Aşıkuzun is the AD carry for SuperMassive eSports. After playing alongside Naru on Dark Passage beginning in 2015, Zeitnot joined SuperMassive to start the 2017 season. During the regular season, he thrived in the lethality meta, going undefeated in 11 games as Varus and Jhin. As the only current member of SuperMassive who didn’t attend the 2016 Mid-Season Invitational, Zeitnot will be making his first international appearance in Brazil. He’ll need to find his footing on a new set of champions if he wants to make it through the Play-In stage and beyond.</p>","de_DE":"Berkay „Zeitnot“ Aşıkuzun ist der AD-Carry von SuperMassive eSports. Zeitnot begann seine Karriere 2015 zusammen mit Naru bei Dark Passage, wechselte zu Beginn der Saison 2017 aber zu SuperMassive. Dank des neuen „Tödlichkeitsfaktor“-Metaspiels blühte er in der regulären Saison auf und schaffte es mit Varus und Jhin, elf Spiele lang ungeschlagen zu bleiben. Da Zeitnot das einzige Mitglied von SuperMassive ist, das nicht beim Mid-Season Invitational 2016 war, wird er in Brasilien sein Debüt auf der internationalen Bühne geben. Er wird sich jedoch mit neuen Champions zurechtfinden müssen, wenn er die Vorrundenphase überstehen will.","es_ES":"Berkay ''Zeitnot'' Aşıkuzun es el ADC de SuperMassive eSports. Tras jugar junto a Naru en Dark Passage al comienzo de 2015, Zeitnot se unió a SuperMassive a comienzos de la temporada 2017. Durante la temporada regular, destacó en el metajuego de la letalidad: consiguió mantenerse 11 partidas invicto con Varus y Jhin. Zeitnot es el único miembro actual de SuperMassive que no asistió al Mid-Season Invitational 2016, por lo que su viaje a Brasil será su primera aparición internacional. Tendrá que aprender a jugar con nuevos campeones si quiere superar la fase de apertura y llegar hasta lo más alto.","fr_FR":"Berkay « Zeitnot » Aşıkuzun est le carry AD de SuperMassive eSports. Après avoir joué aux côtés de Naru chez Dark Passage à partir de 2015, Zeitnot a rejoint SuperMassive au début de la saison 2017. Pendant la saison régulière, il a excellé dans la méta létalité, restant invaincu pendant 11 parties avec Varus et Jhin. Seul membre actuel de SuperMassive n'ayant pas participé au Mid-Season Invitational 2016, Zeitnot fera sa première apparition internationale au Brésil. Il devra donc trouver ses marques avec un nouvel ensemble de champions s'il veut dépasser la phase de qualifications.","pl_PL":"Berkay „Zeitnot” Aşıkuzun jest prowadzącym SuperMassive eSports. Już na początku 2015 roku grał z Naru w Dark Passage Zeitnot, a sezon 2017 rozpoczął, dołączając do SuperMassive. W sezonie zasadniczym rozwinął skrzydła w stanie gry opartym na Destrukcji, nie ponosząc porażki w 11 grach jako Varus i Jhin. Jako jedyny z obecnych członków SuperMassive, który nie wziął udziału w Mid-Season Invitational 2016, Zeitnot po raz pierwszy pojawi się przed międzynarodową widownią w Brazylii. Jeśli chce przebić się przez rundę wstępną i dotrzeć dalej, będzie musiał oprzeć grę na nowym zestawie bohaterów.","pt_BR":"<p>Berkay \"Zeitnot\" Aşıkuzun é o carregador da SuperMassive eSports. Depois de jogar ao lado de Naru na Dark Passage no início de 2015, Zeitnot entrou para a SuperMassive no início da temporada de 2017. Durante a temporada regular, ele teve êxito na meta da Letalidade, conseguindo sair invicto em 11 jogos como Varus e Jhin. Ele é o único membro atual da SuperMassive que não participou do Mid-Season Invitational 2016 e fará sua primeira aparição internacional no Brasil. Ele vai precisar se virar com um novo conjunto de Campeões se quiser passar pela Fase de Entrada e além.</p>","tr_TR":"Berkay \"Zeitnot\" Aşıkuzun Şampiyonluk Ligi’ndeki en yetenekli nişancılardan biri. Kısa süreli Ahraz Gaming macerası dışında uzun yıllar HWA’da kalan Zeitnot kendini Şampiyonluk Ligi’nin en korkulan nişancılarından biri olarak kanıtladı. HolyPhoenix sonrası nişancı rolünde sıkıntı yaşayan Dark Passage’a transfer olan Zeitnot kısa sürede burada da yeteneklerini sergilemeye başladı. Kariyerinin en başarılı yıllarını Dark Passage formasıyla geçiren Zeitnot, son olarak 2016 TBF Şampiyonu olarak 2016 IWCQ’ya katıldı ve 2016 IWCA’da da nişancı pozisyonunda ülkemizi temsil etti. Geçtiğimiz mevsimde BAUSuperMassive eSports’un 5 yerli isimli kadrosunda yer alan Zeitnot şimdiye kadarki en iyi mevsimini geçirdi.\n <br><br>\nBeraber oynadığı Dumbledoge’un ayrılması ve pek fazla tecrübesi olmayan destek Tolerant’ın gelmesiyle Zeitnot için yepyeni bir macera başlıyor. Kendini çoktan kanıtlamış nişancı bu zorlukları rahatlıkla aşacaktır ve MSI ön elemelerinde sergilediği herkesi büyüleyen performansa kaldığı yerden devam edecektir.\n"},"foreignIds":{"ESPORTSTMNT03":"200001255","TRLT3":"200000030","ESPORTSTMNT04":"200001536"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1421,"slug":"rogu","name":"Rogu Sama","firstName":"Burak","lastName":"Eryol","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rogu-1z5rl0lr.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-06-13","createdAt":"2016-08-22T15:03:26.000Z","updatedAt":"2017-07-21T15:07:51.000Z","bios":{"en_US":"","tr_TR":"Burak \"Rogu sama\" Eryol Şampiyonluk Ligi’nin en tecrübeli destek oyuncularından biri. Profesyonel oyuna BPI ve ANT Gaming takımlarıyla başlasa da Oyunhizmetleri’yle Şampiyonluk Ligi’ne dönene kadar bir süre üst ligden uzak kaldı. Oyunhizmetleri’nde gösterdiği performans sonrası Ruvelius ile Immortoru’nun Şampiyonluk Ligi’nin en korkulan ikililerinden biri haline gelmesini sağlayan gizli kahraman Rogu sama, bir sonraki mevsim Beşiktaş.Oyunhizmetleri’nin KMF oynayan kadrosunda yer aldı. SL i-League turnuvasında da birinci olarak ülkemizi başarıyla temsil eden Beşiktaş.Oyunhizmetleri, aynı başarıyı Şampiyonluk Ligi’nde gösteremedi. Bir sonraki mevsim, mevsim finallerinde Dark Passage’a transfer olan Rogu sama özellikle TBF’de rakip destek Dumbledoge’u kilitleyerek takımının şampiyon olmasında büyük katkı sahibi oldu. Geçtiğimiz mevsim aynı performansı gösteremeyen Rogu bu mevsim Galakticos formasıyla ter dökecek.\n <br><br>\nYeni mevsimde Zeitnot, HolyPhoenix ve Ruve sama yerine tecrübesiz bir oyuncu olan meân ile oynayacak olan Rogu sama’nın artık işi daha zor. Bu mevsimde tank destek şampiyonlar metada kendisine yer bulursa Rogu sama’nın işi oldukça kolaylaşacaktır. Bu mevsime en iddialı kadrolardan biriyle giren Galakticos eğer TBF’de yer almak istiyorsa desteklerinin sergileyeceği performansa çok ihtiyaçları olacak.\n"},"foreignIds":{"ESPORTSTMNT03":"200001237"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1864,"slug":"tolerant","name":"Tolerant","firstName":"Barış","lastName":"Çepnioğlu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tolerant-9q5v56mb.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-04-14T10:25:19.000Z","updatedAt":"2017-07-21T14:38:44.000Z","bios":{"en_US":"","tr_TR":"Almanya doğumlu Türk oyuncu, profesyonel arenaya adım atalı henüz bir buçuk ay olmasına karşın en prestijli iki Türk ekibinin formasını giymeyi başardı. İlk olarak Dark Passage.BKM Express’te HolyPhoenix’in yanında görev alan genç destek, şimdi ise BAUSuperMassive’de Zeitnot’un partneri olacak.<br><br>\nTolerant’ın doldurması gereken boşluk da, üzerindeki sorumluluk da çok büyük. Takımın yıldız desteği Dumbledoge’un yerini alacak genç oyuncunun sürekli selefiyle karşılaştırılması kaçınılmaz gibi duruyor. Her ne kadar BAUSuperMassive’in makro oyununa sağlayacağı uyum merak konusu olsa da, en iyilerle çalışma fırsatına sahip olamsı Tolerant'ın uyum sürecini hızlandıracaktır."},"foreignIds":{"ESPORTSTMNT03":"200001460","ESPORTSTMNT04":"200002914"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1925,"slug":"secaf","name":"Secaf","firstName":"Sercan","lastName":"Çevikoğlu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/secaf-i0wakbms.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-05-29T04:37:58.000Z","updatedAt":"2017-07-21T14:43:49.000Z","bios":{},"foreignIds":{"ESPORTSTMNT04":"200002635"},"socialNetworks":{},"champions":[],"liveGameTeam":199}],"scheduleItems":[{"id":"AVuhncYAQMQFcjhwbQy1","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:ff06f60c-bd9d-4664-89d7-3f959e524ce8","scheduledTime":"2017-04-30T22:00:00.793+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:2aa734c2-34cc-4dca-b12c-8b6d6bc54421","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"ff06f60c-bd9d-4664-89d7-3f959e524ce8","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"2aa734c2-34cc-4dca-b12c-8b6d6bc54421","league":"10"}],"gameIdMappings":[{"id":"89ad8ce8-243b-4588-a65d-85218c8ac3a0","gameHash":"78c944a81502fcba"}],"videos":[{"id":6736,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:89ad8ce8-243b-4588-a65d-85218c8ac3a0","source":"https://www.youtube.com/embed/qjxXVUwQgT0","createdAt":"2017-04-30T23:22:52.000Z","updatedAt":"2017-04-30T23:22:52.000Z","game":"89ad8ce8-243b-4588-a65d-85218c8ac3a0"},{"id":6741,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:89ad8ce8-243b-4588-a65d-85218c8ac3a0","source":"https://www.youtube.com/watch?v=zwtxKlVjkDE&wmode=transparent","createdAt":"2017-05-01T00:48:38.000Z","updatedAt":"2017-05-01T00:48:38.000Z","game":"89ad8ce8-243b-4588-a65d-85218c8ac3a0"},{"id":6748,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:89ad8ce8-243b-4588-a65d-85218c8ac3a0","source":"https://www.youtube.com/embed/cEmWUmXgpqo?wmode=transparent","createdAt":"2017-05-01T04:22:23.000Z","updatedAt":"2017-05-01T04:22:23.000Z","game":"89ad8ce8-243b-4588-a65d-85218c8ac3a0"},{"id":6937,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:89ad8ce8-243b-4588-a65d-85218c8ac3a0","source":"https://www.youtube.com/embed/PK1418ssY9c","createdAt":"2017-05-29T03:38:18.000Z","updatedAt":"2017-05-29T03:38:18.000Z","game":"89ad8ce8-243b-4588-a65d-85218c8ac3a0"}],"htmlBlocks":[],"match":{"id":"ff06f60c-bd9d-4664-89d7-3f959e524ce8","name":"RED-vs-SUP","position":1,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"},{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],"games":{"89ad8ce8-243b-4588-a65d-85218c8ac3a0":{"id":"89ad8ce8-243b-4588-a65d-85218c8ac3a0","name":"G1","generatedName":"RED|SUP|G1|ff06f60cbd9d466489d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"},{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],"standings":{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496028942063,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493612560227,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493599666368,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493594762593,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493594509210,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120208","gameRealm":"TRLT3","platformId":"TRLT3:120208","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1496028942063,"source":"bestOf","history":[{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493612560227,"source":"bestOf","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493599666368,"source":"bestOf","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493594762593,"source":"bestOf","closed":true},{"result":[[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}]],"timestamp":1493594509210,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a82b08e8-e605-476a-8218-b516055104a6":1,"885b7fdb-c6a6-47cb-98e0-1ae83f63d397":0}}}