[{"slug":"3-days-3-don-jr-shocks-to-west-wing-2457197688","author":"Mike Allen","date":"1499768905","body":"\n                <p>Top West Wing aides acknowledge that the three consecutive days of baffling, brutal disclosures about Donald Trump Jr.'s Russia meeting during the campaign is a story that will stick, with potentially momentous political and legal consequences.</p> <p><strong>Thought for the day:</strong> If The New York Times knows all this, imagine what Bob Mueller knows.<br/></p>\n                \n                <p><strong>The dang emails: </strong><a href=\"https://www.nytimes.com/2017/07/10/us/politics/donald-trump-jr-russia-email-candidacy.html\" target=\"_blank\">Last night's detonation</a>, leading the paper with a 2-column headline, \"Trump's Son Heard of Link To Moscow Before Meeting\":</p> <ul> <li><strong>\"Before arranging a meeting </strong>with a Kremlin-connected Russian lawyer he believed would offer him compromising information about Hillary Clinton, Donald Trump Jr. was informed in an email that the material was part of a Russian government effort to aid his father's candidacy.\"</li><li><strong>\"The email</strong> to the younger Mr. Trump was sent by Rob Goldstone, a publicist and former British tabloid reporter who helped broker the June 2016 meeting.\"</li><li>\"Goldstone's message ... indicates that the Russian government was the source of the potentially damaging information.\"</li><li><strong>The internal mood, per The Times:</strong> \"News of the meeting involving the younger Mr. Trump, Mr. Kushner and Mr. Manafort blunted whatever good feeling the president's team had after his trip to Europe for the Group of 20 economic summit meeting.\"</li><li><strong>\"The president was frustrated </strong>by the news of the meeting ... — less over the fact that it had happened, and more because it was yet another story about Russia that had swamped the news cycle.\"</li></ul> <p><strong>Be smart: </strong>A consequence of these stories is that no blanket denial of anything by this White House will be believable. So the President and his team can expect to be nibbled by ducks as long as they're in office.</p> <strong>P.S. </strong> \" <a href=\"http://link.axios.com/click/10048450.22/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMTctMDctMTEva3VzaG5lci1jb3Mtc291Z2h0LXFhdGFyLWZ1bmRzLWFzLWphcmVkLWFkdmlzZWQtdHJ1bXA_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/587e487172fbf2056f8b4e5eB7ac35c5c\" target=\"_blank\">Kushner Cos. Sought Qatar Funds</a>  as Jared Advised Trump,\" by Bloomberg's David Kocieniewski: \"A few months before President Donald Trump encouraged Saudi Arabia and others to blockade Qatar, the real estate business owned by the family of his son-in-law, Jared Kushner, sought a substantial investment from one of the Gulf State country's wealthiest and most politically influential figures.\" <br/> <div></div>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>A consequence of these stories is that no blanket denial of anything by this White House will be believable. So the President and his team can expect to be nibbled by ducks as long as they're in office."},{"slug":"a-media-wake-up-call-2452853371","author":"Sara Fischer","date":"1499160612","body":"\n                <p>Forget President Trump's Twitter terrorism against big media companies. The real and urgent web-world threats that could truly bring down a New York Times or CNN are the escalating cyberattacks targeting media and the companies they rely on.</p> <p><strong>Why it matters:</strong> The entire digital ecosystem is far more vulnerable to cyberattacks — and far more ill-prepared to respond — than we realize. \"A large part of this too comes from the fact that media companies are not at all prepared for these threats and the impact isn't always obvious until it's too late,\" says Asaf Cidon, CEO of cybersecurity firm Barracuda networks.</p>\n                \n                <ul><li>Last week, WPP, the global ad agency, and its subsidiary agencies were forced to shut down after a ransomware attack made their systems completely inoperable.</li><li>The day after the attack, Fastly, a content distribution network that acts as a backup for several mainstream media sites, like Reddit, The New York Times and Axios, went down due to an unrelated technical malfunction, leaving client websites vulnerable as a global ransomware attack was in motion.</li><li>In April, Google and Facebook, the two biggest tech giants globally, announced that they were the subject of a phishing scam worth over $100 million. And they have way better tech and security than conventional media companies.</li><li>Last October, a DDOS (bot-based) attack shut down half of the internet, including major media companies, like the Guardian, CNN and Twitter.</li></ul> <p><strong>Even more pressing: </strong>As media organizations become more <a href=\"https://www.cjr.org/local_news/american-news-deserts-donuts-local.php\" target=\"_blank\">centralized</a> through consolidation, security experts and safeguards get moved up the chain from the local level to far-flung city headquarters, leaving local outlets more vulnerable.</p> <p><strong>Be smart: </strong>Bone up on phishing attacks (a common and effective cyber-scam used to gain access to sensitive data through harmless click-here emails). Google <a href=\"https://www.mediapost.com/publications/article/294979/google-warns-journalists-of-state-sponsored-email.html\" target=\"_blank\">sent journalists</a> precautionary warnings of state-sponsored phishing attacks earlier this year.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Bone up on phishing attacks (a common and effective cyber-scam used to gain access to sensitive data through harmless click-here emails). Google <a href=\"https://www.mediapost.com/publications/article/294979/google-warns-journalists-of-state-sponsored-email.html\" target=\"_blank\">sent journalists</a> precautionary warnings of state-sponsored phishing attacks earlier this year."},{"slug":"amazon-has-scared-grocers-and-others-the-world-over-2443641378","author":"Steve LeVine","date":"1497804634","body":"\n                <p>In the 1970s, oil behemoths, then kings of the corporate world, bought up department stores, beef canners and even the Barnum and Bailey Circus. But is it <a href=\"http://www.latimes.com/business/technology/la-fi-tn-amazon-tech-acquisitions-20170616-story.html?\" target=\"_blank\">now the turn</a> of the big five U.S. tech companies to snap up some economic prizes?</p> <p>\n<strong>What was most surprising</strong> about Amazon's stunning $13 billion acquisition of Whole Foods last week was its juxtaposition with CEO Jeff Bezos' years of denunciations — and destruction — of brick-and-mortar retail chains. And people sense it may signal the front end of a wave of legacy sector acquisitions:\n</p> <ul>\n<li><strong>We already have</strong> Silicon Valley moving in on Detroit's turf, creating a tense contest for who will dominate self-driving transportation.</li>\n<li><strong>But to the degree the</strong><strong> Whole Foods </strong>acquisition is not an anomaly, don't look for the tech giants to mimic the oil companies of yore, and venture far from their core businesses.</li>\n<li><strong>Amazon is also unlikely</strong> to conduct a massive firing of workers, which would undermine the Whole Foods brand. </li>\n</ul>\n                \n                <p>\n<strong>What seems informative</strong> is Bezos's 2013 <a href=\"https://www.washingtonpost.com/business/economy/washington-post-closes-sale-to-amazon-founder-jeff-bezos/2013/10/01/fca3b16a-2acf-11e3-97a3-ff2758228523_story.html?utm_term=.beac0bd50b61\" target=\"_blank\">acquisition of the Washington Post</a>, which met immediate consternation that he would strip the paper to make it more profitable. Instead, he poured cash in, and the paper is turning out some of its best journalism in years.\n</p> <p>\n<strong>Be smart:</strong> That's why it seems best to ignore forecasts that Amazon will dramatically change Whole Foods culture, its fare, and operating style. Instead, he will want to embrace Whole Foods high-end quality brand, and hope it washes over onto cut-rate Amazon reputation.\n</p> <p>\n<strong>Capgemini's Shannon Warner</strong>, a retail consultant, tells Axios that Bezos will likely use Whole Foods to figure out how to make grocery shopping feel like less of a chore. If he can crack that problem, she said, \"people will embrace it overnight.\" And <em>that</em> will be a critical moment for other grocery chains, which \"waited too long and no longer have the capital to invest and survive.\"\n</p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":">\n<strong>Be smart:</strong> That's why it seems best to ignore forecasts that Amazon will dramatically change Whole Foods culture, its fare, and operating style. Instead, he will want to embrace Whole Foods high-end quality brand, and hope it washes over onto cut-rate Amazon reputation.\n"},{"slug":"blame-the-opioid-epidemic-on-a-lack-of-jobs-2412757452","author":"Christopher Matthews","date":"1496394190","body":"\n                <p>The opioid epidemic. Stagnating wages. The anti-establishment political wave. All are linked to the start of a new industrial age in which robotics, automation and artificial intelligence are changing the nature of work. First for low-skilled workers, and soon for more skilled occupations, from truck drivers to lawyers, doctors and Wall Street analysts.</p>\n                \n                <p>Here's former Treasury Secretary and Harvard professor Larry Summers, speaking to Axios:</p> <h5>\"People ask why fewer children have fathers at home. That is not unrelated to the absence of work for those fathers. People ask why there is a sense of estrangement, disillusionment, anger, and lack of confidence in institutions that led to the kind of spasmodic response we saw in the last election. That is not unrelated to the drying up of opportunities for men and for less skilled workers in general. ... There are not the kind of jobs that there once were.\"</h5> <p><strong>Why it matters:</strong> Deaths from opioid use <a href=\"https://www.hhs.gov/sites/default/files/Factsheet-opioids-061516.pdf\" target=\"_blank\">have more than quadrupled since 1999</a>, and addiction costs <a href=\"http://ldi.upenn.edu/sites/default/files/pdf/LDI%20CHERISH%20Brief%20final.pdf\" target=\"_blank\">almost $100 billion annually</a> — all linked, among other social trends, to stagnating income and the loss of jobs. Economists also connect unemployment and low wages with a breakdown of families, including <a href=\"http://www.ddorn.net/papers/Autor-Dorn-Hanson-MarriageMarket.pdf\" target=\"_blank\">a rise in children born</a> to unmarried mothers and living in single-parent households. </p> <p>This is the beginning of a social, political and economic transformation that Axios is tracking as part of a new Future of Work stream and newsletter <a href=\"https://www.axios.com/axios-future-of-work/\" target=\"_blank\">(subscribe here)</a>.</p> <p><strong>Be smart: </strong>If you look at the jobless data to which Summers is referring, you will see a disconnect — U.S. unemployment is at a low 4.4%, and to attract and retain workers, companies have had to begin to raise wages. But what Summers is suggesting is that this uptick may be illusory. Many economists expect robotization to eventually take hold as the economy is unable to keep producing enough jobs to compensate for lost ones. At that point, they say, unemployment will surge.</p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>If you look at the jobless data to which Summers is referring, you will see a disconnect — U.S. unemployment is at a low 4.4%, and to attract and retain workers, companies have had to begin to raise wages. But what Summers is suggesting is that this uptick may be illusory. Many economists expect robotization to eventually take hold as the economy is unable to keep producing enough jobs to compensate for lost ones. At that point, they say, unemployment will surge."},{"slug":"comey-testimony-nyt-article-not-true-fake-news-trump-2437836368","author":"Mike Allen","date":"1497006414","body":"\n                <p>Comey declared that a New York Times <a href=\"http://link.axios.com/click/9805878.11/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wMi8xNC91cy9wb2xpdGljcy9ydXNzaWEtaW50ZWxsaWdlbmNlLWNvbW11bmljYXRpb25zLXRydW1wLmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58496e1c1acbcdf9298b48a7Bb10c9988\" target=\"_blank\">front pager</a> from Feb. 14 — \"Trump Aides Had Contact With Russian Intelligence\" — was \"in the main ... not true. ... [W]e don't call the press to say, 'Hey, you got that thing wrong about this sensitive topic.' We just have to leave it there.\"</p> <p><strong>The article's lead:</strong> </p> <h5>\"Phone records and intercepted calls show that members of Donald J. Trump's 2016 presidential campaign and other Trump associates had repeated contacts with senior Russian intelligence officials in the year before the election, according to four current and former American officials.\"</h5>\n                \n                <p><a href=\"http://link.axios.com/click/9805878.11/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNi8wOC91cy9wb2xpdGljcy9qYW1lcy1jb21leS1uZXcteW9yay10aW1lcy1hcnRpY2xlLXJ1c3NpYS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58496e1c1acbcdf9298b48a7B427bdcd2\" target=\"_blank\">In today's paper,</a> the same three authors write: \"Comey did not say exactly what he believed was incorrect about the article ... The original sources could not immediately be reached after Mr. Comey's remarks, but in the months since the article was published, they have indicated that they believed the account was solid.\"</p> <p>On the other hand, Comey said <a href=\"http://link.axios.com/click/9805878.11/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNS8xNi91cy9wb2xpdGljcy9qYW1lcy1jb21leS10cnVtcC1mbHlubi1ydXNzaWEtaW52ZXN0aWdhdGlvbi5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58496e1c1acbcdf9298b48a7Bb586a4d2\" target=\"_blank\">another Times scoop</a> — reporting that Comey had written an in-the-moment memo saying Trump had asked him to shut down the investigation of former national security adviser Michael Flynn — had been spoon-fed to the paper through a friend.</p> <p>CNN had to backtrack from <a href=\"http://link.axios.com/click/9805878.11/aHR0cDovL3d3dy5jbm4uY29tLzIwMTcvMDYvMDYvcG9saXRpY3MvY29tZXktdGVzdGltb255LXJlZnV0ZS10cnVtcC1ydXNzaWFuLWludmVzdGlnYXRpb24vaW5kZXguaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58496e1c1acbcdf9298b48a7B2d954e1f\" target=\"_blank\">an article</a> originally headlined \"Comey expected to refute Trump,\" with this correction: \"The article and headline have been corrected to reflect that Comey does not directly dispute that Trump was told multiple times he was not under investigation in his prepared testimony released after this story was published.\"</p> <p><strong>Be smart:</strong> CNN's lapse, and the charge against The New York Times, provide ammunition for Trump partisans to shout \"Fake news!\" in an effort to discredit other reporting that is perfectly valid.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> CNN's lapse, and the charge against The New York Times, provide ammunition for Trump partisans to shout \"Fake news!\" in an effort to discredit other reporting that is perfectly valid."},{"slug":"comey-truth-bomb-2436662319","author":"Mike Allen","date":"1496919017","body":"\n                <p><strong>Jim Comey's <a data-linked-post=\"2435974660\" href=\"https://www.axios.com/read-comeys-full-opening-statement-on-trump-2435974660.html\">cinematic opening statement</a>,</strong> describing his <a data-linked-post=\"2435996088\" href=\"https://www.axios.com/comeys-key-encounters-with-trump-2435996088.html\">awkward encounters</a> with President Trump in vivid detail that you almost never get from inside government, foretells gripping testimony when the fired FBI director goes before Capitol Hill cameras at 10 a.m. ET today.</p>\n                \n                <p><strong>MSNBC's Lawrence O'Donnell </strong>pointed out that any actor would want to act it, and any director would want to direct it.</p> <p><strong>Comey's pre-released testimony, </strong>about a Jan 27 dinner in the White House Green Room: \"[T]he President said, 'I need loyalty, I expect loyalty.' I didn't move, speak, or change my facial expression in any way during the awkward silence that followed. We simply looked at each other in silence.\"</p> <p><strong>For all the cable-news talk</strong> of smoking guns, top Republicans were authentically relieved by what they read in the afternoon bombshell.</p> <p><strong>Their reaction puzzled me at first,</strong> but here's a truth bomb: Comey's seven-page, 3,100-word statement describes unusual, unprecedented and, to most, disturbing behavior by the president. But it presents no new information that proves a crime:</p> <ul><li><strong>Read between the lines,</strong> and you see Trump's transactional side — trying to make a distraction go away, like you would in business. The problem of course, is that he's no longer just running a family business: Corner-cutting and interference doesn't work in the Oval.</li><li><strong>The <a href=\"https://www.nytimes.com/2017/05/16/us/politics/james-comey-trump-flynn-russia-investigation.html\" target=\"_blank\">rapier</a> <a href=\"https://www.nytimes.com/2017/05/18/us/politics/james-comey-memo-fbi-trump.html\" target=\"_blank\">reporting</a> </strong>by The New York Times' Michael Schmidt was perfectly borne out. Putting aside the astonishing atmospherics, the facts of Comey's account are what we expected, but not much more.</li><li><strong>The key passage,</strong> when Comey says Trump \"called me at the FBI\" on March 30: \"He said he had nothing to do with Russia, had not been involved with hookers in Russia, and had always assumed he was being recorded when in Russia. He asked what we could do to 'lift the cloud.'\"</li><li><strong>Brookings senior fellow</strong> Benjamin Wittes, a friend of Comey's and editor-in-chief of the Lawfare blog, <a href=\"https://lawfareblog.com/initial-comments-james-comeys-written-testimony\" target=\"_blank\">posted one of the best deconstructions</a> of the statement, calling the Trump scenes \"poisonous stuff ... conduct that a society committed to the rule of law simply cannot accept in a president.\"</li><li><strong>But Wittes also writes: </strong>\"Let's leave to another day whether anything the President did here amounts to any kind of obstruction of justice.\"</li><li><strong>A top Republican</strong> close to the White House said the statement \"shows Trump is relentless and unconcerned with Presidential behavioral conventions, which are two of the characteristics that won him votes.\"</li><li><strong>Republicans, though, </strong>need to recognize what they're defending: actions that show little respect or understanding for the lines and limits that safeguard rule of law. This isn't normal.</li></ul> <p><strong>Be smart</strong>: The road ahead is long. Comey's statement is captivating, but not grounds for impeachment. The threshold for any action is much higher than many think, because Republicans alone will set it.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart</strong>: The road ahead is long. Comey's statement is captivating, but not grounds for impeachment. The threshold for any action is much higher than many think, because Republicans alone will set it."},{"slug":"comey-vs-trump-2437227261","author":"Mike Allen","date":"1496956844","body":"\n                <p><strong>Game on! It's war </strong>— with more ammunition for both sides after today's mesmerizing testimony by fired FBI Director Jim Comey.<br/></p> <p><strong>In a morning-long Capitol Hill appearance</strong> marked by a theatrical precision that had workers around the country glued to their screens, Comey was happy to twist the knife: \"I take the president at his word, that I was fired because of the Russia investigation.\"</p> <p><strong>Unspooling startling detail</strong>, Comey <a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tL2NvbWV5LXRlc3RpZmllcy1pbi1mcm9udC1vZi1zZW5hdGUtaW50ZWwtY29tbWl0dGVlLWxpdmUtdXBkYXRlcy0yNDM2ODQ3OTE4Lmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NwbSZzdHJlYW09dG9wLXN0b3JpZXM/589555111acbcde1338b5135B50d1b541\" target=\"_blank\">bluntly described</a> how he engineered a dramatic leak to The New York Times, and ascribed his damaging in-the-moment memos to his \"gut feel\" that he needed to \"protect\" the FBI.</p> <p><strong>Trump's lawyer,</strong> litigator Marc Kasowitz, quickly responded with a combative statement accusing Comey of lying about Trump's demand for loyalty — \"never said it in form, and he never said it in substance\" — and of disclosing classified information in a way that \"appears to be entirely retaliatory.\"</p>\n                \n                <ul><li><strong>What's next:</strong> The back-to-back appearances set in motion months — perhaps years — of partisan back-and-forth that threatens to swamp Trump's legislative agenda.</li><li><strong>To their corners:</strong> White House officials and top Hill Republicans say that based on the expectations that Comey was going to accuse the president of a felony, today's events left Trump in roughly the same place he was, with no one's minds changed. Democrats called the visual devastating, and claimed that Comey had made an under-oath case that Trump was trying to interfere with the investigation.</li><li><strong>West Wing <a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tL2NvbWV5LWFzLWxlYWtlci10aGUtd2hpdGUtaG91c2VzLWxpa2VseS1hdHRhY2stc3RyYXRlZ3ktMjQzNzE0MzgwNS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zcG0mc3RyZWFtPXRvcC1zdG9yaWVz/589555111acbcde1338b5135B9ca97aa2\" target=\"_blank\">fears Mueller</a> way more than Comey:</strong> They were fairly relaxed after this morning. This is a team that's acclimatized over many months to a highly abnormal working environment. Some staff have become so numb to negative news stories that they've taken to asking reporters how bad new stories are \"on a scale of one to ten.\"</li><li><strong>Be smart: </strong>The down side of today is more fog — and the fog spawns the ugliness that freezes Washington and infects the national debate.</li></ul> <p><strong>Get up to speed: </strong><a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tL2NvbWV5LXRlc3RpZmllcy1pbi1mcm9udC1vZi1zZW5hdGUtaW50ZWwtY29tbWl0dGVlLWxpdmUtdXBkYXRlcy0yNDM2ODQ3OTE4Lmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NwbSZzdHJlYW09dG9wLXN0b3JpZXM/589555111acbcde1338b5135C50d1b541\" target=\"_blank\">Highlights and quotes</a>.</p> <p><strong>Go deeper: </strong><a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tLzctdGhpbmdzLXdlLWxlYXJuZWQtaW4tY29tZXlzLWZpcnN0LWhvdXItb2YtdGVzdGltb255LTI0MzY5NDYxNTMuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc3BtJnN0cmVhbT10b3Atc3Rvcmllcw/589555111acbcde1338b5135Bbc798a1b\" target=\"_blank\">What we learned</a> ... <a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tL3RoZS0xMC1xdWVzdGlvbnMtY29tZXktaGFzbnQtYW5zd2VyZWQteWV0LTI0MzYxNzUxMTkuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc3BtJnN0cmVhbT10b3Atc3Rvcmllcw/589555111acbcde1338b5135B7e6bcbf0\" target=\"_blank\">The questions Comey didn't answer</a></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":">\n                \n                <ul><li><strong>What's next:</strong> The back-to-back appearances set in motion months — perhaps years — of partisan back-and-forth that threatens to swamp Trump's legislative agenda.</li><li><strong>To their corners:</strong> White House officials and top Hill Republicans say that based on the expectations that Comey was going to accuse the president of a felony, today's events left Trump in roughly the same place he was, with no one's minds changed. Democrats called the visual devastating, and claimed that Comey had made an under-oath case that Trump was trying to interfere with the investigation.</li><li><strong>West Wing <a href=\"http://link.axios.com/click/9802720.25410/aHR0cHM6Ly93d3cuYXhpb3MuY29tL2NvbWV5LWFzLWxlYWtlci10aGUtd2hpdGUtaG91c2VzLWxpa2VseS1hdHRhY2stc3RyYXRlZ3ktMjQzNzE0MzgwNS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zcG0mc3RyZWFtPXRvcC1zdG9yaWVz/589555111acbcde1338b5135B9ca97aa2\" target=\"_blank\">fears Mueller</a> way more than Comey:</strong> They were fairly relaxed after this morning. This is a team that's acclimatized over many months to a highly abnormal working environment. Some staff have become so numb to negative news stories that they've taken to asking reporters how bad new stories are \"on a scale of one to ten.\"</li><li><strong>Be smart: </strong>The down side of today is more fog — and the fog spawns the ugliness that freezes Washington and infects the national debate.</li></ul> "},{"slug":"data-reveal-how-companies-are-using-automation-to-suppress-wages-2455120983","author":"Christopher Matthews","date":"1499638893","body":"\n                <p>\n\tIt's the great economic conundrum of our day: if the unemployment rate is so low, why aren't wages growing faster? The law of supply and demand tells us that as labor gets scarce, wages should rise. Yet, as we saw in the <a href=\"https://www.axios.com/jobs-2454900876.html?stream=future-of-work\" target=\"_blank\">latest jobs figures on Friday</a>, average U.S. hourly earnings have barely exceeded inflation for three years running.\n</p> <p>\n<strong>What's going on?</strong> The answer may lie in the <a href=\"https://frbatlanta.org/chcs/wage-growth-tracker/?panel=1\" target=\"_blank\">Wage Growth Tracker</a> (below), an alternative gauge produced by the Federal Reserve's Atlanta bank. It substantiates what a lot of people have suspected: that older, higher-paid workers are leaving the workforce and being replaced with cheaper, younger workers who hold little bargaining strength when they can be quickly replaced by automation.</p> <p></p> <div data-av-fallback-image=\"\" id=\"2017-07-08-wage-growth\" style=\"max-width:100%;\"></div>\n<script>\n    var pymParent = new pym.Parent('2017-07-08-wage-growth',  'https://graphics.axios.com/2017-07-08-wage-growth/2017-07-08-wage-growth.html', {});\n</script> <p><small class=\"image-media media-photo-credit\">Data: <a href=\"https://frbatlanta.org/chcs/wage-growth-tracker/?panel=1\">Federal Reserve Bank of Atlanta</a>; Chart: Lazaro Gamio / Axios</small></p>\n                \n                <p><strong></strong></p> <p><strong>A level deeper: </strong>Automation technology <a href=\"https://www.economist.com/news/finance-and-economics/21723403-recent-rise-earnings-skilled-workers-rare-phenomenon-what-history\" target=\"_blank\">has held down the wages</a> of lower skilled workers for more than four decades, by giving employers a fallback option when labor gets too expensive. Recent employment growth has been bringing these workers back to the labor market, but their power to negotiate higher wages remains weak. </p> <p><strong>An enduring headwind</strong>: BMO economist <a href=\"https://economics.bmocapitalmarkets.com/economics/focus/recent/170616doc.pdf\" target=\"_blank\">Sal Guatieri theorizes</a> that the growing number of applications for automation will keep wage growth low for the foreseeable future. \"New automation is working its way up and down the skills chain, threatening a wider range of jobs than in the past, including many non-routine positions,\" he writes.</p> <p>\n<strong>Be smart: </strong>The upside of automation is that it should increase the productivity of the workforce, which has historically been a necessary (although not always sufficient) condition for wage growth. But some leading economists say this relationship has broken down, and that we shouldn't be surprised if shareholders reap future gains of higher productivity while leaving workers no better off.</p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":">\n<strong>Be smart: </strong>The upside of automation is that it should increase the productivity of the workforce, which has historically been a necessary (although not always sufficient) condition for wage growth. But some leading economists say this relationship has broken down, and that we shouldn't be surprised if shareholders reap future gains of higher productivity while leaving workers no better off."},{"slug":"declining-startup-rates-2453945620","author":"Kim Hart","date":"1499761212","body":"\n                <p>For the first time on record, U.S. companies are actually dying at a faster rate than they're being born, according to an analysis by the Economic Innovation Group, a non-profit research and advocacy organization.</p> <p><strong>Why it matters:</strong> The slow rate of business starts means the U.S. economy is powered by a narrowing segment of companies, people and geographies — making the overall economy less resilient than it was after previous recessions. When fewer new companies are being born, it's less likely that the companies and jobs that are disappearing will be replaced by better ones. And without competitive pressures from upstarts, big companies are able to grow bigger faster, increasing industry consolidation.</p> <p></p> <div data-av-fallback-image=\"\" id=\"2017-07-05-new-firms\" style=\"max-width:100%;\"></div>\n<script>\n    var pymParent = new pym.Parent('2017-07-05-new-firms',  'https://graphics.axios.com/2017-07-05-new-firms/2017-07-05-new-firms.html', {});\n</script>\n<small class=\"image-media media-photo-credit\">Data: <a href=\"https://www.census.gov/ces/dataproducts/bds/data_estab.html\" target=\"blank\">Census Bureau</a>; Chart: Chris Canipe / Axios</small>\n                \n                <p>\"This is new territory for the U.S. economy,\" said John Lettieri, co-founder of EIG. \"Firms that don't get created don't create jobs...The ripple effects are really hard to overstate.\"<br/></p> <p><span></span>The birth rate of new companies collapsed with the Great Recession, and the number of firms that opened during the recovery period is lower than that of any other post-recession period.<br/></p> <p>The U.S. economy is increasingly reliant on a few metropolitan areas' expansion of companies. Between 2010 and 2014, five metro areas produced the same net increase in firms as the entire rest of the country:</p> <ol><li>New York</li><li>Miami</li><li>Los Angeles</li><li>Houston</li><li>Dallas</li></ol> <div>Essentially, this means that the number of markets with expanding bases of new companies are dwindling down to a few \"hubs,\" a big departure from the previous three decades when almost all U.S. metro areas consistently created more than enough new companies to replace the ones that closed. In the 1970s, more than one-third of metro areas met or exceeded the national startup rate. By the 2010s, only one in seven metro areas matches or exceeds the national startup rate.</div> <div><strong>What it means for communities</strong>: Areas where a lot of new companies are created tend to enjoy the benefits of stronger local economies, including opportunities to switch jobs, move between regions and earn higher salaries. Fewer communities are now experiencing those benefits, helping to fuel regional inequality, according to EIG. Already-disadvantaged areas seem to suffer the most from the startup slowdown, while thriving areas (typically centered around bigger cities) continued to grow more prosperous.</div> <div><strong>What happened?</strong> EIG suggests declining population growth, a sharp decline in startup capital (notably home equity) during the recession, and changes to the regulatory environment have been factors. The group's full analysis can be found <a href=\"http://eig.org/dynamism\" target=\"_blank\">here</a>. </div> <div><strong>Be smart:</strong> This plays into the growing gaps we see across the country between the haves and have-nots, the urban and rural areas — and even political views. </div>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":"> <ol><li>New York</li><li>Miami</li><li>Los Angeles</li><li>Houston</li><li>Dallas</li></ol> <div>Essentially, this means that the number of markets with expanding bases of new companies are dwindling down to a few \"hubs,\" a big departure from the previous three decades when almost all U.S. metro areas consistently created more than enough new companies to replace the ones that closed. In the 1970s, more than one-third of metro areas met or exceeded the national startup rate. By the 2010s, only one in seven metro areas matches or exceeds the national startup rate.</div> <div><strong>What it means for communities</strong>: Areas where a lot of new companies are created tend to enjoy the benefits of stronger local economies, including opportunities to switch jobs, move between regions and earn higher salaries. Fewer communities are now experiencing those benefits, helping to fuel regional inequality, according to EIG. Already-disadvantaged areas seem to suffer the most from the startup slowdown, while thriving areas (typically centered around bigger cities) continued to grow more prosperous.</div> <div><strong>What happened?</strong> EIG suggests declining population growth, a sharp decline in startup capital (notably home equity) during the recession, and changes to the regulatory environment have been factors. The group's full analysis can be found <a href=\"http://eig.org/dynamism\" target=\"_blank\">here</a>. </div> <div><strong>Be smart:</strong> This plays into the growing gaps we see across the country between the haves and have-nots, the urban and rural areas — and even political views. </div>\n                "},{"slug":"firing-james-comey-was-one-of-the-dumbest-political-mistakes-in-the-mo-2446722416","author":"Mike Allen","date":"1498214776","body":"\n                <p>President Trump's firing of FBI Director James Comey is rightly seen as a terrific legal blunder: He undercut an investigation that might have shown he never colluded with the Russians, and spawned one that could result in obstruction of justice charges.</p> <p><strong>Why it matters:</strong> Regardless of the legal outcome, it'll go down as one of the dumbest political mistakes in the modern era. One of the president's outside advisers calls it the gravest political mistake since Richard Nixon decided not to apologize to the American people for Watergate, and instead proceeded with the cover-up.</p>\n                \n                <h5>\"The Russia investigation is now the central narrative of the Trump administration, no matter what he does,\" the adviser said. \"He wanted to be a disruptive force for change, and now he's stuck in the quicksand of the swamp.\"</h5> <div>Trump himself has suggested to friends that he understands the bind he created: By taunting Comey about tapes that the president <a data-linked-post=\"2446300352\" href=\"https://www.axios.com/report-trump-doesnt-have-any-comey-tapes-2446300352.html\">admitted yesterday</a> don't exist, he hastened the chain of events that led to the appointment of special counsel Bob Mueller, who's expected to delve into the business affairs of the president and his family.</div> <div>In retrospect<strong>, </strong>if Trump had kept Comey and stopped obsessing about his investigation, his legal troubles might have blown over: No evidence of collusion has emerged. As David Brooks pointed out in <a href=\"https://www.nytimes.com/2017/06/20/opinion/russia-investigation-trump.html\" target=\"_blank\">one of the better columns of the month</a>, it's striking how little has surfaced on the collusion front, given the gush of anti-Trump leaks.</div> <div>Trump would be standing here today with a perfect record on contested special elections, a strong stock market, low unemployment and momentum heading into the tax reform debate. Instead, Trump's impulsive decision — made against the advice of several trusted advisers — has:</div> <ol><li><strong>Consumed Trump:</strong> In phone calls, staff meetings and tweets, the president rages about Mueller. This often pushes aside conversation about his legislative agenda, executive actions and planned messages.</li><li><strong>Trapped Trump:</strong> The Russia probe has now mushroomed into one that includes obstruction of justice, adding a self-created investigation that will eat up precious time for months or years to come.</li><li><strong>Tainted Trump: </strong>Polls show the vast majority voters disapprove of his handling of Comey and Russia. More importantly, Republicans inclined to believe he didn't collude with the Russians seem quite willing to believe he might have obstructed justice after canning Comey.</li><li><strong>Stalled Trump: </strong>He was hardly cooking with grease on the legislative front pre-Comey. Now, White House officials think they will be lucky to end 2017 with any substantial bills signed into law.</li><li><strong>Tagged Trump for 2020:</strong> If he runs again, Democrats can be expected to turn the firing, probes, and attacks on the special prosecutor into centerpieces of the case against Trump.</li></ol> <p><strong>Be smart: </strong>Trump changed the arc of his presidency on Day 110 by bouncing Comey. Now, Trump's great fight is to have his presidency remembered for something else.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Trump changed the arc of his presidency on Day 110 by bouncing Comey. Now, Trump's great fight is to have his presidency remembered for something else."},{"slug":"frustrated-trump-plans-to-diminish-or-oust-top-russia-lawyer-2460222861","author":"Mike Allen","date":"1500209091","body":"\n                <p>The \"Hunger Games\" that have afflicted Trump's staff have lately begun to infect the various Russia-related legal teams — backbiting, second-guessing, lack of trust.<br/></p> <div><div><p><strong>Trump loyalists think help is on the way:</strong> The White House yesterday announced the appointment of the mustachioed Ty Cobb, a respected Washington lawyer specializing in white-collar defense, to President Trump's government staff as \"Special Counsel.\"</p><p><strong>We're told Cobb is fully empowered:</strong> Jay Sekulow, the outside Trump lawyer who's doing all five Sunday shows today, will stay. Marc Kasowitz, an outside Trump lawyer whose <a href=\"http://link.axios.com/click/10091306.12/aHR0cHM6Ly93d3cucHJvcHVibGljYS5vcmcvYXJ0aWNsZS9tYXJjLWthc293aXR6LXRydW1wLWxhd3llci10aHJlYXQtZW1haWxzLW1hZGRvdz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9B62832a74\" target=\"_blank\">bad press</a> empowered his internal critics, will likely be diminished or leave the team, according to people close to POTUS.</p></div></div>\n                \n                <p>There's much hope inside that Ty can help partition the investigation from the rest of White House work — and that he can have a beneficial effect on minimizing POTUS distractions and ill-advised tweets, etc. But few on the inside know him or have been briefed on specifics of the role he's being asked to play.</p> <p style=\"margin-left: 20px;\"><strong>From his <a href=\"http://link.axios.com/click/10091306.12/aHR0cHM6Ly93d3cuaG9nYW5sb3ZlbGxzLmNvbS9lbi90eS1jb2JiP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58af12c227fdb0d83d8b51d9C660bac97\" target=\"_blank\">Hogan Lovells</a> law-firm bio:</strong> \"Bet-the-company litigation calls for a unique combination of skills, experience, and track record. Ty Cobb ... has been widely recognized as one of the premier white collar, Securities and Exchange Commission (SEC) enforcement, and congressional investigations lawyers in the world.</p> <p style=\"margin-left: 20px;\">\"Clients managing crises, allegations of corruption, and other critical matters turn to Ty ... Ty's wide-ranging enforcement, bribery, and corruption practice has taken him to more than 35 countries and 44 states.\"</p> <p>Friends of Trump describe Cobb, who's <a href=\"http://link.axios.com/click/10091306.12/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMTctMDctMTQvdHJ1bXAtc2FpZC10by1oaXJlLWxhd3llci10eS1jb2JiLXRvLXJlc3BvbmQtdG8tcnVzc2lhLXByb2Jlcz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9B86465eb0\" target=\"_blank\">said to be related</a> to the baseball Hall of Famer, as \"adult supervision,\" both internal and external.</p> <p>\"It hasn't been clear who internally has been in charge,\" said one Trump confidant. \"This brings some struture and grown-up leadership on this issue.\"</p> <p>Insiders say Cobb will serve as a Grand Central for congressional and other Russia probes, and will set guardrails for who can and can't talk to each other about the matter internally. Everything will have the ultimate aim of protecting the President.</p> <p>Cobb's role will be the eye in the sky — the quarterback. One Trump veteran calls Cobb \"the official wall of Russia.\"</p> <p>The problem is that the President doesn't want to be protected: He has resisted earlier efforts to insulate him from potentially landmines, including defending Don Jr.</p> <p><strong>Scoop:</strong> Look for Don Jr. to retain new advisers soon.</p> <p><strong>Be smart:</strong> Trump has carried a self-jeopardizing gene that's perplexed partners throughout his career. If Cobb can provide a clear path, it'll take pressure off Trump from thinking he has to do it all himself — which is when he gets in trouble.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Trump has carried a self-jeopardizing gene that's perplexed partners throughout his career. If Cobb can provide a clear path, it'll take pressure off Trump from thinking he has to do it all himself — which is when he gets in trouble."},{"slug":"glum-house-leaders-begin-search-for-fallbacks-2456164396","author":"Jonathan Swan","date":"1499617149","body":"\n                <p>House Republican leaders are beginning to give significant thought to what their exit-for-August bills look like if they don't have healthcare to leave on.</p> <ul><li><strong>What we're hearing:</strong> House members are super-anxious about health care, and the pessimism levels are rising about getting a bill from the Senate. As everyone predicted, including Mitch McConnell: the July 4 recess made a bad situation worse.</li><li><strong>The brutal math: </strong>Assuming Vice President Pence as the tie-breaker, Republicans can only lose 2 senators. There are at least 3 \"hard\" nays (Susan Collins of Maine, Rand Paul of Kentucky and Dean Heller of Nevada), and perhaps 5 (add Mike Lee of Utah and Ted Cruz of Texas). Lisa Murkowski of Alaska is on the bubble.</li></ul>\n                \n                <p>The WashPost has a bearish story at the top of column 1 today, \"<a href=\"http://link.axios.com/click/10034884.20658/aHR0cDovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vcG93ZXJwb3N0L3JlcHVibGljYW5zLWluY3JlYXNpbmdseS11bmNlcnRhaW4tb2YtYS1sZWdpc2xhdGl2ZS12aWN0b3J5LWJlZm9yZS1hdWd1c3QvMjAxNy8wNy8wOC8yYjEzMDc4YS02MzFiLTExZTctYTRmNy1hZjM0ZmMxZDlkMzlfc3RvcnkuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9B12edb348\" target=\"_blank\">GOP is far from goals as recess approaches</a>,\" by Mike DeBonis and Ed O'Keefe: \"Virtually every piece of their ambitious legislative agenda is stalled, according to multiple Republicans inside and outside of Congress.\"</p> <p>\"The fallout, according to these Republicans, could be devastating in next year's midterm elections.\"</p> <p><strong>Be smart:</strong> The doomsday forecasts fail to account for the fact that in Congress, everything is always in trouble until politics creates momentum. But at the moment, that looks about as likely as Vladimir Putin finding the real hacker.</p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> The doomsday forecasts fail to account for the fact that in Congress, everything is always in trouble until politics creates momentum. But at the moment, that looks about as likely as Vladimir Putin finding the real hacker."},{"slug":"gop-scrambles-to-defuse-shutdown-bomb-2331714482","author":"Mike Allen","date":"1490610890","body":"\n                <p><strong>A top Republican</strong> with close ties to the White House tells me that after the GOP failure on healthcare, a government shutdown — looming when a continuing resolution runs out April 28 — is <strong>\"more likely than not... Wall Street is not expecting a shutdown and the markets are unprepared.\"</strong></p>\n                \n                <p><strong></strong></p> <p><strong>And Chris Krueger</strong> of Cowen Washington Research Group today will warn financial clients: \"Hello April 29 government shutdown.\" </p> <p><strong>That's Day 100 </strong>of the Trump presidency, by the way.<br/></p> <p><strong>A senior GOP aide </strong>disputed the bearish forecasts: \"The White House and Republicans on the Hill cannot/won't risk a shutdown. Given the last week — it's out of the question.\"<br/></p> <ul><li><strong>Reality check</strong>: While the GOP may have the will, party strategists don't see the way: The bleak House GOP math remains, with no sign it'll change. And the GOP can't count on the twin hail Marys floated over the weekend: enlisting moderate Dems (as we reported yesterday), or the Congressional Black Caucus (as Jonathan Swan revealed in his Sunday-night newsletter, Sneak Peek).</li><li><strong>T</strong><strong>he message CEOs took </strong>from Friday's fiasco, according to an executive at a money-center bank: \"Holy crap! We may be facing the same crap on a shutdown threat, and on the debt ceiling. Holy crap! We may not get tax reform, or a repatriation bill, or infrastructure spend, or substantial changes to regulations.\"</li><li><strong>Be smart: </strong>Job 1 for Republicans, who technically control the government, is to convince investors and voters that they have some path to getting things done. But first (Russert homage!), they'll have to convince themselves.</li></ul>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"> <ul><li><strong>Reality check</strong>: While the GOP may have the will, party strategists don't see the way: The bleak House GOP math remains, with no sign it'll change. And the GOP can't count on the twin hail Marys floated over the weekend: enlisting moderate Dems (as we reported yesterday), or the Congressional Black Caucus (as Jonathan Swan revealed in his Sunday-night newsletter, Sneak Peek).</li><li><strong>T</strong><strong>he message CEOs took </strong>from Friday's fiasco, according to an executive at a money-center bank: \"Holy crap! We may be facing the same crap on a shutdown threat, and on the debt ceiling. Holy crap! We may not get tax reform, or a repatriation bill, or infrastructure spend, or substantial changes to regulations.\"</li><li><strong>Be smart: </strong>Job 1 for Republicans, who technically control the government, is to convince investors and voters that they have some path to getting things done. But first (Russert homage!), they'll have to convince themselves.</li></ul>\n                "},{"slug":"how-ubers-culture-doomed-kalanick-2446163101","author":"Mike Allen","date":"1498132836","body":"\n                <p>The Wall Street Journal this morning calls Uber CEO Travis Kalanick's \"<a href=\"http://link.axios.com/click/9906407.90715/aHR0cHM6Ly93d3cud3NqLmNvbS9hcnRpY2xlcy9ob3ctdWJlci1iYWNrZXJzLW9yY2hlc3RyYXRlZC1rYWxhbmlja3Mtb3VzdGVyLWFzLWNlby0xNDk4MDkwNjg4P3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48B22b429dc\" target=\"_blank\">abrupt surrender</a> ... a stunning fall for one of the most celebrated careers in Silicon Valley.\" Kalanick keeps his board seat, retains control of a majority of Uber's voting shares, and had the pleasure of seeing a critic, venture capitalist Bill Gurley, <a href=\"http://link.axios.com/click/9906407.90715/aHR0cHM6Ly93d3cuYXhpb3MuY29tL2JlbmNobWFyay1wYXJ0bmVyLXRvLXN0ZXAtb2ZmLXViZXJzLWJvYXJkLTI0NDU5MDY3MDAuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48Bafa264b2\" target=\"_blank\">leave the board</a>. </p> <ul><li><strong>But this was a very personal rejection</strong><strong> of a corporate culture</strong> that was long viewed as aggressive and unrestrained, then harshly scrutinized amid complaints of sexual harassment and discrimination.</li><li><strong>I just finished the well-timed new book</strong> by Fortune's Adam Lashinsky, \"Wild Ride: Inside Uber's Quest for World Domination.\"</li><li><strong>My big takeaway: </strong>The fiasco at Uber is a product of the same phenomenon we're seeing in the Trump West Wing: Corporate cultures, whether healthy or sick, flow from the top — and are set in the organization's earliest days.</li></ul>\n                \n                <p>A few memorable passages:</p> <ul><li><strong>\"Travis Kalanick </strong>... came to define what it meant to be a tech entrepreneur in the second decade of the twenty-first century ... the philosopher/execution guy, a jerk to many.\"</li><li><strong>Over the years,</strong> there was \"a sense of shiftiness about Kalanick, a can't-quiet-put-your-finger-<wbr>on-it untrustworthiness that would irk some who deal with him.\"</wbr></li><li><strong>Ilya Hykinson,</strong> a Kalanick colleague at an earlier start-up, recalls: \"He'd write a large dollar figure on the whiteboard, circling it and outlining it for effect, just in case somebody came by and saw it ... That's kind of a weird, sleazy move.\"</li><li><strong>\"Kalanick ... seemed incapable,</strong> in public or in private, of holding back ... His widely quoted whoppers sometimes had an intellectually defensible ring to them. Yet they suggested a shocking lack of empathy or, at the very least, an inability to know when to keep quiet.\"</li></ul> <p>Be smart: The values you project, whether they're intentional or not, will quickly pollinate through your organization. Know what they are, and make sure they're what you want.</p> <p><strong>For a look at our culture,</strong> read \"<a href=\"http://link.axios.com/click/9906407.74977/aHR0cHM6Ly93d3cuYXhpb3MuY29tL3NwL2Fib3V0Lz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/583ee2d50aea11da218b513aB675a6c82\" target=\"_blank\">The Axios Manifesto</a>\" here.</p>\n                ","trump":true,"beSmart":false,"beSmarC":true,"smarts":">Be smart: The values you project, whether they're intentional or not, will quickly pollinate through your organization. Know what they are, and make sure they're what you want."},{"slug":"it-all-comes-down-to-trump-and-putin-2456109535","author":"Mike Allen","date":"1499611680","body":"\n                <p>President Trump began his high-stakes Putin meeting, according to <a href=\"http://link.axios.com/click/10034884.20658/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC93b3JsZC9ldXJvcGUvZ3JvdXAtb2YtMjAtdHJ1bXAtZXVyb3BlLmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbSZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9B960b54af\" target=\"_blank\">an account</a> by the N.Y. Times' Glenn Thrush, by saying: \"I'm going to get this out of the way: Did you do this?\"</p> <ul><li><strong>Russian hacking/propaganda ops in the 2016 election aren't a question in many minds besides Trump's</strong>. So that's certainly not a very muscular opening if you're interested in deterrence or retribution.</li><li><strong>But Trump has shown</strong> little inclination for either: Not only does he not buy the extent of the Russian transgression, he has continued to call it \"fake\" in private.</li><li><strong>Axios' Jonathan Swan</strong> texts me: \"The cognitive dissonance — between his pride in his victory, and the fact that a sinister foreign force might've helped him — is too strong for him to ever fully believe it.\"</li></ul>\n                \n                <p>During an Air Force One briefing on the way home, National Security Adviser H.R. McMaster told reporters: \"What the President and Secretary [of State] Tillerson charged us with as they came out of the meeting is what we're going to do going forward.\"</p> <p>Treasury Secretary Steven Mnuchin, in the same gaggle, added one intriguing detail: \"After a very substantive discussion on this, they reached an agreement that they would start a cyber unit to make sure that there was absolutely no interference whatsoever, that they would work on cybersecurity together.\"</p> <p><strong>Good luck with that!</strong> Marco Rubio <a href=\"http://link.axios.com/click/10034884.20658/aHR0cHM6Ly90d2l0dGVyLmNvbS9tYXJjb3J1YmlvP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58af12c227fdb0d83d8b51d9B9b6e5e66\" target=\"_blank\">tweets</a>:<em> </em>\"Partnering with Putin on a 'Cyber Security Unit' is akin to partnering with Assad on a 'Chemical Weapons Unit.'\"</p> <p><strong>For all the back-patting</strong> among his aides as they post-gamed the trip, they were reminded of the water torture that they were returning to: While Air Force One was aloft, the N.Y. Times posted a <a href=\"http://link.axios.com/click/10034884.20658/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58af12c227fdb0d83d8b51d9B4a2dadbe\" target=\"_blank\">front-page story</a> about a meeting last June with \"a Russian lawyer who has connections to the Kremlin,\" arranged by one of Trump's sons, Don Jr., and attended by Jared Kushner and campaign chairman Paul Manafort.<br/></p> <p><strong>Be smart:</strong> Russia is<em> the</em> story of this presidency. Think about the past month alone: multiple investigations of collusion in full swing ... Trump at odds with virtually every federally elected Republican over Russia sanctions ... Trump-Putin meeting overshadows G-20 ... and now our Syria strategy hinges on Russia cooperation. <em>It's like a Trump-Putin ticket is running the world!</em></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Russia is<em> the</em> story of this presidency. Think about the past month alone: multiple investigations of collusion in full swing ... Trump at odds with virtually every federally elected Republican over Russia sanctions ... Trump-Putin meeting overshadows G-20 ... and now our Syria strategy hinges on Russia cooperation. <em>It's like a Trump-Putin ticket is running the world!</em>"},{"slug":"jeff-sessions-testimony-update-next-steps-2441523755","author":"Mike Allen","date":"1497439146","body":"\n                <p>Dems smell blood, but it's not necessarily Jeff Sessions'. The attorney general held his own at his high-stakes Senate hearing, at one point raising his voice to declare he was \"not stonewalling,\" and resented the \"secret innuendo being leaked out there about me.\"</p> <p><strong>But Democrats tell me </strong>that with his dodges, artful and otherwise (<a href=\"http://link.axios.com/click/9843129.22/aHR0cDovL3d3dy5sYXRpbWVzLmNvbS9wb2xpdGljcy9sYS1uYS1wb2wtc2Vzc2lvbnMtaGVhcmluZy0yMDE3MDYxMy1zdG9yeS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/587e487172fbf2056f8b4e5eB1447d948\" target=\"_blank\">L.A. Times</a> lead: \"Sessions defends, demurs and deflects\"), Sessions left a host of openings — about himself and President Trump — that congressional investigators will pursue. Bob Mueller's prosecutors can be expected to do the same.</p>\n                \n                <p><strong>The real audience:</strong> Jeremy Bash, a lawyer and former Obama national security official, told Brian Williams on MSNBC: \"I think Mueller could use a grand jury and overcome this [implied] claim of executive privilege.\"<br/></p> <ul><li><strong>\"[W]hen he was asked, </strong>... '[W]hat did [Trump] say about the rationale for firing Comey,' the attorney general refused to answer. That goes to the heart of the question of whether the president may have obstructed justice.\"</li></ul> <p><strong>Between the lines:</strong> Matt Miller, an Obama Justice Department official who has become a go-to commentator on the investigation, emailed me: \"[N]o immediate public revelation, but a red flag in front of the bull named Bob Mueller. ... If Sessions had a good answer about conversations with Trump about firing Comey, he would've just given it.\"</p> <ul><li><strong>\"Sessions can probably get out of ever </strong>giving the answer to a Republican Congress, but my guess is his performance earned him a ticket to a grand jury.\"</li><li><strong>Senate Democratic Leader </strong><strong>Chuck Schumer</strong>: \"If you had done nothing wrong, the obvious conclusion is you'd be happy to talk about things.\"</li></ul> <p><strong>But, but, but: </strong>Jonathan Swan points out that the White House and the RNC war room got what they wanted, with more fodder for attacking Comey's credibility, and we should expect them to use it.</p> <p><strong></strong><strong>Over on Fox News, </strong>Tucker Carlson continued his nightly defense of Sessions with a sarcastic: \"It's always possible that a high-level defector will appear ... with documents proving that Jeff Sessions is, in fact, a foreign agent, ... perhaps of a sleeper cell sent to Alabama during the Cold War and activated at Vladimir Putin's request during the last election.\"</p> <p><strong>Be smart: </strong>Sessions was never the \"satellite\" Trump insiders fret most.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Sessions was never the \"satellite\" Trump insiders fret most."},{"slug":"jobs-report-retail-employment-falls-again-in-june-2430171961","author":"Christopher Matthews","date":"1496409438","body":"\n                <p>\n\tAmerican retail workers have now lost jobs for the fourth straight month, locking in a trend in which shoppers are spurning bricks-and-mortar shops and buying on-line.\n</p> <p>\n\tThe U.S. economy added 138,000 new jobs in May, and the unemployment rate dipped to 4.3%, \n\t<a href=\"https://www.bls.gov/news.release/pdf/empsit.pdf\" target=\"_blank\">according to a report issued Friday by the Labor Department.</a> Markets won't be too disappointed with these headline numbers, even though job growth was below economist expectations by roughly 50,000.\n</p> <p>\n</p> <div data-av-fallback-image=\"\" id=\"2017-06-02-retail-jobs\" style=\"max-width:100%;\"></div>\n<script>\n    var pymParent = new pym.Parent('2017-06-02-retail-jobs',  'https://graphics.axios.com/2017-06-02-retail-jobs/2017-06-02-retail-jobs.html', {});\n</script>\n<p>\n<small class=\"image-media media-photo-credit\">Data: <a href=\"https://www.bls.gov/iag/tgs/iag44-45.htm#workforce\">Bureau of Labor Statistics</a>; Chart: Lazaro Gamio / Axios</small>\n</p>\n                \n                <p>\n<strong>But retail had another tough month: </strong>In retail, 6,100 people lost their jobs, adding up to 80,300 since the start of the year, the government said. This falls in line with the US and global shift to on-line shopping.\n</p> <p>\n<strong>A level deeper: </strong>The trend occurs in one of the country's primary job sectors: some 15.9 million US workers are employed in retail, which has been a vital entry point for low-skilled workers, and a safe harbor for those who have fallen out of other jobs.\n</p> <p>\n<strong>Be smart:</strong> If this trend continues, the U.S. worker may lose a vital step on the ladder of economic mobility. Workers often earn only minimum wage, but without bricks-and-mortar stores and malls, it's hard to see where those employed in them will find other work.  <br/>\n</p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":">\n<strong>Be smart:</strong> If this trend continues, the U.S. worker may lose a vital step on the ladder of economic mobility. Workers often earn only minimum wage, but without bricks-and-mortar stores and malls, it's hard to see where those employed in them will find other work.  <br/>\n"},{"slug":"mueller-adds-muscle-for-russia-investigation-2439721714","author":"Mike Allen","date":"1497182718","body":"\n                <p>\"The Worst Thing That Happened to Donald Trump this Week\" — Paul Rosenzweig, on the <a href=\"http://link.axios.com/click/9820230.12/aHR0cHM6Ly9sYXdmYXJlYmxvZy5jb20vd29yc3QtdGhpbmctaGFwcGVuZWQtZG9uYWxkLXRydW1wLXdlZWs_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9B312b8888\" target=\"_blank\">Lawfare blog</a>: Special counsel \"Robert Mueller has hired Michael Dreeben, on a part-time basis, to help with his investigation. Dreeben, a deputy in the Office of the Solicitor General, has argued more than 100 cases before the Supreme Court. His specialty has, for the last 20 years, been criminal matters and he has an encyclopedic knowledge of criminal law.\"</p> <p><strong>Be smart:</strong> Mueller is amassing the talent arsenal you'd build to bring criminal charges.</p>\n                \n                <ul><li><strong>Why it matters:</strong> \"[H]e is quite possibly the best criminal appellate lawyer in America (at least on the government's side). That Mueller has sought his assistance attests both to the seriousness of his effort and the depth of the intellectual bench he is building.\"</li><li><strong><a href=\"http://link.axios.com/click/9820230.12/aHR0cDovL3d3dy5uYXRpb25hbGxhd2pvdXJuYWwuY29tL2lkPTEyMDI3ODkxNzc1NDMvTXVlbGxlci1Fbmxpc3RzLVRvcC1DcmltaW5hbC1MYXctRXhwZXJ0LWZvci1SdXNzaWEtUHJvYmU_c2xyZXR1cm49MjAxNzA1MTEwNjEwMTEmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9Bad8f192a\" target=\"_blank\">National Law Journal</a>: </strong>\"The move signals that Mueller is seeking advice on the complexities that have arisen already in the investigations, including what constitutes obstruction of justice.\"</li><li><strong>Mueller's has had a spate</strong> of <a href=\"http://link.axios.com/click/9820230.12/aHR0cHM6Ly93d3cud2FzaGluZ3RvbnBvc3QuY29tL3dvcmxkL25hdGlvbmFsLXNlY3VyaXR5L3RvcC1jcmltaW5hbC1sYXctZXhwZXJ0LWpvaW5zLXNwZWNpYWwtY291bnNlbC1yb2JlcnQtbXVlbGxlcnMtcnVzc2lhLXByb2JlLzIwMTcvMDYvMDkvZGFhZmI4NmUtNGQ0NS0xMWU3LWJjMWItZmRkYmQ4MzU5ZGVlX3N0b3J5Lmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9Bc6ffeac4\" target=\"_blank\">other high-octane hires</a>, including Andrew Weissmann, chief of the fraud section of the Justice Department's Criminal Division.</li><li><strong><a href=\"http://link.axios.com/click/9820230.12/aHR0cHM6Ly93d3cuanVzdGljZS5nb3Yvb3BhL3ByL2FuZHJldy13ZWlzc21hbm4tc2VsZWN0ZWQtY2hpZWYtY3JpbWluYWwtZGl2aXNpb25zLWZyYXVkLXNlY3Rpb24tMD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9Bc4d03f51\" target=\"_blank\">Weissmann</a> </strong>was director of Justice's Enron Task Force, where he oversaw the prosecutions of Jeffrey Skilling, Ken Lay, and Andrew Fastow. While at the U.S. Attorney's Office in Manhattan, Weissmann helped prosecute high-ranking members of the Genovese, Colombo and Gambino crime families, and fought the infiltration of organized crime on Wall Street.</li></ul> <p>Coming attractions ... Attorney General Jeff Sessions, who was going to be pummeled with Russia questions during what was supposed to be a budget hearing before a Senate subcommittee <span style=\"background-color: initial;\">on Tuesday</span>, switched yesterday and will appear <span style=\"background-color: initial;\">Tuesday</span> before the Senate Intelligence Committee.<br/></p> <ul><li><strong>Deputy Attorney General</strong> Rod Rosentein will take his place answering appropriations questions. <em><a href=\"http://link.axios.com/click/9820230.12/aHR0cHM6Ly9ncmFwaGljcy5heGlvcy5jb20vcGRmL2xldHRlci10by1zZW4tcnMucGRmP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58af12c227fdb0d83d8b51d9B19b5d3c9\" target=\"_blank\">See Sessions' letter to the Intelligence Committee</a>.</em></li><li><strong><a href=\"http://link.axios.com/click/9820230.12/aHR0cHM6Ly9hcG5ld3MuY29tL2M3YmQ1NjMwNWI4MzQyNjc4NzU2M2U0ZjQ3NjRmMDBmL1RydW1wLWRvZGdlcy10YXBlcy1xdWVzdGlvbiwtZGVuaWVzLXNlZWtpbmctQ29tZXktJ2xveWFsdHknP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58af12c227fdb0d83d8b51d9Bb7852281\" target=\"_blank\">AP</a>: </strong>\"The House intelligence committee sent a letter Friday asking White House counsel Don McGahn whether any tape recordings or memos of Comey's conversations with the president exist now or had existed in the past.\"</li><li><strong>\"The committee also sent a letter </strong>to Comey asking for any notes or memos in his possession about the discussions he had with Trump before being abruptly fired last month. The committee is seeking the materials by June 23.\"</li></ul> <p><strong>The takeaway:</strong> All these moves show the Russia probe will remain constantly in Washington's forefront.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Mueller is amassing the talent arsenal you'd build to bring criminal charges."},{"slug":"parallel-universes-d-c-freaks-trump-country-shrugs-2405858217","author":"Mike Allen","date":"1494679080","body":"\n                <p><strong>President Trump </strong>may wind up paying a huge price for the Comey debacle. But so far, it's playing out a bit like the Access Hollywood tapes where Trump boasted to Billy Bush about groping women: Washington freaks and Trump Country yawns.</p> <p><strong>Instead of getting caugh</strong>t boasting of groping a woman's genitals, Trump kneecapped the FBI's top man. This time, the stakes are even higher: Trump has raised the possibility of secret taping in the People's House. And by his own account, he crossed traditional lines of independence between the White House and the FBI.</p>\n                \n                <p><strong>Out in the country, <em>though, </em></strong><em>t</em>he parallels in the public reaction are striking:</p> <ul><li><strong>Trump stands accused </strong>of doing something that would sink most politicians, or at least elicit remorse.</li><li><strong>Instead of lying low</strong> or backing off, Trump escalates.</li><li><strong>His staff panics</strong> but sticks with him.</li><li><strong>Democrats feel certain</strong> he's toast.</li><li><strong>All of us </strong>in the media spring into 24/7 outrage.</li><li><strong>And like Trump himself, </strong>the firing is broadly unpopular: <a href=\"http://www.gallup.com/poll/210674/comey-firing-nets-negative-reaction-1993-fbi-firing.aspx\" target=\"_blank\">In Gallup</a>, 46% disapprove, while 39% approve.</li></ul> <p><strong>But just like </strong>with the \"Access Hollywood\" tape, the vast majority of Republicans — and especially the Trump base — seem unfazed. For all the media/Democrat/Twitter histrionics, consider:</p> <ul><li><strong>The <a href=\"http://www.gallup.com/poll/201617/gallup-daily-trump-job-approval.aspx\" target=\"_blank\">Gallup daily tracking poll </a></strong>shows Trump's approval has held steady (40% the day of the firing, 41% two days later).</li><li><strong>Polls show two countries: </strong>In <a href=\"http://www.nbcnews.com/politics/politics-news/poll-majority-americans-think-comey-dismissal-was-inappropriate-n758106\" target=\"_blank\">NBC News/Survey Monkey</a>, 79% of Rs thought Trump acted appropriately, and 13% of Dems.</li><li><strong>Most elected Republicans</strong> are backing Trump or staying silent. <a href=\"https://apnews.com/c176496666f4467582185756360f7088/GOP-leaders-dismiss-Comey-firing-as-fleeting-political-drama\" target=\"_blank\">AP reports</a> that at the Republican National Committee's spring meeting out in Coronado, Calif., party leaders defended the president's actions and insisted that they would have little political impact.</li><li><strong>The Comey topic </strong>is hot in traditional media, but <a href=\"https://www.axios.com/americans-cared-less-about-comey-than-other-trump-scandals-2403228957.html\" target=\"_blank\">cold on Facebook</a>: Seven other events of the Trump presidency trended harder.</li></ul> <p><strong>Be smart: </strong>Don't underestimate how much wiggle room Trump bought himself with his voters and conservatives by putting Gorsuch on the Supreme Court, enforcing the red line in Syria, and muscling a partial repeal of Obamacare through the House. He has a long leash with Trump Country.</p> <p><em><strong>See Axios'</strong> \"<a href=\"https://www.axios.com/americans-cared-less-about-comey-than-other-trump-scandals-2403228957.html\" target=\"_blank\">The not-so-viral Comey firing</a>,\" by Stef Kight.</em></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Don't underestimate how much wiggle room Trump bought himself with his voters and conservatives by putting Gorsuch on the Supreme Court, enforcing the red line in Syria, and muscling a partial repeal of Obamacare through the House. He has a long leash with Trump Country."},{"slug":"punches-not-policy-2452522661","author":"Mike Allen","date":"1499083062","body":"\n                <div><strong>In case you were distracted</strong> by something like the Senate health-care fight, the White House just finished a run of four policy-themed weeks (infrastructure, workforce development, tech and energy). This was designed to be the month the White House methodically forced the media and the public to reckon with its policy ideas, all focused on shaping the domestic policy of the future.</div> <div><a data-linked-post=\"2450429988\" href=\"https://www.axios.com/why-does-trump-tweet-about--2450429988.html\"><strong>Axios' Shane Savitsky counted every tweet</strong></a> on @realDonaldTrump during that month and found that of 121 tweets by Trump himself, three related to these policy topics. If you include tweets on his feed that are clearly by aides (include video, pics, hashtags, etc.), it's 14 for 195.</div>\n                \n                <div><strong>A graphic </strong>on the <a href=\"https://www.usatoday.com/story/news/politics/2017/07/02/trump-tweets-fake-news-far-more-often-than-build-wall/446746001/?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosam&amp;stream=top-stories\" target=\"_blank\">front page of USA Today boils</a> it down to \"punches, not policy\": \"fake news\" 63 times since his election, \"#fakenews\" 10 times,\" \"Obamacare\" 46 times, \"healthcare 41 times.\"</div> <div><strong>And that's the smarter way</strong> to look at the Trump tweet benders: the opportunity cost. What could he be thinking, obsessing, communicating about? The Trump Twitter Archive (which goes back to the beginning of the account, not just the presidency) shows he has used \"opioid\" or \"opioids\" once — and \"loser\" 234 times, \"dumb\" or \"dummy\" 222 times, and \"terrible\" 204 times.</div> <div><strong>How they see us</strong> ... The wrestling tweet was at the top of the front pages of the Financial Times and The Times of London (which said that in the video, Trump \"attacked a person with a superimposed CNN logo on their head\"). The BBC's Katty Kay said on \"Morning Joe' that it '\"looks like America has gone off the reservation.\"</div> <div><strong>Be smart 1:</strong> Look at the tweets as the symptom, not the diagnosis. They matter because they reflect what's consuming the President's time and mind. He does care more about media than about health policy. If you're a Republican, that means frittering away a potentially narrow window when you control the whole federal apparatus. If you're a Democrat, be relieved: His bully pulpit could be bolstering game-changing legislation.</div> <div><strong>Be smart 2:</strong> For the President to tweet about ephemeral nonsense, and for the media to wallow in it, is a luxury of the times. For all the intensity of these 164 days of President Trump, we haven't had a mass-casualty terrorist attack, a transcendent national-security convulsion abroad, or a harrowing disruption for the economy. Odds are, one of those is coming. And Wrestlemania will suddenly seem very small.</div>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"\n                <div><strong>In case you were distracted</strong> by something like the Senate health-care fight, the White House just finished a run of four policy-themed weeks (infrastructure, workforce development, tech and energy). This was designed to be the month the White House methodically forced the media and the public to reckon with its policy ideas, all focused on shaping the domestic policy of the future.</div> <div><a data-linked-post=\"2450429988\" href=\"https://www.axios.com/why-does-trump-tweet-about--2450429988.html\"><strong>Axios' Shane Savitsky counted every tweet</strong></a> on @realDonaldTrump during that month and found that of 121 tweets by Trump himself, three related to these policy topics. If you include tweets on his feed that are clearly by aides (include video, pics, hashtags, etc.), it's 14 for 195.</div>\n                \n                <div><strong>A graphic </strong>on the <a href=\"https://www.usatoday.com/story/news/politics/2017/07/02/trump-tweets-fake-news-far-more-often-than-build-wall/446746001/?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosam&amp;stream=top-stories\" target=\"_blank\">front page of USA Today boils</a> it down to \"punches, not policy\": \"fake news\" 63 times since his election, \"#fakenews\" 10 times,\" \"Obamacare\" 46 times, \"healthcare 41 times.\"</div> <div><strong>And that's the smarter way</strong> to look at the Trump tweet benders: the opportunity cost. What could he be thinking, obsessing, communicating about? The Trump Twitter Archive (which goes back to the beginning of the account, not just the presidency) shows he has used \"opioid\" or \"opioids\" once — and \"loser\" 234 times, \"dumb\" or \"dummy\" 222 times, and \"terrible\" 204 times.</div> <div><strong>How they see us</strong> ... The wrestling tweet was at the top of the front pages of the Financial Times and The Times of London (which said that in the video, Trump \"attacked a person with a superimposed CNN logo on their head\"). The BBC's Katty Kay said on \"Morning Joe' that it '\"looks like America has gone off the reservation.\"</div> <div><strong>Be smart 1:</strong> Look at the tweets as the symptom, not the diagnosis. They matter because they reflect what's consuming the President's time and mind. He does care more about media than about health policy. If you're a Republican, that means frittering away a potentially narrow window when you control the whole federal apparatus. If you're a Democrat, be relieved: His bully pulpit could be bolstering game-changing legislation.</div> <div><strong>Be smart 2:</strong> For the President to tweet about ephemeral nonsense, and for the media to wallow in it, is a luxury of the times. For all the intensity of these 164 days of President Trump, we haven't had a mass-casualty terrorist attack, a transcendent national-security convulsion abroad, or a harrowing disruption for the economy. Odds are, one of those is coming. And Wrestlemania will suddenly seem very small.</div>\n                "},{"slug":"ransomware-attack-is-an-escalation-of-cyber-hacks-2449233920","author":"Kim Hart","date":"1498637350","body":"\n                <p>\n\tGet used to the kind of <a data-linked-post=\"2449130933\" href=\"https://www.axios.com/massive-cyberattack-cripples-europe-2449130933.html\">ransomware attack that crippled critical infrastructure</a> and shut down major corporations yesterday. It was an escalation of the kind of cyber attack that's becoming a regular occurrence worldwide with a reach that's threatening key elements of national security.\n</p> <p>\n<strong>Why it matters: </strong>These kinds of attacks are affecting more people as they spill out of the cyber realm and impact hospitals, power grids, and multi-national corporations. At the same time, consumer anxiety about security is at an all-time high, according to the recent <a data-linked-post=\"2444647585\" href=\"https://www.axios.com/unisys-security-index-2444647585.html\">Unisys Security Index</a>, and EY's Global Capital Confidence Barometer, which shows cybersecurity concerns are delaying business deals. The physical and digital worlds are converging, and consumers are more vulnerable to threats as our lives become more connected than ever.\n</p>\n                \n                <p>\n<span></span>Ukraine's prime minister, Volodymyr Groysman, called yesterday's cyberattack — which targeted government workstations, power companies, banks, state-run TV stations, airports and ATMs — \"unprecedented\" in scope. <span></span>The so-called Petya attack reboots victims' computers, encrypts their hard drive's master file (instead of individual files) and renders their entire hard drive inoperable. The ransom requested for access to an infected computer is $300 in bitcoin, and \"doesn't seem consistent with state-sponsored attackers,\" Bret Padres, a former intel official and CEO of The Crypsis Group, tells Axios, although he would not rule out a state-sponsored attack.\n</p> <p>\n<strong>An escalation: </strong>Monzy Merza, Director of Cyber research for Splunk, told us the attack is \"a change in behavior\" by hackers. It comes just over a month after the massive WannaCry ransomware attack, conducted by a North Korean hacking group, spread to 300,000 breaches across 150 countries. \"As far as we can tell this is an escalation or at least a similar attack as the WannaCry ransomware,\" Padres said. Plus, if Ukraine is really a \"testing ground\" as Merza suggests, this ransomware attack shows the perpetrators are trying to perfect their techniques before carrying out another, potentially larger one.</p> <p>\n<strong>Implications for the U.S. </strong>Padres says that \"Eastern European systems are more likely to be running unpatched and could be more vulnerable to this type of attack,\" but the \"bulk of the U.S. capability in cyber security is in it's offensive operations. We are in a very vulnerable place when it comes to defenses.\" A State Department official said, \"We are actively monitoring the situation.\"<span></span></p> <p>\n<strong>The attacks and its results are becoming more targeted. </strong>While it may seem that attacks are happening more frequently, what's actually happening is that hackers are choosing to publicly showcase the ramifications of the attack:</p> <ul><li>During WannaCry, consequences, such as preventing hospital systems from working, showed how a virus can bring vital technology systems to a screeching halt.</li>\n<li>During Petya, attackers aimed to show their ability to destroy the systems that just about everyone relies on, from power grids to banks to a country's oil supply. </li>\n</ul> <div><strong>Need for proactive policy</strong><strong>: </strong>Carl Herberger, Vice President of security at Radware, said the attack has highlighted the need for an international organization to better police and protect against the rise in global cyber-threats. \"The FBI was created as a result of the pandemic of interstate bank recoveries and the need to hold criminals across borders accountable for their unjust actions. In a way, that is what we need right now,\" said Herberger. </div> <div><span class=\"redactor-invisible-space\"></span><strong>The real payday:</strong> Only a few dozen people appear to have paid the ransom, according to Raj Samani, head of strategic intelligence at McAfee. But the real cost comes to governments and companies — like major advertising agency WPP that had to shut down some offices for the day — reeling from the impact.</div> <ul>\n<li>\"There's something to be said that if you target critical infrastructure and the like, putting safety at risk, you are a little closer to the 'payday' you are after – especially if the time to recover through in-house processes is longer than is acceptable,\" said David Kennerley, director of threat research at Webroot.</li>\n<li>For example, the attack had direct ramifications for Ukraine's nuclear power management:</li></ul> <p class=\"shortcode-media shortcode-media-twitter_embed\"></p> <p><strong>Be smart: </strong><strong></strong>Herberger says that no matter the size of your business, you can become a victim in today's cyber-landscape. So \"patch your systems, properly back up your network, educate your employees on potential threats, and should you fall victim to an attack, don't pay the ransom.\"<br/></p>\n                ","trump":false,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong><strong></strong>Herberger says that no matter the size of your business, you can become a victim in today's cyber-landscape. So \"patch your systems, properly back up your network, educate your employees on potential threats, and should you fall victim to an attack, don't pay the ransom.\"<br/>"},{"slug":"russian-roulette-what-the-leak-revealed-about-trump-2409655579","author":"Mike Allen","date":"1494929634","body":"\n                <p>After the Washington Post <a href=\"https://www.washingtonpost.com/world/national-security/trump-revealed-highly-classified-information-to-russian-foreign-minister-and-ambassador/2017/05/15/530c172a-3960-11e7-9e48-c4f199710b69_story.html\" target=\"_blank\">posted its bombshell</a> that President Trump \"revealed highly classified ['code-word'] information to the Russian foreign minister and ambassador in a White House meeting last week,\" the White House issued a series of carefully worded denials — \"<a href=\"http://www.cnn.com/2017/05/15/politics/washington-post-white-house-response-cnntv/\" target=\"_blank\">playing word games</a>,\" according to Greg Miller, one of the Post authors, along with Greg Jaffe.</p> <p><strong>Why it matters:</strong> Several national-security experts told me that lives could well be lost as a result of an ISIS mole hunt that's sure to follow. And a key ally (the name of the country was withheld by the Post at the White House's request, but it's apparently in the Middle East) may deny future intelligence as a result of the episode.</p>\n                \n                <p>All this as Trump is about to head out on his first international trip, including stops in Israel and Saudi Arabia.</p> <p>I talked to several White House officials last night, and their denials hinge on the argument that the president has broad authority to declassify, so whatever he says is by definition unclassified.</p> <p>National Security Adviser H.R. McMaster, who was in the meeting with the Russians, said in the White House driveway: \"At no time ... were intelligence sources or methods discussed. And the president did not disclose any military operations that were not already publicly known.\"</p> <p>But the report didn't say they were. The Post's Aaron Blake <a href=\"https://www.washingtonpost.com/news/the-fix/wp/2017/05/15/the-white-house-isnt-denying-that-trump-gave-russia-classified-information-not-really\" target=\"_blank\">reads between the lines</a>: \"[T]he report states clearly only that Trump discussed an Islamic State plot and the city where the plot was detected by an intelligence-gathering partner. Officials worried that this information could <em>lead to the discovery of</em> the methods and sources involved, but it didn't say Trump discussed them.\"</p> <p><strong>Be smart: </strong>what the disclosure tells us about President Trump:</p> <ul> <li><strong>This is the price of inexperience</strong>. A top Obama national-security official told me: \"He just didn't know any better. It's not his background. I don't think there was any malicious intent — it's not the world he comes from.\"</li><li><strong>He isn't learning fast enough on the job.</strong> A Republican very close to the West Wing said: \"The president has no context for operating in the environment he's currently in — as head of state and head of government of the most powerful enterprise in all of history. And because he has no context, he's not good at compartmentalizing information.\"</li><li><strong>It's illuminating about</strong> how he thinks of Russia: He wasn't on his guard, wary that Russia can be an adversary with interests that differ notably from those of the U.S.</li><li><strong>He's super-loose</strong> at high-stakes moments. Allied governments tell us of shocking asides he makes in meetings. One West Wing visitor told me: \"He just rambles. ... He doesn't care.\"</li><li><strong>He has trouble </strong>putting together two good days. Some of his friends tell me they'd now settle for <em>one.</em></li></ul> <p><strong>Read next</strong>: <a data-linked-post=\"2409171874\" href=\"https://www.axios.com/timeline-the-wh-response-to-trump-disclosing-classified-info-to-russia-2409171874.html\">The White House response, a timeline.</a></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>what the disclosure tells us about President Trump:"},{"slug":"russias-influence-on-trumps-administration-is-looming-2414004531","author":"Mike Allen","date":"1495194344","body":"\n                <p>On Day 120 of the Trump presidency, Russia has become the administration's unintended but self-imposed mood music and narrative arc — sucking bandwith, draining esprit, looming as a potential calamity.</p> <p>The price and opportunity cost have already been high — in time, in credibility, in possibility.</p> <p>And it may just be starting. </p>\n                \n                <p>Legal scholar Jonathan Turley pointed out on Fox News that the Mueller miniseries may run for<em> years.</em></p> <p><strong>The mood</strong> among some top Republicans is turning to anger: So much has been squandered. \"The damage to the agenda is permanent,\" said a Republican working to pass Trump's plans.</p> <p><strong>Et tu, Putin?</strong> In an article headlined, \"<a href=\"http://link.axios.com/click/9651658.88611/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9wb2xpdGljcy9hcnRpY2xlcy8yMDE3LTA1LTE4L3J1c3NpYS1ncm93cy1hbnhpb3VzLW92ZXItdS1zLXBvbGl0aWNhbC1jaGFvcy1lbmd1bGZpbmctdHJ1bXA_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbQ/58e3c99b566a9405178b4f48Bfd1a7d6b\" target=\"_blank\">Russia Grows Anxious</a> Over U.S. Political Chaos Engulfing Trump,\" Bloomberg reports: \"Trump's presidency appears hijacked by the U.S. obsession with Russia, one senior Kremlin official said. ... [H]is fate looks increasingly uncertain to Kremlin policy makers.\"</p> <p>The Mueller appointment could have been used as a temporary lifeline — an excuse to fence The Swamp, and try to get lawmakers and journalists to focus on Trump's plans, at least until findings emerged.</p> <p><strong>Several top operatives</strong> <strong>gave me a similar plan of attack.</strong> You'd say: \"I'm happy Robert Mueller is going to get to the bottom of this. He's perfect for the job, and I'm eager to cooperate.\" Then say no more. When you're asked about Russia, point the questioner to your previous statement, then talk about tax reform.</p> <p>Instead, after a<a href=\"http://link.axios.com/click/9651658.88611/aHR0cHM6Ly93d3cud2hpdGVob3VzZS5nb3YvdGhlLXByZXNzLW9mZmljZS8yMDE3LzA1LzE3L3N0YXRlbWVudC1wcmVzaWRlbnQtZG9uYWxkLWotdHJ1bXA_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbQ/58e3c99b566a9405178b4f48B95e5d35b\" target=\"_blank\"> restrained statement</a> when Mueller was named Wednesday evening, the president <a href=\"http://link.axios.com/click/9651658.88611/aHR0cHM6Ly90d2l0dGVyLmNvbS9yZWFsRG9uYWxkVHJ1bXAvc3RhdHVzLzg2NTE3MzE3Njg1NDIwNDQxNj91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2Ft/58e3c99b566a9405178b4f48B3315a897\" target=\"_blank\">tweeted</a> the next morning: \"This is the single greatest witch hunt of a politician in American history!\"</p> <p>Asked about the special counsel at an<a href=\"http://link.axios.com/click/9651658.88611/aHR0cHM6Ly93d3cud2hpdGVob3VzZS5nb3YvdGhlLXByZXNzLW9mZmljZS8yMDE3LzA1LzE4L3JlbWFya3MtcHJlc2lkZW50LXRydW1wLWFuZC1wcmVzaWRlbnQtc2FudG9zLWNvbG9tYmlhLWpvaW50LXByZXNzP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0/58e3c99b566a9405178b4f48B951bc342\" target=\"_blank\"> East Room presse</a>r yesterday, Trump said: \"I respect the move, but the entire thing has been a witch hunt. ... I think it divides the country.\"</p> <p>At 2:10 p.m. today, Air Force One takes off from Joint Base Andrews to Riyadh, Saudi Arabia, for a nine-day trip that will also take the President to Israel, Italy and Belgium.</p> <p><strong>Be smart: </strong>Absent a gaffe, American presidents always look bigger on the world stage. Trump aides hope this will be the beginning of a reset. One big problem: The Swamp awaits.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Absent a gaffe, American presidents always look bigger on the world stage. Trump aides hope this will be the beginning of a reset. One big problem: The Swamp awaits."},{"slug":"self-debunking-keystone-cops-scenario-2459726525","author":"Mike Allen","date":"1500126034","body":"\n                <p>A seasoned Republican operative told me that when you're working on a campaign and you get an email that says something like \"part of Russia and its government's support for Mr. Trump,\" the response is obvious<br/></p> <ul><li><strong>\"I'd stop reading right there,\"</strong> the operative said. \"I'd print it out and walk it over to the counsel's office.\"</li><li><strong>That's why so many Republicans downtown and on Capitol Hill have tried to avert their gaze from \"the Russia stuff\"</strong> by relying on the Keystone Cops Scenario — that this was all incompetence and inexperience: These guys just didn't know what they were doing, and were acting the way they do in business.</li><li><strong>But the Keystone Cops Scenario fell apart yesterday.</strong> Don Jr. had told Fox's Sean Hannity on Tuesday, regarding the Russia meeting at Trump Tower: \"This is everything. This is everything.\"</li></ul>\n                \n                <p>But it wasn't. As <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly9hcG5ld3MuY29tL2Q5MDFlYzVhNDMxNzQyMWVhYTRkODY5ZDJiODFiMzA2L1J1c3NpYW4tQW1lcmljYW4tbG9iYnlpc3Qtc2F5cy1oZS13YXMtYXQtVHJ1bXAtc29uJ3MtbWVldGluZz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B69015c45\" target=\"_blank\">AP and others reported</a> yesterday: \"A prominent Russian-American lobbyist and former Soviet military officer said he was at [the] meeting between a Russian lawyer and ... Trump's son, son-in-law and campaign chairman last year.\"</p> <p>Rinat Akhmetshin, the Russian-American lobbyist, \"said he recognized Kushner and Trump Jr. He also said he recognized Manafort ... He said there were others in the room but he didn't know them.\"</p> <p>Asked about the meeting on Air Force One on Wednesday night, Trump <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMTctMDctMTMvaGVyZS1zLXRoZS13LWgtdHJhbnNjcmlwdC1vZi10cnVtcC1zLW9mZi10aGUtcmVjb3JkLXByZXNzLWNoYXQ_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbSZzdHJlYW09dG9wLXN0b3JpZXM/58e3c99b566a9405178b4f48B55e6b168\" target=\"_blank\">told reporters</a> he \"only heard about it two or three days ago.\" The N.Y. Times had <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48B6c4a4ef5\" target=\"_blank\">broken the story</a> the previous Saturday. That's four days.</p> <p>Remember what may turn out to the be most important two paragraphs of the week, on the front page of <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8xMS91cy9wb2xpdGljcy9ydXNzaWEtdHJ1bXAuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B95bb2005\" target=\"_blank\">Wednesday's Times</a>: </p> <h5>\"As Air Force One jetted back from Europe on Saturday, a small cadre of Mr. Trump's advisers huddled in a cabin helping to craft a statement for the president's eldest son, Donald Trump Jr., to give to The New York Times explaining why he met last summer with a lawyer connected to the Russian government. Participants on the plane and back in the United States debated how transparent to be in the statement ... </h5> <h5>\"Ultimately, the people said, the president signed off on a statement from Donald Trump Jr. <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48C6c4a4ef5\" target=\"_blank\">for </a><a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48D6c4a4ef5\" target=\"_blank\">The Times</a> that was so incomplete that it required day after day of follow-up statements, each more revealing than the last.\"</h5> <p><a href=\"http://link.axios.com/click/10087929.93384/aHR0cDovL3d3dy5jbm4uY29tL3ZpZGVvcy9wb2xpdGljcy8yMDE3LzA3LzE1L2RvbmFsZC10cnVtcC1qci1ydXNzaWEtbWVldGluZy1jYW1wYWlnbi1zZWt1bG93LWludHYtYWMuY25uP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48B9a290403\" target=\"_blank\">Last night on CNN</a>, Anderson Cooper asked one of President Trump's lawyers, Jay Sekulow, about \"the ethical kind of moral argument, is it right to have had this meeting.\" Sekulow replied: \"I think we're making a lot about something that generally is not very significant. Whether there was eight people there or nobody.\"</p> <p><strong>Sekulow, who'll be on <a href=\"http://link.axios.com/click/10087929.93384/aHR0cDovL2hvc3RlZC5hcC5vcmcvZHluYW1pYy9zdG9yaWVzL1UvVVNfTkVXU19TSE9XUz9TSVRFPUFQJnV0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48B6ba23868\" target=\"_blank\">all five Sunday shows</a>,</strong> later made a point we'll probably hear a lot of: </p> <h5>\"You know what word I want to go on? Here is what word I want to go on. What statute is being violated here? Because at the end of the day, I keep saying this: This is interesting, and I understand why you're covering it. But the fact is no legal violation for the meeting. The meeting itself is not a violation of the law.\"</h5> <p><strong>Be smart:</strong> The Trumps will try to move the discussion to questions of narrow legality. But when you're running for President or running the country, that's not the only standard.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> The Trumps will try to move the discussion to questions of narrow legality. But when you're running for President or running the country, that's not the only standard."},{"slug":"steve-bannon-is-out-of-trumps-doghouse-2453655521","author":"Mike Allen","date":"1499252716","body":"\n                <p>Not a lot of people in the White House are having fun these days. But one top official is having a blast — inviting friends over for lunch, joking about good times from the campaign, plotting 2018 and even 2020. He was recently spotted in the West Wing carrying the New York Post cover mocking CNN as \"THE MOST BUSTED NAME IN NEWS.\"</p> <p>Steve Bannon<strong>,</strong> the proud culture warrior who was briefly and very publicly in the Trump doghouse, is ascendant after what friends call a period of \"hibernation.\"</p> <p>\"He's not cocky -- he's comfortable,\" said a longtime friend. \"And he understands the game.\"</p>\n                \n                <p><strong>His ideas </strong>are being taken seriously, and his worldview is clearly in Trump's head:</p> <ul><li><strong>Bannon loves,</strong> enables, encourages the smackdowns with the media.</li><li><strong>Bannon loves, </strong>enables, encourages the middle finger to NATO, and Germany in particular.</li><li><strong>Bannon loves, </strong>enables and encourages the instincts that led Trump to withdraw from the Paris climate deal.</li><li><strong>Bannon loves,</strong> enables, encourages tougher tone and trade action against China.</li><li><strong>Bannon loves,</strong> enables encourages a hard line on immigration.</li><li><strong>Bannon loves,</strong> enables, encourages a base-first and often base-only strategy.</li></ul> <p><strong>\"Trump loves the fight, </strong>and Bannon loves the fight,\" another friend said.</p> <p><strong>In many ways, being cornered</strong> and lashing out is Trump's comfort emotion; and his chief strategist is always there to feed it.</p> <p><strong>Events in this madcap</strong> West Wing have conspired to give Bannon back much of his mojo: He's clearly going to stay, after being long rumored to be on the outs. He's no longer in a hot war with Jared Kushner. He played a key role in developing the Russia response. And he's back to pushing ideas the GOP establishment hates, including a tax hike on the rich and trade wars.</p> <p><strong>Bannon's insurance policy </strong>is that he's the keeper of the base. Trump understands he's never going to be broadly popular, so he absolutely has to preserve his 46%.</p> <p><strong>Axios' Jonathan Swan</strong> says that behind closed doors, Trump talks constantly about the base as \"my people\" and \"our people\": \"What does this mean for my people?\"</p> <p><strong>Be smart:</strong> The biggest reason that Bannon is back is that his worldview is Trump's worldview. For the all the ups and downs, in-and-out-of-favor drama, Trump is more Bannon than he is Jared or Ivanka.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> The biggest reason that Bannon is back is that his worldview is Trump's worldview. For the all the ups and downs, in-and-out-of-favor drama, Trump is more Bannon than he is Jared or Ivanka."},{"slug":"tax-reform-shocker-the-white-house-actually-has-a-plan-2460447660","author":"Jonathan Swan","date":"1500241963","body":"\n                <p>Here's a shocker that shouldn't be a shocker: The White House actually seems to have its act together on tax reform. Activists and business leaders who've been meeting with Gary Cohn, Steven Mnuchin, Marc Short &amp; Paul Teller from legislative affairs, and Sean Spicer (who's leading the comms strategy), all tell us the same thing: They're surprised about how much planning and organizing the White House has already done, given its ham-handed approach to the health care rollout.</p>\n                \n                <p>The administration will start pitching the tax reform effort in mid-August, according to sources involved. They're hoping to get the bill itself finalized for mark-ups after Labor Day (count us as skeptical on that.) But while that happens, expect to see CEOs, White House surrogates, and high-profile conservative activists start talking up the plan.</p> <p>Sources close to the effort say the White House is looking to avoid the mistakes of the health care debacle, when they failed miserably to build nationwide support.</p> <p><strong>Here's what to expect:</strong></p> <ul><li>President Trump wants to pitch tax reform aggressively. Our sources expect him to make the case for the plan by barnstorming the Midwest states he won in November. Reince Priebus is in charge of his schedule, so this will be a major test of his organizational skills.</li><li>The White House is engaging CEOs across the country, looking for them to hold town halls, do media appearances, and write letters to their employees explaining the benefits of tax reform. They want members to return to their districts in August and hear from business leaders and other influential constituents about why tax reform needs to get done.</li><li>They're talking to local mayors and county commissioners, too. And they're pressing outside groups to spend big on advertising support.</li><li>A wide range of groups — from movement conservatives to downtown lobbying shops — are fired up. This includes Heritage Action, Americans for Tax Reform, the Business Roundtable, and the Koch brothers' network, which is already rolling out a multi-million dollar ad and grassroots organizing campaign to support comprehensive tax reform.</li><li>We expect the White House to float a few tax policy trial balloons in August.</li><li>The aim is to get as many administration officials involved as possible, regardless of their day jobs. UN Ambassador Nikki Haley, for example, has nothing to do with tax reform. But White House officials think she could be an asset because she's a great communicator and a former small business leader.</li></ul> <p><strong>On the substance:</strong></p> <ul><li>The \"<a href=\"http://link.axios.com/click/10093243.13810/aHR0cHM6Ly93d3cud3NqLmNvbS9hcnRpY2xlcy9nb3AtdGF4LW92ZXJoYXVscy1mYXRlLXJlc3RzLW9uLWJpZy1zaXgtdGFsa3MtMTQ5OTQzNzM2OD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc3NuZWFrcGVlayZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9Bed4e7105\" target=\"_blank\">Big Six</a>\" leading the tax code rewrite — Speaker Paul Ryan and Rep. Kevin Brady, Sens. Mitch McConnell and Orrin Hatch, Treasury Secretary Steven Mnuchin, and National Economic Council Director Gary Cohn — are currently working through their disagreements.</li><li>One of the toughest remaining disputes is whether to start letting businesses immediately write off the cost of equipment (known as \"full expensing\"). This would be hugely expensive, so some conservatives oppose it. But House Leadership argues it would juice short-term economic growth.</li><li>Another major unsolved problem is how (or if) to pay for all these tax cuts. Some in the White House would happily just blow out the deficit, but Leadership suspects most Republicans wouldn't be on board with that.</li></ul> <p><strong>Be smart:</strong> There's a reason it's been more than 30 years since Congress passed real tax reform: It's damn hard.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> There's a reason it's been more than 30 years since Congress passed real tax reform: It's damn hard."},{"slug":"techs-biggest-companies-shy-away-from-going-public-2398043296","author":"Axios","date":"1494242542","body":"\n            <p>Though more companies are choosing to IPO, tech's biggest startups are holding off on going public as they fear that their sky-high valuations from private funding rounds might dip on the open market, <a href=\"https://www.wsj.com/articles/as-ipos-pick-up-big-startups-hold-out-1494154807\" target=\"_blank\">per the</a> Wall Street Journal.</p><ul class=\"ee-ul\"><li><strong>\"A slew of companies</strong> are preparing to go public later this year.\"</li><li><strong>\"Conspicuously missing</strong> ... are some of the highest-profile private companies, such as Uber Technologies Inc. and Airbnb Inc., which aren't expected to come to market before 2018.\"</li><li><strong>Be smart:</strong> \"[S]ome investors and underwriters say there's concern that the public markets are being used as a last resort...\"</li><li><strong>Why it matters: </strong>\"It's symptomatic of a decades-long trend that's seen the total number of public companies in the U.S. decline sharply as more entrepreneurs and others choose to avoid the increased disclosure and other perceived drawbacks of broad ownership.\"</li></ul>\n\n    ","trump":false,"beSmart":true,"beSmarC":true,"smarts":"><ul class=\"ee-ul\"><li><strong>\"A slew of companies</strong> are preparing to go public later this year.\"</li><li><strong>\"Conspicuously missing</strong> ... are some of the highest-profile private companies, such as Uber Technologies Inc. and Airbnb Inc., which aren't expected to come to market before 2018.\"</li><li><strong>Be smart:</strong> \"[S]ome investors and underwriters say there's concern that the public markets are being used as a last resort...\"</li><li><strong>Why it matters: </strong>\"It's symptomatic of a decades-long trend that's seen the total number of public companies in the U.S. decline sharply as more entrepreneurs and others choose to avoid the increased disclosure and other perceived drawbacks of broad ownership.\"</li></ul>\n\n    "},{"slug":"the-pelosi-problem-2446125466","author":"Axios","date":"1498128431","body":"\n                <p>Democrats' embarrassing special-election loss in Georgia, after the vocal left fanned unrealistic expectations, provokes a wave of bitter post-gaming that targets House Democratic Leader Nancy Pelosi. It's part of a generational argument that's also driving the party's 2020 conversation.</p> <p><strong>Be smart: </strong>With a wobbly start for Trump and his agenda, Dems we talk to as we travel the country have gotten the idea that<em> of course </em>the House will flip in midterms next year. In fact, this year's special elections showed that vulnerability by the other side doesn't necessarily translate into raw votes for you. Republicans are more reliable voters in midterms<strong>, </strong>and reversing that will be a massive task for Dems.</p>\n                \n                <ul><li><strong>Front page of Silicon Valley's paper,</strong> The Mercury News of San Jose, \"<a href=\"http://www.mercurynews.com/2017/06/21/jon-ossoff-loss-california-karen-handel/\" target=\"_blank\">THE PELOSI PROBLEM</a>: Some fault minority leader for losses,\" by Casey Tolan: \"Some of the toughest ads against the 30-year-old [Georgia Dem candidate Jon] Ossoff were those tying him to Pelosi, whose approval ratings are underwater outside California.\"</li><li><strong>The N.Y. Times' lead print story,</strong> \"<a href=\"https://www.nytimes.com/2017/06/21/us/pelosi-georgia-ossoff-democrats.html\" target=\"_blank\">Democrats Fume As Georgia Loss Deepens Discord,</a>\" by Alex Burns and Jonathan Martin, carries this memorable online headline: \"Democrats Seethe After Georgia Loss: 'Our Brand Is Worse Than Trump.'\"</li><li><strong>The money quote:</strong> \"Representative Tim Ryan of Ohio, who tried to unseat Ms. Pelosi as House minority leader late last fall, said she remained a political millstone for Democrats. But Mr. Ryan said the Democratic brand had also become 'toxic' in much of the country because voters saw Democrats as 'not being able to connect with the issues they care about.' 'Our brand is worse than Trump.'\"</li><li><strong><a href=\"http://www.nbcnews.com/politics/congress/nancy-pelosi-faces-heat-democrats-after-georgia-loss-n775301\" target=\"_blank\">NBC's Alex Seitz-Wald</a>: </strong>\"At a closed-door meeting with colleagues, there were no challenges to the Democratic leadership or any obvious signs of dissent ... But for every Democratic official or operative publicly calling for new leadership, there are others who privately express the same sentiment.\"</li><li><strong><a href=\"https://assets.documentcloud.org/documents/3870915/dccc-Memo.pdf\" target=\"_blank\">A morning-after memo</a> </strong>from the head of the House Democrats' campaign arm, DCCC Chair Ben Ray Luján of New Mexico, tries to buck up the troops by declaring: \"THE HOUSE IS IN PLAY,\" partly because of \"the nationwide collapse of support for President Trump.\"</li></ul>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>With a wobbly start for Trump and his agenda, Dems we talk to as we travel the country have gotten the idea that<em> of course </em>the House will flip in midterms next year. In fact, this year's special elections showed that vulnerability by the other side doesn't necessarily translate into raw votes for you. Republicans are more reliable voters in midterms<strong>, </strong>and reversing that will be a massive task for Dems."},{"slug":"the-senates-health-care-time-bomb-2449610770","author":"Mike Allen","date":"1498647884","body":"\n                <p>NPR and PBS NewsHour <a href=\"http://link.axios.com/click/9951284.85593/aHR0cDovL3d3dy5ucHIub3JnLzIwMTcvMDYvMjgvNTM0NjEyOTU0L2p1c3QtMTctcGVyY2VudC1vZi1hbWVyaWNhbnMtYXBwcm92ZS1vZi1yZXB1YmxpY2FuLXNlbmF0ZS1oZWFsdGgtY2FyZS1iaWxsP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58bd655299964a886b8b4b2cB52b281eb\" target=\"_blank\">are out this morning</a> with a Marist poll showing 17% approval of the Senate's healthcare plan, and 21% approval of the GOP's handling of health care. That may partly reflect how the question was asked. </p> <ul><li><strong>But it's a disgrace when your party controls the whole federal apparatus.</strong> And it shows the foreboding feat Senate Majority Leader Mitch McConnell faces in trying to revive repeal-and-replace after his stunning gamble to punt the vote until after the July 4 break.</li><li><strong>The announcement was followed by a swarm of defections</strong> — opposition was suddenly cost-free.</li><li><strong>The lull gives more time for negotiation </strong>but<strong>,</strong> more likely, more time for opposition to metastasize and spook senators when they're home for the holiday.</li></ul>\n                \n                <p><strong>Yes, as Republicans argue</strong>, senators will be spending time with conservative backers who'll remind them of their pledge. But it's also more time for the real-world effects to sink in, and for opposition to snowball as senators decide they can't stomach a career-defining vote that's freighted with so many unknowns.</p> <p><strong>As one person closely tracking the debate emailed:</strong> \"It feels like McConnell is moving inevitably toward his own 'Obamacare is the law of the land' moment.\"</p> <p><strong>The state of play:</strong></p> <ul><li><strong>McConnell's reputation</strong> for the inside game is such that Republicans assume he must have something up his sleeve. One top Republican alumnus put the bill's chances of coming back at 15%. But then as he continued to muse, he doubled it to 30% just because of the McConnell factor.</li><li><strong>What Senate Republicans are thinking, </strong>via Jonathan Swan: \"Rough day, but far too soon to call it a lost cause. .. [F]or all of Mitch McConnell's widely-acknowledged legislative wizardry, he's never had to pass healthcare before. ... [I]t's the hardest vote some of these senators will ever have to take. It's also something that Republicans have disagreed over for 30 years, so why would they start agreeing now?\"</li><li><strong>An administration source</strong> insists there's a path to passage in the Senate, just as there was in the House despite the naysayers. The path as this source sees it: \"some sort of deal that gives money in the short-term to the moderates in exchange for long-term reforms for the conservatives.\"</li><li><strong>The source said the short-term money</strong> would bolster Medicaid and the response to the opioid crisis. The conservative sweeteners would include spending growth rate assurances and regulation changes.</li></ul> <div><div><strong>McConnell has a slush fund of \"room\"</strong> in the deal to make individual deals with senators. But it would take a tectonic disruption to shake up this losing calculus.</div></div> <p><strong>Be smart:</strong> President Trump has very limited leverage over Republican Senators, especially moderates. There's no threat he could make that would make some of them change their minds.</p> <div><div></div></div>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> President Trump has very limited leverage over Republican Senators, especially moderates. There's no threat he could make that would make some of them change their minds."},{"slug":"trump-comes-home-to-trouble-2456597025","author":"Mike Allen","date":"1499683306","body":"\n                <p>The new story about Trump's inner circle meeting a Russian is damaging because of who was there, when it happened, what they were up to, and the fact that the explanation changed radically over the weekend.</p> <p><strong>Be smart:</strong> Intent will be a crucial consideration in whatever special counsel Bob Mueller comes up with. So the reason for this meeting, the changing story, and the foot-dragging on disclosure are all going to matter. It's why veteran Republicans operatives remain mystified that Trump's orbit is going the drip-drip route rather than disclosing all at once what's known about meetings with Russians.</p>\n                \n                <p><strong><span style=\"background-color: initial;\">On Saturday</span>, N.Y. Times had <a href=\"http://link.axios.com/click/10038489.22/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOC91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/587e487172fbf2056f8b4e5eBec2dcd3a\" target=\"_blank\">disclosed</a></strong><strong> that the Trump Tower meeting last June</strong> with \"a Russian lawyer with ties to the Kremlin\" had been convened by Don Trump Jr., the president's eldest son, and included son-in-law Jared Kushner and campaign chairman Paul Manafort.<br/></p> <p><strong><a href=\"http://link.axios.com/click/10038489.22/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNy8wOS91cy9wb2xpdGljcy90cnVtcC1ydXNzaWEta3VzaG5lci1tYW5hZm9ydC5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/587e487172fbf2056f8b4e5eBf8751a27\" target=\"_blank\">A day later</a>, the bombshell:</strong> The meeting was not primarily about adoption policy, as Trump Jr. had suggested in a statement. Don Jr. had been \"promised damaging information about Hillary Clinton.\"</p> <p><strong>The NYT's Maggie Haberman pointed out on </strong><a href=\"http://link.axios.com/click/10038489.22/aHR0cHM6Ly90d2l0dGVyLmNvbS9tYWdnaWVOWVQvc3RhdHVzLzg4NDE1NDAzMjc0NjUyODc3MD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/587e487172fbf2056f8b4e5eBdec532ae\" target=\"_blank\"><strong>Twitter</strong></a>: \"This meeting took place at a pivotal moment for Trump, winning Indiana but facing delegate slog prospect.\"</p> <p><strong>Under the for-history headline </strong>of \"TRUMP TEAM MET RUSSIAN OFFERING DIRT ON CLINTON,\" The Times says: \"The accounts of the meeting represent the first public indication that at least some in the campaign were willing to accept Russian help.\"</p> <ul> <li><strong>From Don Jr.'s statement:</strong> \"[T]he woman stated that she had information that individuals connected to Russia were funding the Democratic National Committee and supporting Mrs. Clinton. Her statements were vague, ambiguous and made no sense. No details or supporting information was provided or even offered. It quickly became clear that she had no meaningful information.\"</li><li><strong>Just hours before</strong> the new story, White House Chief of Staff Reince Priebus said on \"Fox News Sunday\" that it was \"a nothing meeting\": \"[I]t was a meeting apparently about Russian adoption.\"</li><li><span></span><strong>Intrigue, tweeted by Axios' Jonathan Swan:</strong> \"Sources close to Trump are discussing which 'advisers to the White House' [how The Times described sources] might want revenge against Don Jr.\"</li></ul> <p><strong>Email du jour, from a top Republican:</strong> \"[T]ranquilize the president so he does not tweet about it.\"</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Intent will be a crucial consideration in whatever special counsel Bob Mueller comes up with. So the reason for this meeting, the changing story, and the foot-dragging on disclosure are all going to matter. It's why veteran Republicans operatives remain mystified that Trump's orbit is going the drip-drip route rather than disclosing all at once what's known about meetings with Russians."},{"slug":"trump-on-an-island-all-alone-2440220392","author":"Mike Allen","date":"1497263548","body":"\n                <p><strong>The spotlight has been</strong> on President Trump's <em>legal </em>jeopardy. But inside the small circle of top Republicans who advise this White House, there's increasing concern that future <em>political</em> problems are stacking up.<br/></p> <p><strong>One of the oldest (and most trusted)</strong> hands in America told a large group of CEOs in New York City on Friday: <strong>\"Simply put, Trump has lost control of his presidency.</strong> He still has all the power of the office, but for someone who spent a portion of his life in real estate litigation, he shows once again he has not learned the first rule of legal combat: It is often better to say nothing and do nothing.\"</p>\n                \n                <p><strong>That voice isn't a partisan,</strong> but our kitchen cabinet of Republicans is growing notably more bearish, even though slam-dunk evidence of \"high crimes and misdemeanors\" hasn't emerged.</p> <p><strong>\"Another week</strong>, and no progress on the GOP agenda,\" said a GOP sage. \"Infrastructure Week turned into Comey Week. No one really knows Trump and came to D.C. with him. He is a president on an island, all alone. ... [T]he ability to get anything done is in double jeopardy.\"<br/></p> <ul><li><strong>What Republicans fear</strong>: a downward spiral in which the Russia distractions make it harder to pass Trump's agenda, new talent won't come into the West Wing, top-shelf potential challengers are reluctant to run as Republicans in 2018, the House flips, and article of impeachment become a real risk.</li><li><strong>Watch the Georgia special election results</strong> a week from Tuesday. It's officially the most expensive House race in history, and Democrats look like they could pick up a Republican seat.</li><li><strong>Trump knows</strong> that he thrives with an opponent, so he personalized the investigation by making it Trump v. Comey, personally calling out his fired FBI director and offering to take him on under oath. In the short run, that plays well with the base, which wants a fighter. But it makes it harder to wall off the Oval Office by firing or disowning associates.</li></ul> <strong>Be smart:</strong>  Comey's failure to deliver a smoking gun has  <strong>bought Trump some time</strong> . But so far, he's shown no indication that he has a plan — or the will — to use that time to change the course of events.\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"> <ul><li><strong>What Republicans fear</strong>: a downward spiral in which the Russia distractions make it harder to pass Trump's agenda, new talent won't come into the West Wing, top-shelf potential challengers are reluctant to run as Republicans in 2018, the House flips, and article of impeachment become a real risk.</li><li><strong>Watch the Georgia special election results</strong> a week from Tuesday. It's officially the most expensive House race in history, and Democrats look like they could pick up a Republican seat.</li><li><strong>Trump knows</strong> that he thrives with an opponent, so he personalized the investigation by making it Trump v. Comey, personally calling out his fired FBI director and offering to take him on under oath. In the short run, that plays well with the base, which wants a fighter. But it makes it harder to wall off the Oval Office by firing or disowning associates.</li></ul> <strong>Be smart:</strong>  Comey's failure to deliver a smoking gun has  <strong>bought Trump some time</strong> . But so far, he's shown no indication that he has a plan — or the will — to use that time to change the course of events.\n                "},{"slug":"trump-reins-in-tariff-temptation-2453124042","author":"Mike Allen","date":"1499171742","body":"\n                <p>President Trump, who has <a data-linked-post=\"2450764900\" href=\"https://www.axios.com/exclusive-trump-plots-trade-wars-2450764900.html\">expressed enthusiasm behind closed doors</a> for harsh trade tariffs aimed at China, is headed — for now — toward a more moderate course.</p> <ul><li><strong>Trump originally favored a hard line,</strong> but was told in a heated meeting that most of his staff and Cabinet were opposed. Economic adviser Gary Cohn and Treasury Secretary Steve Mnuchin argued privately that tough tariffs were bad economics at a time when the market and job rates are strong.</li><li><strong>Trump left staff with the impression he would proceed with tariffs</strong>, but has tempered his views amid the internal pressure.</li><li><strong>Before heading off to Europe <span style=\"background-color: initial; font-family: Roboto, sans-serif;\">tomorrow</span></strong><strong> on the second international trip of his presidency, Trump tweeted:</strong> \"Really great numbers on jobs &amp; the economy! Things are starting to kick in now, and we have just begun! Don't like steel &amp; aluminum dumping!\"</li></ul>\n                \n                <p><strong>The backstory:</strong> Indeed, steel and aluminum have been on Trump's mind for months. But it turns out that the U.S. imports little steel from China, and most of the steel we import isn't dumped (sold below cost).</p> <p><strong>The players: </strong>The most muscular internal enthusiasm for across-the-board tariffs comes from Steve Bannon and trade-policy director Peter Navarro. Commerce Secretary Wilbur Ross, a longtime friend of the president's, is seen as sharing Bannon's view but is cooler to outright tariffs.</p> <p><strong>The likely solution</strong>: With the caveat that Trump can always make unexpected decisions, the administration is headed toward a more tailored approach that targets China and countries through which it trans-ships steel — Vietnam, for example. That could include possible tariffs, based on unfair trade practices, like dumping.</p> <p><strong>What's next:</strong> The U.S. will need help from other countries to deal with China. A White House readout of a Trump call yesterday with German Chancellor Angela Merkel, ahead of this week's G-20 summit in Hamburg, said they discussed \"global steel overcapacity\" — a.k.a., the problem of Chinese dumping on the worldwide market.</p> <p><strong>Be smart:</strong> Read that as a signal that Trump plans a G-20 discussion of more collective action.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Read that as a signal that Trump plans a G-20 discussion of more collective action."},{"slug":"trump-the-arbitrator-on-ahca-2316557017","author":"Mike Allen","date":"1489662118","body":"\n            <p>White House officials have been telling us that the repair-and-replace bill is more fluid than House leaders are portraying, and now we know what they mean.</p><ul class=\"ee-ul\"><li><strong>Trump, interviewed</strong> by Fox's Tucker Carlson in Detroit yesterday, said: \"It's very preliminary ... A lot of things aren't consistent [with his campaign message of helping struggling workers]. But these are going to be negotiated. We've got to go to the Senate.\"</li><li><strong>Axios' Jonathan Swan</strong> <a href=\"http://link.axios.com/click/9157412.74084/aHR0cHM6Ly93d3cuYXhpb3MuY29tL3RydW1wcy10dWNrZXItaW50ZXJ2aWV3LWhpZ2hsaWdodHMtMjMxNjEyNjQ5MS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0/58bd655299964a886b8b4b2cB3dc6e57b\" target=\"_blank\">pointed out</a> that the remarks are striking because Speaker Ryan regards the package as a nearly finished product, although aides say some tweaks were always planned.</li><li><strong>Asked about a</strong> <a href=\"http://link.axios.com/click/9157412.74084/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9wb2xpdGljcy9hcnRpY2xlcy8yMDE3LTAzLTE0L3RydW1wLXMtY291bnRpZXMtbG9zZS1vdXQtdG8tY2xpbnRvbi1zLWluLWdvcC1oZWFsdGgtdGF4LWN1dHM_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbQ/58bd655299964a886b8b4b2cB6bb1a624\" target=\"_blank\">Bloomberg analysis</a> with the headline, \"Trump's Counties Lose Out to Clinton's in GOP Health Tax Cuts,\" Trump replied: \"We will take care of our people or I'm not signing it, OK? Just so you understand. This is very preliminary.\"</li><li><strong>\"I'm, in a little way, </strong>I'm an arbitrator. ... We got a lot of fighting going on.\"</li></ul><p><strong>Be smart:</strong> Trump sees and fears the rising unpopularity of the Ryan plan and will gladly accept whatever changes needed to get it through Congress — or drop the entire thing if looks like a political loser weeks or months from now.</p>\n\n    ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Trump sees and fears the rising unpopularity of the Ryan plan and will gladly accept whatever changes needed to get it through Congress — or drop the entire thing if looks like a political loser weeks or months from now."},{"slug":"trumps-agenda-will-take-longer-than-planned-2398001213","author":"Mike Allen","date":"1494239955","body":"\n                <p>With Dems fired up by the messy process and result of the House health care fight, everything on President Trump's agenda is likely to take longer than strategists had planned.</p>\n                \n                <p>Here's the latest on how the Hill calendar looks:</p> <ul> <li>If health reform makes it to Trump's desk, it's unlikely to be before fall<em>.</em> It'll take up the Senate calendar through the summer, then the conference committee and another floor fight in the House.</li><li>For the first time<strong>, </strong>some key Republicans are<strong> </strong>pessimistic that tax reform can be finalized this year. It has to come after the 2018 budget (its own sinkhole). So tax reform could get pushed into 2018, and ambitious bills are even harder in an election year since the other side doesn't want to give the White House a win.</li><li>Massive spending for an infrastructure package will be a tough sell with the hardline House Freedom Caucus and some Senate conservatives. So Trump will probably need Ds — tough before midterms.</li></ul> <p><strong>Be smart:</strong> The Rose Garden celebration on the House health bill was a sugar rush for Rs and no indication of momentum. The math on their own side remains intractable. And with the Cook Political Report's Amy Walter now giving Dems a 40-50% chance of taking the House, they're less likely than ever to help Trump.</p> <p><a href=\"http://link.axios.com/click/9562900.75553/aHR0cHM6Ly93d3cuYXhpb3MuY29tL3BhdWwtcnlhbnMtcGl2b3QtdG8tdGF4LXJlZm9ybS0yMzk3MzE4NTA2Lmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbQ/583ee2d50aea11da218b513aB5134f833\" target=\"_blank\">The Speaker</a> pivots to tax reform, traveling to Ohio during this week's congressional recess, per Axios' Jonathan Swan: Paul Ryan will visit manufacturers and hold a roundtable with business leaders \"as the beginning of coordinated efforts between House leadership and the administration to sell tax reform.\"</p> <p>Elsewhere on the Trump agenda ...</p> <ul><li><strong>Radically remake EPA ... </strong>Top of N.Y. Times front page, \"<a href=\"http://link.axios.com/click/9562900.75553/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNS8wNy91cy9wb2xpdGljcy9lcGEtZGlzbWlzc2VzLW1lbWJlcnMtb2YtbWFqb3Itc2NpZW50aWZpYy1yZXZpZXctYm9hcmQuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2Ft/583ee2d50aea11da218b513aB0b82e719\" target=\"_blank\">E.P.A. Dismisses</a> [at least 5] Members of Major Scientific Review Board,\" by Coral Davenport: \"A spokesman for the E.P.A. administrator, Scott Pruitt, said he would consider replacing the academic scientists [on the 18-member Board of Scientific Counselors] with <strong>representatives from industries </strong>whose pollution the agency is supposed to regulate, as part of the wide net it plans to cast.\"</li><li><strong>Fill federal bench: ... </strong>President Trump is <a href=\"https://www.axios.com/trump-beefing-up-federal-courts-with-10-conservatives-2397536876.html\" target=\"_blank\">expected to announce</a> 10 nominees to the lower federal courts today, part of a slate of conservative judges to begin filling the more than 120 openings on the bench. The NYT scooped this last night.</li></ul>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> The Rose Garden celebration on the House health bill was a sugar rush for Rs and no indication of momentum. The math on their own side remains intractable. And with the Cook Political Report's Amy Walter now giving Dems a 40-50% chance of taking the House, they're less likely than ever to help Trump."},{"slug":"trumps-comey-conundrum-2433389827","author":"Mike Allen","date":"1496660125","body":"\n                <p><strong>White House officials convey </strong>a sense of gloomy doom when they talk about fired FBI Director Jim Comey's public testimony on Thursday. They know his aw-shucks rectitude, combined with real-time written recollections, guarantee riveting testimony. Their hope is that it'll be more atmospherics than substance — how he felt, as opposed to any new facts about what President Trump said or did.<br/></p> <p><strong>Here's the problem</strong> with that hope: Even if Comey didn't have a single new thing to say (unlikely, given his habit of writing memos about his conversations with the president and perhaps his aides), the rat-tat-tat of already-reported, tough-to-explain facts is astounding:</p>\n                \n                <ul><li><strong>During a Valentine's Day briefing</strong> in the Oval Office, Trump <a href=\"https://www.nytimes.com/2017/05/16/us/politics/james-comey-trump-flynn-russia-investigation.html\" target=\"_blank\">asks other national-security officials</a> — including Vice President Pence and Attorney General Jeff Sessions — to leave the room before saying of the investigation into Michael Flynn, the national security adviser Trump had let go the day before: \"I hope you can let this go.\"</li><li><strong>That meeting, by itself</strong>, could be fodder for years of investigations. But then, three months later — after talking for weeks about firing Comey, with several aides warning of the dire dominoes that the move could touch off — Trump does it anyway, taking many top aides by surprise.</li><li><strong>That decision, </strong><strong>by itself </strong>— with its echoes of Watergate's \"Saturday night massacre\" firing of a special prosecutor — might dog Trump for the rest of his presidency. But the next day, Trump meets in the Oval Office with two top Russians, Foreign Minister Sergey Lavrov and Ambassador Sergey Kislyak. U.S. media are barred, but a Russian camera is allowed, and Trump's guests quickly release the astonishing shots of Trump and the burly Russians appearing to yuk it up.</li><li><strong>That, by itself, </strong>would be jaw-dropping, but then Trump is <a href=\"https://www.washingtonpost.com/world/national-security/trump-revealed-highly-classified-information-to-russian-foreign-minister-and-ambassador/2017/05/15/530c172a-3960-11e7-9e48-c4f199710b69_story.html\" target=\"_blank\">reported to have revealed</a> highly classified information during the meeting. Russian President Vladimir Putin, who had a notetaker at the meeting, <a href=\"http://www.cnn.com/2017/05/17/politics/russia-us-trump-lavrov-intel/index.html?sr=twCNN051717russia-us-trump-lavrov-intel1145AMStoryLink&amp;linkId=37678423\" target=\"_blank\">cheekily offers</a> to release a transcript.</li><li><strong>All that might, by itself,</strong> might be hard enough to believe or explain. But then Trump sits down with NBC's Lester Holt and says that when he was pondering the firing of Comey, \"I said to myself -- I said, you know, this Russia thing with Trump and Russia is a made-up story.\" Holt and his NBC News colleagues had war-gamed all kinds of ways to try to get Trump to say Russia was a factor, but he just said it — no cajoling required.</li></ul> <p><strong>Be smart: </strong>Comey's testimony may add logs, but the fire is blazing.</p> <p><strong>Key concession ... </strong>Sen. Mark Warner (Va.) — top Dem on the Senate Intelligence Committee, where Comey will testify — to CNN's Jake Tapper on \"State of the Union\": \"We have no smoking gun at this point.\"</p> <p><strong>Go deeper: </strong><a data-linked-post=\"2426079345\" href=\"https://www.axios.com/trump-and-russia-what-we-know-and-dont-2426079345.html\">Trump and Russia: What we know, what we don't</a></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart: </strong>Comey's testimony may add logs, but the fire is blazing."},{"slug":"trumps-daily-display-of-unprecedented-actions-behaviors-2440790600","author":"Mike Allen","date":"1497350717","body":"\n                <p><strong>We try very hard here </strong>to simply explain the Trump White House, and not join the pile-on. To us, the Trump world doesn't need more noise — it needs more explanation and illumination. But there are moments when it's important to remind even our staunchest pro-Trump readers that this often isn't anything approximating normal:</p>\n                \n                <ul><li><strong>In 18 years of covering presidents, </strong>we have never seen a Cabinet meeting like the one yesterday. Chief of Staff Reince Priebus, taking his turn to genuflect for a beaming Trump, said: \"On behalf of the entire senior staff around you, Mr. President, we thank you for the opportunity and the blessing that you've given us to serve your agenda and the American people.\"<em> </em><strong>(N.Y. Times front-page headline:</strong> \"<a href=\"https://www.nytimes.com/2017/06/12/us/politics/trump-boasts-of-record-setting-pace-of-activity.html\" target=\"_blank\">Flatterers First, Then President Praises</a> Himself'\" ... <strong>CNN chyron: </strong>\"TRUMP'S WEIRD CABINET MEETING.\")</li><li><strong>Going back to the Clintons, </strong>we have never seen a president and his family work so hard to promote or appear on a program like the Trumps' trumpet, \"Fox &amp; Friends.\" <a href=\"http://www.foxnews.com/politics/2017/06/12/ivanka-trump-surprised-by-viciousness-ferocity-fathers-critics.html\" target=\"_blank\"><strong>From yesterday's show</strong></a><strong>:</strong> <em>\"Hey, look! It's Ivanka Trump.\" ... </em><em>\"I join you almost </em><em>every morning, just not on the couch!\" </em>This came after Trump himself promoted the friendly show on Twitter, which he regularly does.</li><li><em></em><strong>In 228 years of presidents,</strong> none has canned the FBI director, then allowed his own Justice Department to appoint a special counsel — who within weeks his friends and allies would openly muse about firing.</li><li><strong>In modern presidential history,</strong> there is nothing comparable to the personal and public attacks on James Comey by the president and his eldest son. In the last few days alone, they have called Comey — a guy who most elected Republican officials in town like and trust — a liar, a coward, a criminal leaker, and \"<a href=\"https://www.washingtonpost.com/news/post-politics/wp/2017/06/11/trumps-son-seems-to-confirm-comeys-account-of-the-presidents-comments-on-the-flynn-investigation\" target=\"_blank\">a dishonest man of bad character</a>.\"</li></ul> <p><strong>Be smart:</strong> Remember that we're living through history that will be studied and debated until the end of time. Many Trump backers, both the eager and reluctant ones, enjoy the destruction of norms and bemoan the highly critical coverage of this presidency. But we should never lose sight that we are experiencing a daily display of unprecedented actions and behaviors.</p> <p><strong>P.S. Quote du jour — Ivanka Trump on \"<a href=\"http://www.foxnews.com/politics/2017/06/12/ivanka-trump-surprised-by-viciousness-ferocity-fathers-critics.html\" target=\"_blank\">Fox &amp; Friends</a>\": </strong>\"There is a level of viciousness that I was not expecting. I was not expecting the intensity of this experience. But this isn't supposed to be easy. ... [S]ome of the distractions and some of the ferocity, ... I was a little blindsided by.\"</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Remember that we're living through history that will be studied and debated until the end of time. Many Trump backers, both the eager and reluctant ones, enjoy the destruction of norms and bemoan the highly critical coverage of this presidency. But we should never lose sight that we are experiencing a daily display of unprecedented actions and behaviors."},{"slug":"trumps-economic-agenda-isnt-getting-people-to-spend-money-2459743688","author":"Axios","date":"1500128540","body":"\n            <p>Despite optimism in the financial markets, people are spending less, per <a href=\"http://link.axios.com/click/10087929.93384/aHR0cHM6Ly93d3cud3NqLmNvbS9hcnRpY2xlcy9vcHRpbWlzbS1pbi1maW5hbmNpYWwtbWFya2V0cy1mYWlscy10by1zaG93LWluLXJlYWwtZWNvbm9teS0xNTAwMDU5MzI1P3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48Bdb19331a\" target=\"_blank\">Wall Street Journal lead story</a> by Ben Leubsdorf:</p><ul class=\"ee-ul\"><li><strong>\"Stocks hit records</strong> [yesterday] and big U.S. banks reported stronger-than-expected earnings. But new government data showed consumers pulled back spending at mid-year even as markets rallied. Households also grew less optimistic about the future and inflation on consumer purchases softened.\"</li><li><strong>\"Trump has set out</strong> an agenda to push economic growth well beyond the roughly 2% pace that has prevailed since the recession ended in 2009, but so far there is little sign of a real breakout happening.\"</li><li><strong>Be smart</strong>: \"Markets—as they sometimes do— took bad economic news as good investment news.\"</li><li><strong>Why it matters:</strong> \"The president has suggested a number of policies to spur growth, including a tax overhaul and major infrastructure spending, but those aren't yet close to reality.\"</li></ul>\n\n    ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><ul class=\"ee-ul\"><li><strong>\"Stocks hit records</strong> [yesterday] and big U.S. banks reported stronger-than-expected earnings. But new government data showed consumers pulled back spending at mid-year even as markets rallied. Households also grew less optimistic about the future and inflation on consumer purchases softened.\"</li><li><strong>\"Trump has set out</strong> an agenda to push economic growth well beyond the roughly 2% pace that has prevailed since the recession ended in 2009, but so far there is little sign of a real breakout happening.\"</li><li><strong>Be smart</strong>: \"Markets—as they sometimes do— took bad economic news as good investment news.\"</li><li><strong>Why it matters:</strong> \"The president has suggested a number of policies to spur growth, including a tax overhaul and major infrastructure spending, but those aren't yet close to reality.\"</li></ul>\n\n    "},{"slug":"trumps-impending-twitter-timeout-2424058882","author":"Axios","date":"1495893596","body":"\n            <p>Nugget in a <a href=\"http://link.axios.com/click/9713591.88132/aHR0cHM6Ly93d3cud3NqLmNvbS9hcnRpY2xlcy90cnVtcC1leWVpbmctd2hpdGUtaG91c2Utc2hha2V1cC0xNDk1ODMxNjc5P3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0/58e3c99b566a9405178b4f48B75ab5122\" target=\"_blank\">Wall Street Journal front-pager</a> about Trump's coming staff shakeup (by Michael Bender and Peter Nicholas): </p><p><strong>\"One major change</strong> under consideration would see the president's social media posts vetted by a team of lawyers ... The idea, said one of Mr. Trump's advisers, is to create a system so that tweets 'don't go from the president's mind out to the universe.'\"</p><ul class=\"ee-ul\"><li><strong>Barry Bennett</strong>, a former Trump campaign aide: \"\"I would be shocked if he would agree to that.\"</li><li><strong>Memo to the folks</strong> who are plotting this: This has been tried before. Ask the inner circle from the transition. </li><li><strong>West Wing sources</strong> tell me a more likely scenario is for Marc Kasowitz, the lawyer leading Trump's outside Russia defense, might convince him he absolutely has to vet tweets relating to Russia.</li><li><strong>Be smart:</strong> Good luck with that, sir. </li></ul>\n\n    ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><ul class=\"ee-ul\"><li><strong>Barry Bennett</strong>, a former Trump campaign aide: \"\"I would be shocked if he would agree to that.\"</li><li><strong>Memo to the folks</strong> who are plotting this: This has been tried before. Ask the inner circle from the transition. </li><li><strong>West Wing sources</strong> tell me a more likely scenario is for Marc Kasowitz, the lawyer leading Trump's outside Russia defense, might convince him he absolutely has to vet tweets relating to Russia.</li><li><strong>Be smart:</strong> Good luck with that, sir. </li></ul>\n\n    "},{"slug":"trumps-main-attraction-cable-news-drama-2459102000","author":"Mike Allen","date":"1500032807","body":"\n                <p>After this week's Russia revelations, the mood in the West Wing is increasingly grim and paranoid. But President Trump seems to relish being embattled: One friend describes him as \"acting like a corner man in a boxing match.\"</p> <ul><li><strong>This is especially evident in Trump's constant patter about TV,</strong> as he praises aides for their combative appearances. He periodically asks about surrogates who have scored points on cable: \"Why isn't <em>she</em> my press secretary?\"</li><li><strong>In calls and Oval Office chats with supporters who have been on the tube</strong>, Trump gleefully reenacts exchanges with anchors blow by blow, referring to CNN as \"Fraud News\" even in private conversation. </li><li><strong>Regardless of what he or his staff say, he hate-watches \"Morning Joe\"</strong> — toggling among MSNBC, \"Fox &amp; Friends\" and CNN's \"New Day\".</li></ul>\n                \n                <p><strong>Be smart</strong><strong>:</strong> Aides say Trump loves the combat, and just wants respect and deference.</p> <p>An entertaining example of this phenomenon was <a data-linked-post=\"2458611709\" href=\"https://www.axios.com/trump-is-loving-gorkas-tv-host-confrontations-2458611709.html\">captured by Axios' Jonathan Swan</a> <em>(whose reporting informed the above)</em> in a piece about how much Trump loves the recent heated TV appearances by a deputy assistant, Sebastian Gorka (Twitter bio: \"Irregular Warfare Strategist\"):</p> <h5>\"Before Trump left for Paris, ... he was asking West Wing staff, 'Did you see Gorka? So great, I mean really, truly great.' Trump loved ... when Gorka told CNN morning host Alisyn Camerota that more people are interested in cartoons than CNN, and that the network's ratings are lower than 'Nick at Nite.'\"</h5>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart</strong><strong>:</strong> Aides say Trump loves the combat, and just wants respect and deference."},{"slug":"trumps-new-campaign-stoke-the-base-sully-the-investigators-2443298032","author":"Mike Allen","date":"1497706296","body":"\n                <p>A milestone, on Day 148 of the Trump presidency: Amid all the bluster and bellyaching, President Trump is acknowledging for the first time — with both public and private actions — that he's fighting to save his presidency.<br/></p> <p>It's his next campaign — triggered by his own pique and carelessness, long before he would have to formally gear up for 2020. This is a big reason nearly every action — and reaction — is aimed at shoring up his base.</p> <p>In moments of clarity amid his fits of rage, Trump knows he boxed himself in politically and legally by firing FBI Director Jim Comey, triggering what he though he could avoid: an all-consuming investigation focusing on him.</p>\n                \n                <p>Pause for a moment to soak in that the President of United States confirmed on the record via Twitter that Mueller is gunning for him. And attacked his own deputy attorney general, Rod Rosenstein (who now might resign or <a href=\"http://link.axios.com/click/9871273.7/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9wb2xpdGljcy9hcnRpY2xlcy8yMDE3LTA2LTE2L3RydW1wLWNvdWxkLWZvcmNlLW91dC1yb3NlbnN0ZWluLWJ1dC1mYWlsLXRvLXN0b3AtcnVzc2lhLXByb2JlP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48Bf8a8212d\" target=\"_blank\">recuse himself</a>).</p> <p><strong>The arsenal: </strong>Facing special counsel Robert Mueller's <a href=\"http://link.axios.com/click/9871273.7/aHR0cDovL3d3dy5jbm4uY29tLzIwMTcvMDYvMTYvcG9saXRpY3Mvcm9iZXJ0LW11ZWxsZXItc3BlY2lhbC1jb3Vuc2VsLWxhd3llcnMvaW5kZXguaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B0f4e345d\" target=\"_blank\">still-growing team of 13</a> prosecutorial killers, Trump is building his own arsenal. The president's personal legal team added the intimidating <a href=\"http://link.axios.com/click/9871273.7/aHR0cDovL3d3dy5qb2hubWRvd2QuY29tLz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B8e3672a5\" target=\"_blank\">John Dowd</a>, who represented Sen. John McCain in the Keating Five banking scandal, and whose <a href=\"http://link.axios.com/click/9871273.7/aHR0cDovL3d3dy50aGVkb3dkcmVwb3J0LmNvbS8_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58e3c99b566a9405178b4f48B1f327997\" target=\"_blank\">Dowd Report</a> for Major League Baseball got Pete Rose banished for life for gambling.</p> <p>Dowd, 76, joins longtime Trump lawyer Marc Kasowitz; Jay Sekulow, the <a href=\"http://link.axios.com/click/9871273.7/aHR0cHM6Ly93d3cuYXhpb3MuY29tL21lZXQtdHJ1bXBzLXR2LWxhd3llci0yNDM5OTUwOTMzLmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPXNlbmR0b19uZXdzbGV0dGVydGVzdCZzdHJlYW09dG9wLXN0b3JpZXM/58e3c99b566a9405178b4f48B1f3fdc88\" target=\"_blank\">TV face of the team</a>, who's doing a \"full Ginsburg\" <a href=\"http://link.axios.com/click/9871273.7/aHR0cHM6Ly9hcG5ld3MuY29tLzA3YzlmMjgwYzdhNDRlNmU4YzdiNjkxZjljZDc2YzU2L0d1ZXN0LWxpbmV1cHMtZm9yLXRoZS1TdW5kYXktbmV3cy1zaG93cz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B23c7632d\" target=\"_blank\">blitz oftomorrow's Sunday shows</a>; and <a href=\"http://link.axios.com/click/9871273.7/aHR0cDovL2NvcmFsbG9tZWRpYXN0cmF0ZWdpZXMuY29tL2NvcmFsbG8uaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249c2VuZHRvX25ld3NsZXR0ZXJ0ZXN0JnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B016d5ed1\" target=\"_blank\">Mark Corallo</a>, a Justice Department alumnus who was Rep. Bob Livingston's press secretary during the Clinton impeachment.</p> <p><strong><a href=\"http://link.axios.com/click/9871273.7/aHR0cHM6Ly93d3cucmV1dGVycy5jb20vYXJ0aWNsZS91cy11c2EtdHJ1bXAtcnVzc2lhLWxhd3llci1pZFVTS0JOMTk4MDBYP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1zZW5kdG9fbmV3c2xldHRlcnRlc3Qmc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48Bf7a62897\" target=\"_blank\">Reuters reports</a>:</strong> \"Another well-known white-collar Washington lawyer will likely join the team shortly.\"</p> <p><strong>Be smart:</strong> Trump, notorious for his litigiousness in New York, is playing an inside-outside game: stockpiling talent to protect him legally, while publicly trying to discredit the investigators and whatever they might eventually say or do.</p> <p><strong>A problem for Trump:</strong> Those things are at odds. Everything Trump says now, Bob Mueller will use against him.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Trump, notorious for his litigiousness in New York, is playing an inside-outside game: stockpiling talent to protect him legally, while publicly trying to discredit the investigators and whatever they might eventually say or do."},{"slug":"trumps-nickname-for-newest-political-enemy-witch-hunt-2443825345","author":"Mike Allen","date":"1497792997","body":"\n                <p>Little Marco. Crooked Hillary. Crazy Bernie. Lyin' Ted. Low-energy Jeb. Goofy Elizabeth Warren. And now ... \"The Witch Hunt.\"</p> <p>Trump, forced into campaign mode by his own actions and indiscretions, has officially branded the investigation by his own Justice Department.</p>\n                \n                <p>His pair of tweets this morning from Camp David:</p> <p style=\"margin-left: 20px;\"><em>\"The MAKE AMERICA GREAT AGAIN agenda is doing very well despite the distraction of the Witch Hunt. Many new jobs, high business enthusiasm, ... massive regulation cuts, 36 new legislative bills signed, great new S.C.Justice, and Infrastructure, Healthcare and Tax Cuts in works!\"</em></p> <p>\"Witch Hunt\" with caps is a Trump signature. He also capped it on May 31, and twice on Friday. One variation there that we're likely to see/hear again: \"phony Witch Hunt.\"</p> <p style=\"margin-left: 20px;\"><em><a href=\"http://link.axios.com/click/9875363.19602/aHR0cHM6Ly90d2l0dGVyLmNvbS9yZWFsRG9uYWxkVHJ1bXAvc3RhdHVzLzg3NTMyMTQ3ODg0OTM2Mzk2OD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9B8d6bfd49\" target=\"_blank\">The day before</a>, the all-caps: \"You are witnessing the single greatest WITCH HUNT in American political history - led by some very bad and conflicted people!\"</em></p> <p>Longtime Trump aides tell us that during the campaign, the lifelong branding expert workshopped his nicknames, kicking around possibilities on the plane before settling on the catchiest and most subversive.</p> <p>He first tweeted \"witch hunt,\" in lower case, on May 12, three days after firing Comey, and then again on May 18, the day after Bob Mueller was appointed special counsel: \"This is the single greatest witch hunt of a politician in American history!\"</p> <p><strong>Be smart:</strong> Trump's brio, branding and bombast can't mask the glum reality, reflected in an increasingly fatalistic mood in Trumpworld.</p> <p style=\"margin-left: 20px;\"><em>\"There are no good days,\" said a confidant to the inner circle. \"They are caught in the endless cycle of the off-message tweets and leaks.\"</em></p> <p><strong>Dive deeper</strong> ... \"<a href=\"http://link.axios.com/click/9875363.19602/aHR0cHM6Ly93d3cuYXhpb3MuY29tL21lZXQtYm9iLW11ZWxsZXJzLWRyZWFtLXRlYW0tdGFja2xpbmctdGhlLXJ1c3NpYS1pbnZlc3RpZ2F0aW9uLTI0NDM0NzIyNjcuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58af12c227fdb0d83d8b51d9Bf5e3c48a\" target=\"_blank\">Meet Bob Mueller's team</a> tackling the Russia investigation\" ... <a href=\"http://link.axios.com/click/9875363.19602/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNi8xOC91cy9wb2xpdGljcy9taWNoYWVsLWZseW5uLWludGVsLWdyb3VwLXRydW1wLmh0bWw_dXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV9tZWRpdW09ZW1haWwmdXRtX2NhbXBhaWduPW5ld3NsZXR0ZXJfYXhpb3NhbSZzdHJlYW09dG9wLXN0b3JpZXM/58af12c227fdb0d83d8b51d9Bf08ae0e2\" target=\"_blank\">N.Y. Times, top of col. 1</a>, \"Flynn's Disdain For Limits Led To a Legal Mire.\"</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Trump's brio, branding and bombast can't mask the glum reality, reflected in an increasingly fatalistic mood in Trumpworld."},{"slug":"trumps-response-to-comey-testimony-retaliation-2437833797","author":"Mike Allen","date":"1497005870","body":"\n                <p>President Trump's advisers feared Jim Comey had held back some devastating cards, and would unfurl new facts that could speed Trump's legal or political troubles. Instead, they considered yesterday's mesmerizing testimony a damaging but not cataclysmic public spectacle. <strong>\"The threat level</strong> to the presidency is less than it was,\" a White House adviser said.</p> <p>Mainly, they were relieved that POTUS didn't tweet yesterday. <strong>But</strong> <strong>Trump tweeted this morning:</strong> \"Despite so many false statements and lies, total and complete vindication...and WOW, Comey is a leaker!\"</p>\n                \n                <p>Look for Trump and his allies to scream four things:</p> <ul><li><strong>Comey's a liar: </strong>After the hearing, Marc Kasowitz, Trump's personal lawyer, escalated the combat: \"The president ... never told Mr. Comey, quote, 'I need loyalty, I expect loyalty.'\"</li><li><strong>Comey's a leaker: </strong>Kasowitz also said: \"Comey admitted that he unilaterally and surreptitiously made unauthorized disclosures to the press of privileged communications with the president.\"</li><li><strong>Clinton did it, too: </strong>Republicans instantly jumped on Comey's charge that Loretta Lynch, Obama's attorney general, had encouraged him to echo Clinton campaign lingo in discussing the email probe.</li><li><strong>Comey agrees: Fake news!</strong> If Trump enjoyed any moment of the hearing, it was surely when Comey said a memorable New York Times story was untrue.</li></ul> <p><strong>But don't lose sight: </strong>There is no way to spin away this was a very dark and damning day for Trump. The head of the FBI testified he so distrusted his own president and White House that he took detailed notes of his conversations to prove he felt pressure to drop an investigation of collusion with the Russians. He then felt so strongly he leaked those notes to the press to force a special prosecutor. <em>Imagine Act 2!</em></p> <ul><li><strong>Be smart: </strong>This wasn't the end but the beginning of a long, agonizing process for the Trump White House. What they fear most is the probes into central figures <em>around</em> Trump, and what happens when investigators dig into the context for so many meetings with the Russians.</li><li><strong>Up next:</strong> Attorney General Jeff Sessions' testimony <a href=\"http://link.axios.com/click/9806728.93012/aHR0cHM6Ly93d3cubGVhaHkuc2VuYXRlLmdvdi9wcmVzcy8tY29tbWVudC1vZi1zZW5hdG9yLXBhdHJpY2stbGVhaHktZC12dC1vbi1mb3JtZXItZmJpLWRpcmVjdG9yLWphbWVzLWNvbWV5LWFuZC1hdHRvcm5leS1nZW5lcmFsLWplZmYtc2Vzc2lvbnMtdGVzdGltb255LW5leHQtd2Vlaz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B8d9a2bf7\" target=\"_blank\"><u></u></a>before a Senate appropriations subcommittee becomes high drama. And the Senate Intelligence Committee expects Jared Kushner to meet with committee staffers.</li></ul> <p><strong>Top Comey quote:</strong> \"[T]here should be no fuzz on this whatsoever. The Russians interfered in our election during the 2016 cycle. They did it with purpose. They did it with sophistication. They did it with overwhelming technical efforts. And it was an active-measures campaign driven from the top of that government. There is no fuzz on that.\"<br/></p> <p><strong><a href=\"http://link.axios.com/click/9806728.93012/aHR0cHM6Ly93d3cubnl0aW1lcy5jb20vMjAxNy8wNi8wOC91cy9wb2xpdGljcy9jb21leS1oZWFyaW5nLXRydW1wLXJ1c3NpYS5odG1sP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zYW0mc3RyZWFtPXRvcC1zdG9yaWVz/58e3c99b566a9405178b4f48B531cb35a\" target=\"_blank\">N.Y. Times Quote of the Day</a>,</strong> Comey: \"The president surely knows if there are tapes. If there are, my feelings aren't hurt. Release the tapes.\"</p> <ul><li><strong>The buzz</strong>: Is the flat denial by Trump's lawyer that he said something Comey attributed to him during the Green Room dinner (\"I need loyalty\") a clue that there aren't tapes?</li></ul>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"> <ul><li><strong>Be smart: </strong>This wasn't the end but the beginning of a long, agonizing process for the Trump White House. What they fear most is the probes into central figures <em>around</em> Trump, and what happens when investigators dig into the context for so many meetings with the Russians.</li><li><strong>Up next:</strong> Attorney General Jeff Sessions' testimony <a href=\"http://link.axios.com/click/9806728.93012/aHR0cHM6Ly93d3cubGVhaHkuc2VuYXRlLmdvdi9wcmVzcy8tY29tbWVudC1vZi1zZW5hdG9yLXBhdHJpY2stbGVhaHktZC12dC1vbi1mb3JtZXItZmJpLWRpcmVjdG9yLWphbWVzLWNvbWV5LWFuZC1hdHRvcm5leS1nZW5lcmFsLWplZmYtc2Vzc2lvbnMtdGVzdGltb255LW5leHQtd2Vlaz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/58e3c99b566a9405178b4f48B8d9a2bf7\" target=\"_blank\"><u></u></a>before a Senate appropriations subcommittee becomes high drama. And the Senate Intelligence Committee expects Jared Kushner to meet with committee staffers.</li></ul> "},{"slug":"trumps-russia-response-was-not-under-control-2438934967","author":"Mike Allen","date":"1497098389","body":"\n                <p>Friends and lawyers were aghast after President Trump brashly declared yesterday that he was willing to testify under oath for special counsel Bob Mueller, to give his own version of events fired FBI director Jim Comey described.</p> <p><strong>One well-wired Republican said:</strong> \"The White House says they have the investigation under control. Volunteering to sit down with a special prosecutor is kind of the definition of things not being under control.\"</p> <p>These people said the fact that Trump blurted out \"100 percent!,\" in response to a question from ABC's Jon Karl, is proof of why the president shouldn't be giving a deposition to a federal prosecutor. He answered in the moment, with brio, and without regard to what his lawyer or aides might advise.</p>\n                \n                <p><strong></strong></p> <p><strong>How lawyers</strong> would have advised Trump to answer: \"I've said that there's nothing there, but that I want to see this investigation done and done properly, and so of course I will do what I can to help get there.\" <em>He wants to sound positive, but avoid being specific or overcommitting.</em></p> <p><em></em>The lawyers pointed out that Trump isn't bound by something he said at a press conference. And his lawyer, Marc Kasowitz, could always set terms that had the effect of delaying or limiting Trump's testimony.</p> <p>Here are some of the considerations that cause lawyers to strongly advise against such an appearance:</p> <ul><li><strong>Danger 1:</strong> Lawyers said such a meeting would be \"a massive false-statements trap,\" because Trump is inclined to remember things selectively, and often embraces a version of events that is the way he would like them to be. And by the time he talked to the president, Mueller would have an arsenal of evidence. So Trump's characteristic certainty — \"I never said that!\" or \"I never did that!\" — could mean trouble. Trump in the Rose Garden yesterday (which made N.Y. Times Quote of the Day): \"I didn't say that. ... And there would be nothing wrong if I did say it.\")</li><li><strong>Danger 2</strong>: Trump would be unlikely to prepare adequately. He has little patience and a short attention span, doesn't like to study written documents, and prefers to ad lib.</li></ul> <p>Be smart: Yesterday's declaration shows that Trump's Russia-related comments aren't being fully vetted by his legal team — meaning that he may keep creating new landmines for himself, as Mueller works away.</p> <ul><li><strong>And yesterday's tweets won't help: </strong>By calling Comey a liar and complaining about the probe, Trump risks coloring prosecutors' impressions of him. Lawyers explain that Trump's temperament and M.O. will be key if prosecutors are looking at intent. And with his tweets and barbs, a top lawyer said: \"He is confirming that the way they think he operates, is the way he actually operates.\"</li><li><strong>Extreme case: </strong>Marc Kasowitz can refuse to allow testimony — and Trump could direct the firing of Mueller.</li></ul>\n                ","trump":true,"beSmart":false,"beSmarC":true,"smarts":">Be smart: Yesterday's declaration shows that Trump's Russia-related comments aren't being fully vetted by his legal team — meaning that he may keep creating new landmines for himself, as Mueller works away."},{"slug":"trumps-street-fighters-2421476130","author":"Mike Allen","date":"1495714320","body":"\n                <p>West Wing officials are prepping for a years-long war with investigators and the bureaucracy, with plans to beef up legal, surrogate, communications and rapid-response teams as part of a \"new normal\" for President Trump — besieged.</p> <p>\"The White House is embracing the fight, which is going to last as long as Donald Trump is president,\" said a Trump ally familiar with the preparations. \"We're getting street fighters ready to go.\"</p>\n                \n                <p>A West Wing official said Trump has been frustrated by the ferocity of the incoming, and has demanded a more visible response.</p> <p>Trump aides recognize that besides being in the crosshairs of investigators on Russia, they will be the continuing target of leaks from the bureaucracy. The Trump ally referred to this second enemy as \"nameless, faceless, deep-state types\" who have been inflamed and are punching back through the media.</p> <ul><li><strong>What's </strong><strong>next:</strong> Proposed war-room org charts have been prepared, and final decisions on the structure will be made after Trump returns this weekend.</li><li><strong>Jonathan Swan hears </strong>that comms/rapid response structures are being considered for both inside the White House and on the outside.</li><li><strong>The moving parts</strong><strong>:</strong> Reince Priebus and Steve Bannon broke off from the trip and returned early, in part to quarterback planning. Numerous officials are involved. There was extra urgency because fired FBI Director Jim Comey had been expected to testify on the Hill next week. But that has been postponed so he can first meet privately with special counsel Robert Mueller.</li><li><strong>The backstory:</strong> Aides recognize they should have built more push-back capacity from the beginning. But the weakness reflects the minimalist transition planning and thin staffing that have beset the whole Trump machine.</li></ul> <p><strong>Be smart:</strong> The new machinery is an effort to compartmentalize the scandals, so that some officials can focus on probes and revelations while others do their day jobs. But the success of that plan depends partly on President Trump's willingness to compartmentalize. Close aides have trouble imagining that.</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> The new machinery is an effort to compartmentalize the scandals, so that some officials can focus on probes and revelations while others do their day jobs. But the success of that plan depends partly on President Trump's willingness to compartmentalize. Close aides have trouble imagining that."},{"slug":"trumps-war-room-2418860156","author":"Mike Allen","date":"1495537313","body":"\n                <p><strong>Day 124... </strong>White House officials tell me they're gearing up for months, and likely years, of Russia defense. Trump and his inner circle are belatedly scrambling to install war-room-like mechanisms designed to prevent the drama and threat from consuming the entire West Wing, and derailing everything else.</p> <p>Trump aides have studied precedents, including the Reagan White House's handling of Iran-Contra and President Clinton's scandal machinery.</p> <p>The West Wing appears to be absorbing key lessons from its predecessors, although even Trump allies tell me he's just beginning to take steps to wall off the controversy that should have begun on Day 1:</p>\n                \n                <ul><li><strong>Trump aides</strong> recognize the Russia defense will be essentially permanent, and are finally planning structures to reflect that.</li><li><strong>A key takeaway</strong> from past administrations is to designate one office or official to handle all the legal and communications issues, so there's a consistent response and everyone else isn't constantly sucked in.</li><li><strong>In \"<a href=\"http://link.axios.com/click/9677996.77057/aHR0cHM6Ly93d3cud2FzaGluZ3RvbnBvc3QuY29tL3BvbGl0aWNzL3RydW1wLWNsb3NlLXRvLWNob29zaW5nLW91dHNpZGUtY291bnNlbC1mb3ItcnVzc2lhLWludmVzdGlnYXRpb24vMjAxNy8wNS8yMi84NzA5ZjYyZS0zZjIyLTExZTctOTg2OS1iYWM4YjQ0NjgyMGFfc3RvcnkuaHRtbD91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2Ft/583ee2d50aea11da218b513aBe314fc1c\" target=\"_blank\">Trump looking at outside counsel</a> </strong>for Russia probe,\" the WashPost's Bob Costa and Ashley Parker report: \"[A]ttorneys who have spoken to the White House and who are seen as the finalists are Marc E. Kasowitz; Robert J. Giuffra Jr.; Reid H. Weingarten; and Theodore B. Olson.\"</li><li><strong>\"Two other attorneys </strong>who were originally viewed as contenders but have since drifted away from the mix ... are Brendan V. Sullivan Jr. ... and A.B. Culvahouse Jr.\"</li><li><strong>\"Kasowitz, </strong>who has known Trump for decades, is expected to take a leading role.\"</li><li><strong>Separately, </strong>Trump \"personally reached out to two of his former campaign aides — his first campaign manager, Corey Lewandowski, and his deputy campaign manager, David Bossie — to sound them out about working with the administration as crisis managers,\" per <a href=\"http://link.axios.com/click/9677996.77057/aHR0cDovL3d3dy5wb2xpdGljby5jb20vc3RvcnkvMjAxNy8wNS8yMi90cnVtcC1jcmlzaXMtYm9zc2llLWxld2FuZG93c2tpLTIzODY4OT91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2Ft/583ee2d50aea11da218b513aBafe14891\" target=\"_blank\">Politico's Eliana Johnson and Josh Dawsey</a>.</li></ul> <p>What could go wrong? One Trump ally said the list of legal eagles is encouraging: \"These guys know how to fight a war.\"</p> <ul><li><strong>Be smart:</strong> Both Republican and Democratic lawyers tell me the legal \"Team of Rivals\" could replicate some of the West Wing's dysfunction, forcing lawyers who are used to being in charge to compete for Trump's ear.</li></ul>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"> <ul><li><strong>Be smart:</strong> Both Republican and Democratic lawyers tell me the legal \"Team of Rivals\" could replicate some of the West Wing's dysfunction, forcing lawyers who are used to being in charge to compete for Trump's ear.</li></ul>\n                "},{"slug":"washingtons-retirement-watch-for-justice-kennedy-2448438049","author":"Mike Allen","date":"1498475354","body":"\n                <p>White House sources think Justice Anthony Kennedy, the Supreme Court's ideological fulcrum, may announce his retirement today, as the justices gather on the bench for the last time this term.</p> <p>If that happens, Day 158 instantly becomes President Trump's biggest moment.</p>\n                \n                <ul><li><strong>Trump's first Court appointment,</strong> of Justice Neil Gorsuch, was a one-for-one ideological swap for the late Justice Antonin Scalia.</li><li><strong>Replacing Kennedy</strong> would be even more historic and consequential: a momentous chance to edge the Court right, since Kennedy is the center of the Court — the one most willing to listen to both sides. On a controversial case, both sides pitch to him. It's been called \"Kennedy's Court.\"</li><li><strong>No one's predicting: </strong>Court watchers say no one knows, and Kennedy has said nothing publicly. He could well wait one more year: The Court buzz is that it'll be this year or next.</li><li><strong>Lyle Denniston,</strong> who has covered the Supreme Court for 58 years, headlines <a href=\"http://link.axios.com/click/9933636.73569/aHR0cDovL2x5bGRlbmxhd25ld3MuY29tLzIwMTcvMDYvMjQvaGlnaC1kcmFtYS1zdXByZW1lLWNvdXJ0LXRlcm0tZW5kaW5nLWx5bGUtZGVubmlzdG9uLz91dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX21lZGl1bT1lbWFpbCZ1dG1fY2FtcGFpZ249bmV3c2xldHRlcl9heGlvc2FtJnN0cmVhbT10b3Atc3Rvcmllcw/583ee2d50aea11da218b513aB35f8ef41\" target=\"_blank\">a post on his website</a>, \"High drama: Supreme Court term is ending\": \"[R]umors have continued to make the rounds that ... Kennedy, who will be 81 in July, could reveal plans [today] to end his career. ... The longest serving of the Justices, Kennedy joined the court more than 29 years ago.\"</li></ul> <p><strong>Be smart:</strong> Few domestic developments could more instantly and decisively change the national conversation — blotting out almost everything else, and vastly reducing the sting for conservatives is healthcare tanks.</p> <p><strong>A Washington wise man emails:</strong> \"With two court appointments and maybe one more, Trump's presidency will be consequential even if he has few legislative achievements. This week may well demonstrate both.\"</p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>Be smart:</strong> Few domestic developments could more instantly and decisively change the national conversation — blotting out almost everything else, and vastly reducing the sting for conservatives is healthcare tanks."},{"slug":"why-silicon-valley-could-be-next-target-for-trump-style-nationalism-2444299454","author":"Mike Allen","date":"1497865274","body":"\n                <p>As tech royalty converges on the White House today for an American Technology Council meeting, the darlings of Silicon Valley are in danger of becoming the devils of Trumpism's nationalist wing.</p> <p>This won't happen overnight, but danger signs are everywhere. </p>\n                \n                <p>Axios Tech Editor Kim Hart <a href=\"https://www.axios.com/the-growing-antitrust-concerns-about-u-s-tech-giants-2433870013.html\" target=\"_blank\">wrote last week </a>that the giants, with their \"enormous concentrations of wealth and data,\" are \"drawing the attention of economists and academics who warn they're growing too powerful.\"</p> <strong>Turns out it's government, too. </strong> The Bannon wing of the White House would like to take on the lords of the Valley now over outsourcing, the concentration of wealth and their control over our data and lives. But this fight is on hold for a later date, officials tell us. <p><br/><strong>The bigger problem for tech</strong> is that many Americans are rethinking their romantic views of the hottest and biggest companies of the new economy. As people look for villains to blame, tech might get its turn:</p> <ul><li><strong>Some shine has come off Facebook</strong> (though not in user data, Dan Primack points out: People still love the service), as executives fend off grievances about fake news, live violence and the filter bubble.</li><li><strong>Silicon Valley</strong> makes itself a juicy target with its male dominance, concentration of wealth (in both people and places), and reliance on foreign workers.</li><li><strong>Robots</strong> <strong>will soon</strong> be eating lots of jobs, with working-class, blue collar workers — an engine of the Trump coalition — at the most immediate risk. Many think this will be the story of the next 10 years.</li><li><strong>Anyone familiar</strong> with military intelligence will tell you cyber-risk is much greater than most people realize. Russians used cyber tools to try to throw the 2016, and electronic attack is perhaps the greatest U.S vulnerability to an international power.</li></ul> <p><strong>People increasingly distrust technology,</strong> and the companies will increasingly be in the crosshairs. Richard Edelman — president and CEO of the global communications firm — wrote in introducing <a href=\"https://www.scribd.com/document/336621519/2017-Edelman-Trust-Barometer-Executive-Summary?\" target=\"_blank\">Edelman's 2017 Trust Barometer:</a> \"[O]ngoing globalization and technological change are now further weakening people's trust in global institutions, which they believe have failed to protect them from the negative effects of these forces.<br/><br/><strong>Be smart: </strong>Tech executives are very aware of the public's unsettled mood and fearful that if they completely disengage with Trump the White House will turn on their companies. That's why many are here today!<br/><br/><strong>Dive deeper:</strong> <a href=\"https://www.axios.com/what-apples-tim-cook-will-tell-trump-2444012547.html\" target=\"_blank\">\"What Apple's Tim Cook will tell Trump\" </a>(CEOs come with their own agendas: He'll raise topics the White House hadn't planned)</p> <p><strong>Off embargo at 6 a.m.:</strong> <a href=\"https://www.axios.com/silicon-valleys-elite-comes-to-trumps-washington-2442949984.html\" target=\"_blank\">\"Silicon Valley's elite comes to Trump's Washington.\"</a></p>\n                ","trump":true,"beSmart":true,"beSmarC":true,"smarts":"><strong>People increasingly distrust technology,</strong> and the companies will increasingly be in the crosshairs. Richard Edelman — president and CEO of the global communications firm — wrote in introducing <a href=\"https://www.scribd.com/document/336621519/2017-Edelman-Trust-Barometer-Executive-Summary?\" target=\"_blank\">Edelman's 2017 Trust Barometer:</a> \"[O]ngoing globalization and technological change are now further weakening people's trust in global institutions, which they believe have failed to protect them from the negative effects of these forces.<br/><br/><strong>Be smart: </strong>Tech executives are very aware of the public's unsettled mood and fearful that if they completely disengage with Trump the White House will turn on their companies. That's why many are here today!<br/><br/><strong>Dive deeper:</strong> <a href=\"https://www.axios.com/what-apples-tim-cook-will-tell-trump-2444012547.html\" target=\"_blank\">\"What Apple's Tim Cook will tell Trump\" </a>(CEOs come with their own agendas: He'll raise topics the White House hadn't planned)"}]